XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Megawin</vendor>
  <name>CM0_DFP</name>
  <description>Megawin MG32F02A/MG32F02U/MG32F02V series Device</description>
  <url>http://www.megawin.com.tw/upload/media/MCU32/megawinDFP/</url>
  <supportContact>sales@megawin.com.tw</supportContact>
  <!-- optional license file -->
  <!-- 
  <license>
  </license>
  -->
  <releases>
    <release version="4.3.0" date="2023-12-06">
      -Modify Megawin Cortex-M0 device selection.
      -Fix MG32x02z_TM_Init.h.
    </release>
    <release version="4.2.0" date="2023-08-04">
      -Add SPI ePaper 2.13inch sample project.
      -Fix MG32x02z_TM_Init.c/.h's 'Cycle by cyle mode' option item.
      -Add 'Keep capture data' option for 'MG32x02z_TM_Init.c/.h'.
      -Modify MG32x02z_SPI_MID.c/.h
        -Modify 'MID_SPI_Transmit' timeout issue.
        -Modify 'MID_SPI_TransmitReceive' timeout issue.
        -Modify 'SPI_EndRxTxTransaction' for the function read address alignment issue.
        -Modify 'SPI_EndRxTransaction' for the function read address alignment issue.
        -Modify 'MID_SPI_Init' parameter issue. 
        -Modify timeout define.
      -Modify 'MG32x02z_SPI_MID.h' parameter issue. 
      -Modify 'MG32x02z_SPI_Init.c' 
        -Initial parameter structure. 
        -Rename mUSPIx define.
      -Modify 'MG32x02z_CSC_Init.c'.
        -Code size + CSC version issue.
        -USB_DIV issue.
      -Modify 'MG32x02z_URT_Init.c/.h' file.
        -Support middleware IRQ.
        -Some callback function.
        -Code issue.
    </release>
    <release version="4.1.1" date="2023-06-12">
      -Modify 'USB_Keyboard with EasyPOD Mini Project', 'USB_Keyboard_with_EasyCOM_EasyHID_Project' example projects (Support MBIA054 LED).
      -Modify 'SPI_LED_Driver_Project' example project (Support MBIA054 LED).
      -Replace 'SPI LCD Show Character' by 'SPI LCD Show Character and Graphy' (Add graphy function).
      -Modify 'MG32x02Z_SPI_MID.c' (transmit and receive function).
        -Update 1.0.2 to 1.0.3.
      -Modify 'MG32x02z_CSC_MID.c' (declare CONF_CSC_EXTCK define).
        -Update 1.0.0 to 1.0.1.
      -Modify system_MG32x02z.c/.h file ("#define" item)
        -(.c)Update 1.0.1 to 1.0.2
        -(.h)Update 1.0.0 to 1.0.1
      -Modify 'MG32x02z_I2C_Init.c', 'MG32x02z_I2C_MID.c' file (Calculation formula)
        -(MG32x02z_I2C_Init.c)Update 1.0.1 to 1.0.2.
        -(MG32x02z_I2C_MID.c)Update 1.0.0 to 1.0.1.
      -Modify 'Sample_I2C_ByteMode_Simple.c' (I2C_BusStart, I2C_Master_BusStop, I2C_Transmiter, I2C_Receive function)
    </release>
    <release version="4.1.0" date="2023-05-29">
      -Add 'MG32F02A132_PWM_AudioOut' project. (PWM output with Driver/Middleware) 
      -Add 'MG32F02A032_PWM_AudioOut' project. (PWM output with Driver/Middleware) 
      -Add 'MG32F02A128_PWM_AudioOut' project. (PWM output with Driver/Middleware) 
      -Add 'MG32F02U128_PWM_AudioOut' project. (PWM output with Driver/Middleware) 
      -Add 'MG32F02V032_PWM_AudioOut' project. (PWM output with Driver/Middleware)
      -Add Sample Code:
        1. Sample_MID_SPI_TemperatureDetector (RTD sample code for middleware)
        2. Sample_SPI_TemperatureDetector (RTD sample code for driver)
        3. Sample_SPI_Master_OPI_PSRAM (OPI PSRAM access.)
      -Update project : TH222A_Test_Project, USB_Keyboard_Project
      -Update initial wizard : TM / WWDT / IWDT / RTC / MEM / GPL / I2C / EMB_Init.c
      -Modify MG32x02z__IRQHandler.c (RTC / WWDR with "__weak")
      -Update middleware peripheral : IWDT
    </release>
    <release version="4.0.0" date="2023-04-20">
      Only for MG32CoGen v2.0.0.20 
    </release>
    <release version="3.7.0" date="2023-03-29">
      -Update 'MG32x02z_ChipInit.c' and 'MG32x02z_ChipInit.h' file. 
        -Modify CSC_Init function. 
        -Modify 'MG32x02z_URT_Init.c/.h' file. (Apply MG32CoGen.exe)(Version:1.0.1->1.0.2) 
        -Add 'MG32x02z_WWDT_Init.c/.h' initial file. (Version:1.0.0) 
        -Add 'MG32x02z_IWDT_Init.c/.h' initial file. (Version:1.0.0) 
        -Fix BKIE bit in 'MG32x02z_TM_Init.h'. (And update version)
        -Modify APB/TM/DAC/ADC/CMP/CCL/URT Initial with Middleware IRQ support.
      -Add 'BLE_HC42_Project' project. (BLE use HC-42) 
      -Add 'USB_Keyboard_with_EasyCOM_EasyHID_Project' project.     
      -Add 'Sample_CMP_WakeupFromSLEEPMode','Sample_CMP_WakeupFromSTOPMode','Sample_MID_CMP_WakeupFromSLEEPMode' and 'Sample_MID_CMP_WakeupFromSTOPMode' sample code. 
      -Add 'Sample_CSC_PLL_Init.c' sample code. 
      -Add 'Sample_PW_BODx.c' sample code. (BODx sample code interrupt, ON/SLEEP mode) 
      -Add 'Sample_RST_TriggerReset.c' sample code - to triggert cold reset or warm reset. 
      -Add 'Sample_RST_DetectResetEvent.c' sample code - to check reset flags. 
      -Update DAC Middleware version. 
      -Rename fila name :'Sample_WakeupFromSLEEPMode' to  'Sample_RTC_WakeupFromSLEEPMode' 
      -Rename fila name :'Sample_WakeupFromSTOPMode' to  'Sample_RTC_WakeupFromSTOPMode' 
    </release>
    <release version="3.6.0" date="2023-02-23">
      -Update 'MG32x02z_CSC_DRV.c' file. 
        -Modify CSC_XOSC_Cmd, CSC_PLL_Config function.
        -New CSC_EXTCK_Cmd function.
      -Update 'Sample_Enter_STOP_SLEEP_Mode.c','Sample_WakeupFromSLEEPMode.c', 'Sample_WakeupFromSTOPMode.c' file.
      -Add 'Sample_CSC_XOSC_Init' sample code. (select to CK_XOSC sample code)
      -Add 'Sample_CSC_EXTCK_Init' sample code. (select to CK_EXT sample code)
      -Add 'BLE_HC06_Project' project. (BLE use HC-06)
      -Rename 'BLE_Project' to 'BLE_MG126_Project'.
    </release>
    <release version="3.5.0" date="2023-01-09">
      -Update all MCU MG32x02z.h. (NULL_0 definition)
      -Update Middleware code for GCC.
      -Update Sample_Retraget.c for GCC. (smaller printf funnction)
      -Update 'MG32F02A032 BLDC_Sinewave', 'MG32F02A032 BLDC_Square', 'SmartCard_Reader_Project', 'RTC_ShowCalendar' project.       
      -Update 'USB_EasyCOM Project', 'MG04_06x', 'IEC60730_Project' project.
      -Update 'URT_Config' function.
      -Update 'system_MG32x02z.c' function. (Move the DIV function here)
      -Update 'MG32x02z__IRQHandler.c' file. (Modify CSC_IRQ, IWDT_IRQ function)
      -Add 'MG32x02z_I2C_Init.c/h' wizard file.
      -Add 'USB_EasyCOM with EasyHID', 'USB Mouse with EasyHID', 'SPI LCD Show Character', 'SPI_LED_Driver_Project' project.
      -Add 'Sample_IWDT_GeneralTimer', 'Sample_WWDT_GeneralTimer', 'Sample_RTC_GeneralTimer.c' code.
      -Add 'Sample_SPI_Master_DPI_DMA_M2P.c' and 'Sample_SPI_Master_DPI_DMA_P2M.c' sample code.
      -Add 'Sample_SPI_Master_QPI_DMA_M2P.c' and 'Sample_SPI_Master_QPI_DMA_P2M.c' sample code.
      -Add 'Sample_SPI_Master_OPI_DMA_M2P.c' and 'Sample_SPI_Master_OPI_DMA_P2M.c' sample code.
      -Modify 'Sample_SPI_Master_StandardSPI_DMA_M2P.c' and 'Sample_SPI_Master_StandardSPI_DMA_P2M.c' file.
    </release>
    <release version="3.4.0" date="2022-11-28">
      -Update MG32x02z_TM/ADC/CMP/DAC_Init.c/h. 
      -Fixed SPI initial code in ChipInit.c.
      -Update Sample_Retraget.c for GCC. (printf funnction)
      -Add 'RTC_ShowCalendar', 'SmartCard_Reader_Project' project.
            -Update CSC_Init.c file. 
    </release>
    <release version="3.3.0" date="2022-10-11">
      -Modify MG32x02z_CSC_Init.c/h file.
        -Update all driver and middleware files.
      -Add SPI group into ChipInit enviroment.
      -IRQ_Handler adds PendSV and SVC options.
      -Move MG32x02z__IRQHandler from ChipInit_Wizard to IRQ_Handler group.
      -Unconditionally enable IEA for SYS in MG32x02z_ChipInit.c .
      -Reduced sub-item for SYS, TM0x, URT123 and URT4x NVIC.
      -MG32x02z__IRQHandler.c includes driver-level IRQ routines for all peripherals.
      -Delete IRQ sample codes.
      -Delete MA862 MCU selection.
      -Updtae file name of URTx in sample code.
      -Update MG32x02z_GPIO_xxx_Init.h and MG32x02z_EXIC_xxx_Init.h file.
      -Update interrupt exception No. in 'IRQ_Handler' component.
      -Add MG32x02z_Ex.h for MCU definition.
    </release>
    <release version="3.2.2" date="2022-07-05">  
      -Middleware (Sample code) for Compiler V6
      -Modify TM00_IRQ sample code.
      -Modify I2Cx condition.
      -Modify EMB_IRQ, IWDT_IRQ, URT123_IRQ description.
      -Replace TH222x BSP code.
      -Modify IRQ_Handler description.
    </release>
    <release version="3.2.1" date="2022-05-30">  
      -Add some BSP routines of TH222x.
        - ARGB, DIP Switch, LEDx8, Step Motor, Variable Resistor, Rotary Encoder, RC Servo Motor, SPI Flash,
        - 4x4 Keyboard, 16x2 LCM, BLE
      -Add 'SPI Flash' project for MG32F02A032. MG32F02A128/U128 and MG32F02V032
      -Modify some example projects for Compiler V6.
      -Add 'Sample_I2C_withDMA.c' sample code.
      -Add 'Sample_I2C_ByteMode_Simple.c' sample code.
      -Modify MG32x02z_CSC_Init.c/h and MG32x02z_ChipInit.c file.
        -MG32x02z_CSC_Init.c (version="1.0.7" -> "1.0.8")
          -MG32x02z_CSC_Init.h (version="1.0.5" -> "1.0.5")
        -MG32x02z_ChipInit.c (version="1.0.6~7" -> "1.0.8")
    </release>
    <release version="3.2.0" date="2022-04-29">  
      -Add Board Support for TH222x and TH197x.
      -Add BLE support of Board Support. (for TH197x/TH217x/TH218x)
      -Arrange 'BSP' item for all board.
      -Add "USB_Mouse Project" project.
      -Rename folder name in BSP. (e.g. TH222A->TH222x)
    </release>
    <release version="3.1.1" date="2022-03-17">  
      - Delete SDT function/enum/control.
    </release>
    <release version="3.1.0" date="2022-03-07">  
      - Rename Device group name to 'MG32F0x series'.
      - Add Board Support option.
      - Modify 'USB keyboard project' board is MG04-05x.
      - Add MG32F02V032 example and Board.
      - Modify 'MG32x02z__IRQHandler.c' file for CodeGen.
      - Merge Board name for example selection.
      - Rename MG32x02z_GPIO_[Package]_Init.h.
    </release>
    <release version="3.0.0" date="2022-01-04">  
      - Add MG32F02V032 MCU.
      - Modify MG32x02z__IRQHandler.c - interrupt compiler option.
      - Add SysTick priority configuration.
      - Add Sample_ASB_Transmit, Sample_URT0_SPISlaveMode_TxRx sample code.
      - Add Sample_WakeupFromSTOPMode, Sample_WakeupFromSLEEPMode and Sample_Enter_STOP_SLEEP_Mode sample code.
    </release>
    <release version="2.1.1" date="2021-11-02">  
      - Modify MG32x02z__IRQHandler.c - interrupt compiler option.
      - Modify MG32x02z_CSC_Init.c - function error.
      - Decrease MG32F02A128,A062 USB IRQ.
    </release>
    <release version="2.1.0" date="2021-10-28">  
      - Modify PDSC - check by xmllint 
        -- Modify MG32x02z_GPIO_Init.h version from "LQFPxx", version="TSSOP20", version="QFN32" to version="1.0.0".
        -- Add IRQ priority config.
        -- Modify "MG32x02z_Device" to "Device". (Version="1.0.3" to Version="1.0.4")
        -- Modify "MG32x02z_ChipInit_Wizard" to "ChipInit_Wizard".
        -- Modify "MG32x02z_IEC60730_Support" to "IEC60730_Support".
        -- Modify "MG32x02z_IRQ_Handler" to "IRQ_Handler".
        -- Modify "MG32x02z_Driver" to "Driver".
        -- Modify "MG32x02z_Middleware" to "Middleware".
        -- Add "system_MG32x02z.h" in \INCLUDE path.
        -- Modify device, bundle, example.
        -- Add "require Cclass="CMSIS" Cgroup="CORE"".
        -- Hidden all "bundle". (less "Board Support" in "Manage Run-Time Enviroment")
        -- Remove Systick IRQ configuration.
        -- Remove "Sample_MISC_SysTickPrintfInitial.c" file.
        -- Remove "Sample_SysTick_Init.c" in Device components.
        -- Remove "Sample_Retarget.c" in Device components. (move to Driver componsents)
        -- Remove uCOS-II project.
      - Middlware-All with "ChipInit_Wizard's CSC' condition. (in Manage Run-Time Environment of keil)
      - "ChipInit_Wizard's ADC" with "Driver's Driver-All' condition.(in Manage Run-Time Environment of keil)
      - "ChipInit_Wizard's IRQHandler" with "Driver's Driver-All' or 'Middleware's Middleware-All' condition.(in Manage Run-Time Environment of keil)
      - Rename "Sample_MID_SYS.c" to "Sample_MID_SYS_GetChipID.c"
      - Add IEC60730_Project for MG32F02A128/U128.
      - Mofigy IEC60730_Project for MG32F02A132/072/MA862/032.
    </release>
  </releases>
  <keywords>
    <!-- keywords for indexing -->
    <keyword>Megawin</keyword>
    <keyword>CM0</keyword>
    <keyword>MG32</keyword>
  </keywords>
  <!-- devices section (mandatory for Device Family Packs) -->
  <!-- 
  Megawin -+
           + MG32x Series (MG32F02A132/072/032/A128/U128/A064/U064
  -->
  <devices>
    <family Dfamily="MG32F0x Series" Dvendor="Megawin:70">
      <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="48000000"/>
      <!-- <book name="Documentation/xxx.pdf" title="Cortex-M0 Generic User Guide"/> -->
      <description>
CPU Operation frequency up to 48MHz
Built-in one NVIC for 32 external interrupt inputs with 4-level priority
Built-in one 24-bit system tick timer
Built-in one single-cycle 32-bit multiplier
Built-in one SWD serial wire debugger with 2 watch points and 4 breakpoints
Flash / SRAM
Built-in one 1.8V output regulator for core power
Built-in two brown-out detectors
Support three power operation modes
ON(Normal) mode and SLEEP , STOP power down modes
Built-in embedded POR (power-on reset) circuit
Configurable cold reset or warm reset for reset source
Provide multiple reset source
POR, External Reset, BODx, IWDT, WWDT, ADC, ACMP, ...
      </description>
      <!-- ***********************  Device 'MG32F02Ax Series' *************************** -->
      <subFamily DsubFamily="MG32F02A Series">
      <!-- *************************  Device 'MG82F02A132'  ***************************** -->
      <device Dname="MG32F02A132">
        <!-- introduction -->
        <description>
The MG32x02z device family contains an ARM Cortex-M0 processor.

Features:
- CPU Core (48MHz/24-bit system tick/multiplier/SWD)
- Flash Memory (132K/ICP/ISP/IAP)
- SRAM Memory (16K)
- Power (POR/BOD0/BOD1/Reset)
- Clock (ILRCO/IHRCO 11.0592M, 12MHz/PLL/XTAL)
- DMA (M2M/M2P/P2M/P2P)
- GPIO 
- Timer (TM00/TM01/TM10/TM16/TM20/TM26/TM36)
- RTC
- Watchdog Timer
- I2C0, I2C1
- URT0~URT3
- SPI
- EMB (External Memory Bus)
- ADC (12bit SAR ADC with 400Ksps)
- Analog Comparator
- DAC (10bit DAC)
- GPL (Gerneral Purpose Logic)
        </description>
        <compile header="Device/MG32x02z/MG32F02A132/Include/MG32x02z.h" define="MG32F02A132"/>
        <debug svd="SVD/MG32F02A132/MG32x02z__SVD.svd"/>
        <memory id="IROM1" start="0x00000000" size="0x21000" startup="1" default="1"/>
        <memory id="IRAM1" start="0x20000000" size="0x3800" init="0" default="1"/>
        <memory id="IRAM2" start="0x20003800" size="0x800" init="0" default="0"/>
        <algorithm name="Flash/MG32F02A132_FLM.FLM" start="0x00000000" size="0x21000" default="1"/>
      </device>
      <!-- *************************  Device 'MG32F02A072'  ***************************** -->
      <device Dname="MG32F02A072">
        <!-- introduction -->
        <description>
The MG32x02z device family contains an ARM Cortex-M0 processor.

Features:
- CPU Core (48MHz/24-bit system tick/multiplier/SWD)
- Flash Memory (72K/ICP/ISP/IAP)
- SRAM Memory (8K)
- Power (POR/BOD0/BOD1/Reset)
- Clock (ILRCO/IHRCO 11.0592M, 12MHz/PLL/XTAL)
- DMA (M2M/M2P/P2M/P2P)
- GPIO 
- Timer (TM00/TM01/TM10/TM16/TM20/TM26/TM36)
- RTC
- Watchdog Timer
- I2C0, I2C1
- URT0~URT3
- SPI
- EMB (External Memory Bus)
- ADC (12bit SAR ADC with 400Ksps)
- Analog Comparator
- DAC (10bit DAC)
- GPL (Gerneral Purpose Logic)
        </description>
        <compile header="Device/MG32x02z/MG32F02A132/Include/MG32x02z.h" define="MG32F02A072"/>
        <debug svd="SVD/MG32F02A132/MG32x02z__SVD.svd"/>
        <memory id="IROM1" start="0x00000000" size="0x12000" startup="1" default="1"/>
        <memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1"/>
        <algorithm name="Flash/MG32F02A072_FLM.FLM" start="0x00000000" size="0x12000" default="1"/>
      </device>
      <!-- *************************  Device 'MG32F02A032'  ***************************** -->
      <device Dname="MG32F02A032">
        <!-- introduction -->
        <description>
The MG32x02z device family contains an ARM Cortex-M0 processor.

Features:
- CPU Core (48MHz/24-bit system tick/multiplier/SWD)
- Flash Memory (32k/ICP/ISP/IAP)
- SRAM Memory (4K)
- Power (POR/BOD0/BOD1/Reset)
- Clock (ILRCO/IHRCO 11.0592M, 12MHz/PLL/XTAL)
- DMA (M2M/M2P/P2M/P2P)
- GPIO 
- Timer (TM00/TM01/TM10/TM16/TM36)
- RTC
- Watchdog Timer
- I2C0
- URT0~URT1
- SPI
- ADC (12bit SAR ADC with 800Ksps)
- Analog Comparator
- GPL (Gerneral Purpose Logic)
        </description>
        <compile header="Device/MG32x02z/MG32F02A032/Include/MG32x02z.h" define="MG32F02A032"/>
        <debug svd="SVD/MG32F02A032/MG32x02z__SVD.svd"/>
        <memory id="IROM1" start="0x00000000" size="0x8000" startup="1" default="1"/>
        <memory id="IRAM1" start="0x20000000" size="0x1000" init="0" default="1"/>
        <algorithm name="Flash/MG32F02A032_FLM.FLM" start="0x00000000" size="0x8000" default="1"/>
      </device>
      <!-- *************************  Device 'MG32F02A128'  ***************************** -->
      <device Dname="MG32F02A128">
        <!-- introduction -->
        <description>
The MG32x02z device family contains an ARM Cortex-M0 processor.

Features:
- CPU Core (48MHz/24-bit system tick/multiplier/SWD)
- Flash Memory (128K/ICP/ISP/IAP)
- SRAM Memory (16K)
- Power (POR/BOD0/BOD1/BOD2/Reset)
- Clock (ILRCO/IHRCO 11.0592M, 12MHz/PLL/XTAL)
- DMA (M2M/M2P/P2M/P2P)
- GPIO 
- Timer (TM00/TM01/TM10/TM16/TM20/TM26/TM36)
- RTC
- Watchdog Timer
- I2C0, I2C1
- URT0~URT2, URT4~URT7
- SPI
- EMB (External Memory Bus)
- ADC (12bit SAR ADC with 1500Ksps)
- Analog Comparator
- DAC (10bit DAC)
- GPL (Gerneral Purpose Logic)
        </description>
        <compile header="Device/MG32x02z/MG32F02A128/Include/MG32x02z.h" define="MG32F02A128"/>
        <debug svd="SVD/MG32F02A128/MG32x02z__SVD.svd"/>
        <memory id="IROM1" start="0x00000000" size="0x20000" startup="1" default="1"/>
        <memory id="IRAM1" start="0x20000000" size="0x3800" init="0" default="1"/>
        <memory id="IRAM2" start="0x20003800" size="0x800" init="0" default="0"/>
        <algorithm name="Flash/MG32F02A128_FLM.FLM" start="0x00000000" size="0x20000" default="1"/>
      </device>
