XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
      <!-- *************************  Device 'MG32F02A064'  ***************************** -->
      <device Dname="MG32F02A064">
        <!-- introduction -->
        <description>
The MG32x02z device family contains an ARM Cortex-M0 processor.

Features:
- CPU Core (48MHz/24-bit system tick/multiplier/SWD)
- Flash Memory (64K/ICP/ISP/IAP)
- SRAM Memory (8K)
- Power (POR/BOD0/BOD1/BOD2/Reset)
- Clock (ILRCO/IHRCO 11.0592M, 12MHz/PLL/XTAL)
- DMA (M2M/M2P/P2M/P2P)
- GPIO 
- Timer (TM00/TM01/TM10/TM16/TM20/TM26/TM36)
- RTC
- Watchdog Timer
- I2C0, I2C1
- URT0~URT2, URT4~URT7
- SPI
- EMB (External Memory Bus)
- ADC (12bit SAR ADC with 1500Ksps)
- Analog Comparator
- DAC (10bit DAC)
- GPL (Gerneral Purpose Logic)
        </description>
        <compile header="Device/MG32x02z/MG32F02A128/Include/MG32x02z.h" define="MG32F02A064"/>
        <debug svd="SVD/MG32F02A128/MG32x02z__SVD.svd"/>
        <memory id="IROM1" start="0x00000000" size="0x10000" startup="1" default="1"/>
        <memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1"/>
        <algorithm name="Flash/MG32F02A064_FLM.FLM" start="0x00000000" size="0x10000" default="1"/>
      </device>
      </subFamily>
      
      <!-- ***********************  Device 'MG32F02Ux Series' *************************** -->
      <subFamily DsubFamily="MG32F02U Series">
      
      <!-- *************************  Device 'MG32F02U128'  ***************************** -->
      <device Dname="MG32F02U128">
        <!-- introduction -->
        <description>
The MG32x02z device family contains an ARM Cortex-M0 processor.

Features:
- CPU Core (48MHz/24-bit system tick/multiplier/SWD)
- Flash Memory (128K/ICP/ISP/IAP)
- SRAM Memory (16K)
- Power (POR/BOD0/BOD1/BOD2/Reset)
- Clock (ILRCO/IHRCO 11.0592M, 12MHz/PLL/XTAL)
- DMA (M2M/M2P/P2M/P2P)
- GPIO 
- Timer (TM00/TM01/TM10/TM16/TM20/TM26/TM36)
- RTC
- Watchdog Timer
- I2C0, I2C1
- URT0~URT2, URT4~URT7
- SPI
- EMB (External Memory Bus)
- ADC (12bit SAR ADC with 1500Ksps)
- Analog Comparator
- DAC (10bit DAC)
- GPL (Gerneral Purpose Logic)
- USB
        </description>
        <compile header="Device/MG32x02z/MG32F02A128/Include/MG32x02z.h" define="MG32F02U128"/>
        <debug svd="SVD/MG32F02A128/MG32x02z__SVD.svd"/>
        <memory id="IROM1" start="0x00000000" size="0x20000" startup="1" default="1"/>
        <memory id="IRAM1" start="0x20000000" size="0x3800" init="0" default="1"/>
        <memory id="IRAM2" start="0x20003800" size="0x800" init="0" default="0"/>
        <algorithm name="Flash/MG32F02U128_FLM.FLM" start="0x00000000" size="0x20000" default="1"/>
      </device>
      <!-- *************************  Device 'MG32F02U064'  ***************************** -->
      <device Dname="MG32F02U064">
        <!-- introduction -->
        <description>
The MG32x02z device family contains an ARM Cortex-M0 processor.

Features:
- CPU Core (48MHz/24-bit system tick/multiplier/SWD)
- Flash Memory (64K/ICP/ISP/IAP)
- SRAM Memory (16K)
- Power (POR/BOD0/BOD1/BOD2/Reset)
- Clock (ILRCO/IHRCO 11.0592M, 12MHz/PLL/XTAL)
- DMA (M2M/M2P/P2M/P2P)
- GPIO 
- Timer (TM00/TM01/TM10/TM16/TM20/TM26/TM36)
- RTC
- Watchdog Timer
- I2C0, I2C1
- URT0~URT2, URT4~URT7
- SPI
- EMB (External Memory Bus)
- ADC (12bit SAR ADC with 1500Ksps)
- Analog Comparator
- DAC (10bit DAC)
- GPL (Gerneral Purpose Logic)
- USB
        </description>
        <compile header="Device/MG32x02z/MG32F02A128/Include/MG32x02z.h" define="MG32F02U064"/>
        <debug svd="SVD/MG32F02A128/MG32x02z__SVD.svd"/>
        <memory id="IROM1" start="0x00000000" size="0x10000" startup="1" default="1"/>
        <memory id="IRAM1" start="0x20000000" size="0x3800" init="0" default="1"/>
        <memory id="IRAM2" start="0x20003800" size="0x800" init="0" default="0"/>
        <algorithm name="Flash/MG32F02U064_FLM.FLM" start="0x00000000" size="0x10000" default="1"/>
      </device>
      </subFamily>
      
      <!-- ***********************  Device 'MG32F02Vx Series' *************************** -->
      <subFamily DsubFamily="MG32F02V Series">
      
      <!-- *************************  Device 'MG32F02V032'  ***************************** -->
      <device Dname="MG32F02V032">
        <!-- introduction -->
        <description>
The MG32x02z device family contains an ARM Cortex-M0 processor.

Features:
- CPU Core (48MHz/24-bit system tick/multiplier/SWD)
- Flash Memory (32K/ICP/ISP/IAP)
- SRAM Memory (4K)
- DMA (M2M/M2P/P2M/P2P) - 4channels
- GPIO 
- Timer (TM00/TM01/TM10/TM16/TM20/TM36)
- RTC
- Watchdog Timer
- I2C0, I2C1
- URT0/URT1/URT4
- SPI
- EMB (External Memory Bus)
- ADC (12bit SAR ADC with 1000Ksps)
- GPL (Gerneral Purpose Logic)
        </description>
          <compile    header="Device/MG32x02z/MG32F02V032/Include/MG32x02z.h" define="MG32F02V032"/>
          <debug      svd="SVD/MG32F02V032/MG32x02z__SVD.svd"/> 
          <memory     id="IROM1"    start="0x00000000"  size="0x8000"   startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1000"   init="0"      default="1"/>
          <algorithm  name="Flash/MG32F02V032_FLM.FLM" start="0x00000000"  size="0x8000"                  default="1"/>
          <!-- <variant Dvariant="MG32F02V032">
          </variant> -->
      </device>
      </subFamily>
      
    </family>
  </devices>
  <!-- **************************************************************************************** -->
  <!-- conditions section (optional for all Software Packs)-->
  <!-- conditions selecting Devices -->
  <conditions>
    <!-- ************************************************************************** -->
    <!-- <condition id="MG32x CMSIS-CORE">
      <description>Megawin MG322x02z devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Megawin:70" Dname="MG32*"/>
    </condition>  -->
    <condition id="MG32x Series">
      <description>Megawin MG322x02z Series devices</description>
      <require Dvendor="Megawin:70" Dname="MG32F02*"/>
    </condition>
    <!-- Compiler Conditions -->
    <!-- <condition id="Compiler ARMCC">
      <description>Compiler file for ARMCC</description>
      <require Tcompiler="ARMCC" />
    </condition> -->
    <!-- ************************************************************************** -->
    <!-- Device Conditions -->
    <!-- Device + CMSIS Conditions -->
    <!-- ********** "DNAME_132 CMSIS" ********** -->
    <condition id="DNAME_132 CMSIS">
      <description>megawin MG32F02A132 Series Device and CMSIS-Core</description>
      <!-- <require condition="DNAME_132"/> -->
      <!-- <require condition="MG32x Series"/> -->
      <require Dname="MG32F02A132"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <!-- ********** "DNAME_072 CMSIS" ********** -->
    <condition id="DNAME_072 CMSIS">
      <description>megawin MG32F02A072 Series Device and CMSIS-Core</description>
      <!-- <require condition="DNAME_132"/> -->
      <!-- <require condition="MG32x Series"/> -->
      <require Dname="MG32F02A072"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <!-- ********** "DNAME_032 CMSIS" ********** -->
    <condition id="DNAME_032 CMSIS">
      <description>megawin MG32F02A032 Series Device and CMSIS-Core</description>
      <!-- <require condition="DNAME_032"/> -->
      <!-- <require condition="MG32x Series"/> -->
      <require Dname="MG32F02A032"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <!-- ********** "DNAME_A128 CMSIS" ********** -->
    <condition id="DNAME_A128 CMSIS">
      <description>megawin MG32F02A128 Series Device and CMSIS-Core</description>
      <require Dname="MG32F02A128"/>
      <!-- <require condition="MG32x Series"/> -->
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <!-- ********** "DNAME_U128 CMSIS" ********** -->
    <condition id="DNAME_U128 CMSIS">
      <description>megawin MG32F02U128 Series Device and CMSIS-Core</description>
      <!-- <require condition="DNAME_U128"/> -->
      <require Dname="MG32F02U128"/>
      <!-- <require condition="MG32x Series"/> -->
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <!-- ********** "DNAME_A064 CMSIS" ********** -->
    <condition id="DNAME_A064 CMSIS">
      <description>megawin MG32F02A064 Series Device and CMSIS-Core</description>
      <!-- <require condition="DNAME_A064"/> -->
      <!-- <require condition="MG32x Series"/> -->
      <require Dname="MG32F02A064"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <!-- ********** "DNAME_U064 CMSIS" ********** -->
    <condition id="DNAME_U064 CMSIS">
      <description>megawin MG32F02U064 Series Device and CMSIS-Core</description>
      <!-- <require condition="DNAME_U064"/> -->
      <!-- <require condition="MG32x Series"/> -->
      <require Dname="MG32F02U064"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <!-- ********** "DNAME_V032 CMSIS" ********** -->
    <condition id="DNAME_V032 CMSIS">
      <description>megawin MG32F02V032 Series Device and CMSIS-Core</description>
      <!-- <accept Dname="MG32F02V032"/> -->
      <accept Dname="MG32F02V032"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <!-- ************************************************************************** -->
    <!-- ARMCC Compiler -->
    <condition id="ARMCC">
      <require condition="MG32x Series"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <!-- ************************************************************************** -->
    <!-- GCC Compiler -->
    <condition id="GCC">
      <require condition="MG32x Series"/>
      <require Tcompiler="GCC"/>
    </condition>
    <!-- ************************************************************************** -->
    <!-- Startup.S + GCC + Disable IEC60730 -->
    <condition id="Startup IEC60730=0 GCC">
      <require condition="MG32x Series"/>
      <require Tcompiler="GCC"/>
      <deny Cclass="IEC60730_Support" Cgroup="Run after Reset"/>
    </condition>
    <!-- Startup.S + GCC + Enable IEC60730 -->
    <condition id="Startup IEC60730=1 GCC">
      <require condition="MG32x Series"/>
      <require Tcompiler="GCC"/>
      <require Cclass="IEC60730_Support" Cgroup="Run after Reset"/>
    </condition>
    <!-- ************************************************************************** -->
    <!-- system_ + (ARMCC or GCC) Compiler Conditions -->
    <condition id="SYSTEM_TCOM">
      <description>Any megawin Devices and ARMCC or GCC Compiler</description>
      <require condition="MG32x Series"/>
      <accept Tcompiler="GCC"/>
      <accept Tcompiler="ARMCC"/>
    </condition>
    <!-- ******************************************************************* -->
    <!-- CSC with MCU name condition -->
    <condition id="CSC_INIT_MG32F02A132">
      <description>CSC_INIT_MG32F02A132</description>
      <accept Dname="MG32F02A132"/>
    </condition>
    <condition id="CSC_INIT_MG32F02A072">
      <description>CSC_INIT_MG32F02A072</description>
      <accept Dname="MG32F02A072"/>
    </condition>
    <condition id="CSC_INIT_MG32F02A032">
      <description>CSC_INIT_MG32F02A032</description>
      <accept Dname="MG32F02A032"/>
    </condition>
    <condition id="CSC_INIT_MG32F02A128">
      <description>CSC_INIT_MG32F02A128</description>
      <accept Dname="MG32F02A128"/>
    </condition>
    <condition id="CSC_INIT_MG32F02U128">
      <description>CSC_INIT_MG32F02U128</description>
      <accept Dname="MG32F02U128"/>
    </condition>
    <condition id="CSC_INIT_MG32F02A064">
      <description>CSC_INIT_MG32F02A064</description>
      <accept Dname="MG32F02A064"/>
    </condition>
