XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
    <condition id="CSC_INIT_MG32F02U064">
      <description>CSC_INIT_MG32F02U064</description>
      <accept Dname="MG32F02U064"/>
    </condition>
    <condition id="CSC_INIT_MG32F02V032">
      <description>CSC_INIT_MG32F02V032</description>
      <!-- <accept Dname="MG32F02V032"/> -->
      <accept Dname="MG32F02V032"/>
    </condition>
    <!-- ******************************************************************* -->
    <!-- (All) Driver condition define -->
    <!-- Driver : MG32F02A132, MG32F02A072 -->
    <condition id="DNAME_DRIVER_132072">
      <description>Compiler file for ARMCC</description>
      <accept Dname="MG32F02A072"/>
      <accept Dname="MG32F02A132"/>
    </condition>
    <!-- Driver : MG32F02A032 -->
    <condition id="DNAME_DRIVER_032">
      <description>Compiler file for ARMCC</description>
      <accept Dname="MG32F02A032"/>
    </condition>
    <!-- Driver : MG32F02A128, MG32F02U128, MG32F02A064, MG32F02U064 -->
    <condition id="DNAME_DRIVER_128">
      <description>Compiler file for ARMCC</description>
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02A064"/>
      <accept Dname="MG32F02U064"/>
    </condition>
    <!-- Driver : MG32F02V032 -->
    <condition id="DNAME_DRIVER_V032">
      <description>Compiler file for ARMCC</description>
      <accept Dname="MG32F02V032"/>
    </condition>
    <!-- ******************************************************************* -->
    <!-- (All) Middleware condition define -->
    <!-- Middleware : MG32F02A132, MG32F02A072 -->
    <condition id="DNAME_Middleware_132072">
      <description>Compiler file for ARMCC</description>
      <accept Dname="MG32F02A072"/>
      <accept Dname="MG32F02A132"/>
      <accept Cclass="ChipInit_Wizard" Cgroup="CSC"/>
    </condition>
    <!-- Middleware : MG32F02A032 -->
    <condition id="DNAME_Middleware_032">
      <description>Compiler file for ARMCC</description>
      <accept Dname="MG32F02A032"/>
      <accept Cclass="ChipInit_Wizard" Cgroup="CSC"/>
    </condition>
    <!-- Middleware : MG32F02A128, MG32F02U128, MG32F02A064, MG32F02U064 -->
    <condition id="DNAME_Middleware_128">
      <description>Compiler file for ARMCC</description>
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02A064"/>
      <accept Dname="MG32F02U064"/>
      <accept Cclass="ChipInit_Wizard" Cgroup="CSC"/>
    </condition>
    <!-- Middleware : MG32F02V032 -->
    <condition id="DNAME_Middleware_V032">
      <description>Compiler file for ARMCC</description>
      <accept Dname="MG32F02V032"/>
      <accept Cclass="ChipInit_Wizard" Cgroup="CSC"/>
    </condition>
    <!-- ************************************************************************ -->
    <!-- ********************************************************************************** -->
    <!-- Chip initial configuration wizard -->
    <condition id="MG32x02z_MCU">
      <!-- defines the condition with the ID "Cortex-M" -->
      <description>True if the active device has a MG32F02Axxx processor </description>
      <accept Dname="MG32F02A132"/>
      <accept Dname="MG32F02A072"/>
      <accept Dname="MG32F02A032"/>
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02A064"/>
      <accept Dname="MG32F02U064"/>
      <accept Dname="MG32F02V032"/>
    </condition>
    <!-- ********************************************************************************** -->
    <!-- EMB : MG32F02A132, MG32F02A072 -->
    <condition id="ChipInit_132_EMB">
      <description>Condition for EMB</description>
      <accept Dname="MG32F02A072"/>
      <accept Dname="MG32F02A132"/>
    </condition>
    <!-- EMB : MG32F02A128, MG32F02U128, MG32F02A064, MG32F02U064 -->
    <condition id="ChipInit_128_EMB">
      <description>Condition for EMB</description>
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02A064"/>
      <accept Dname="MG32F02U064"/>
    </condition>
    <!-- ********************************************************************************** -->
    <!-- ChipInit of EXIC Wizard -->
    <condition id="ChipInit_132_EXIC">
      <description>Condition for EXIC</description>
      <accept Dname="MG32F02A132"/>
    </condition>
    <condition id="ChipInit_072_EXIC">
      <description>Condition for EXIC</description>
      <accept Dname="MG32F02A072"/>
    </condition>
    <condition id="ChipInit_032_EXIC">
      <description>Condition for EXIC</description>
      <!-- <require condition="DNAME_032"/> -->
      <accept Dname="MG32F02A032"/>
    </condition>
    <condition id="ChipInit_A128_EXIC">
      <description>Condition for EXIC</description>
      <accept Dname="MG32F02A128"/>
    </condition>
    <condition id="ChipInit_U128_EXIC">
      <description>Condition for EXIC</description>
      <accept Dname="MG32F02U128"/>
    </condition>
    <condition id="ChipInit_A064_EXIC">
      <description>Condition for EXIC</description>
      <accept Dname="MG32F02A064"/>
    </condition>
    <condition id="ChipInit_U064_EXIC">
      <description>Condition for EXIC</description>
      <accept Dname="MG32F02U064"/>
    </condition>
      <condition id="ChipInit_V032_EXIC">
      <description>Condition for EXIC</description>
      <accept Dname="MG32F02V032"/>
    </condition>
    <!-- ********************************************************************************** -->
    <!-- ChipInit of GPIO Wizard -->
    <condition id="ChipInit_132_GPIO">
      <description>Condition for GPIO</description>
      <accept Dname="MG32F02A132"/>
    </condition>
    <condition id="ChipInit_072_GPIO">
      <description>Condition for GPIO</description>
      <accept Dname="MG32F02A072"/>
    </condition>
    <condition id="ChipInit_032_GPIO">
      <description>Condition for GPIO</description>
      <accept Dname="MG32F02A032"/>
    </condition>
    <condition id="ChipInit_A128_GPIO">
      <description>Condition for GPIO</description>
      <accept Dname="MG32F02A128"/>
    </condition>
