XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
    <condition id="ChipInit_U128_GPIO">
      <description>Condition for GPIO</description>
      <accept Dname="MG32F02U128"/>
    </condition>
    <condition id="ChipInit_A064_GPIO">
      <description>Condition for GPIO</description>
      <accept Dname="MG32F02A064"/>
    </condition>
    <condition id="ChipInit_U064_GPIO">
      <description>Condition for GPIO</description>
      <accept Dname="MG32F02U064"/>
    </condition>
    <condition id="ChipInit_V032_GPIO">
      <description>Condition for GPIO</description>
      <accept Dname="MG32F02V032"/>
    </condition>
    <!-- ********************************************************************************** -->
    <!-- ChipInit of GPL Wizard -->
    <condition id="ChipInit_132_GPL">
      <description>Condition for GPL</description>
      <accept Dname="MG32F02A072"/>
      <accept Dname="MG32F02A132"/>
    </condition>
    <condition id="ChipInit_032_GPL">
      <description>Condition for GPL</description>
      <accept Dname="MG32F02A032"/>
    </condition>
    <condition id="ChipInit_128_GPL">
      <description>Condition for GPL</description>
      <!-- <require condition="DNAME_128"/> -->
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02A064"/>
      <accept Dname="MG32F02U064"/>
    </condition>
    <condition id="ChipInit_V032_GPL">
      <description>Condition for GPL</description>
      <accept Dname="MG32F02V032"/>
    </condition>
    <!-- ********************************************************************************** -->
    <!-- ChipInit of MEM Wizard -->
    <condition id="ChipInit_132_MEM">
      <description>Condition for MEM</description>
      <accept Dname="MG32F02A072"/>
      <accept Dname="MG32F02A132"/>
      <require Cclass="Driver" Cgroup="Driver-All"/>
    </condition>
    <condition id="ChipInit_032_MEM">
      <description>Condition for MEM</description>
      <accept Dname="MG32F02A032"/>
      <require Cclass="Driver" Cgroup="Driver-All"/>
    </condition>
    <condition id="ChipInit_128_MEM">
      <description>Condition for MEM</description>
      <!-- <require condition="DNAME_128"/> -->
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02A064"/>
      <accept Dname="MG32F02U064"/>
      <require Cclass="Driver" Cgroup="Driver-All"/>
    </condition>
    <condition id="ChipInit_V032_MEM">
      <description>Condition for MEM</description>
      <accept Dname="MG32F02V032"/>
      <require Cclass="Driver" Cgroup="Driver-All"/>
    </condition>
    <!-- ********************************************************************************** -->
    <!-- ChipInit of PW Wizard -->
    <condition id="ChipInit_ALLMCU_PW">
      <description>Condition for PW</description>
      <accept Dname="MG32F02A072"/>
      <accept Dname="MG32F02A132"/>
      <accept Dname="MG32F02A032"/>
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02A064"/>
      <accept Dname="MG32F02U064"/>
      <accept Dname="MG32F02V032"/>
    </condition>
    <!-- ********************************************************************************** -->
    <!-- ChipInit of RST Wizard -->
    <condition id="ChipInit_ALLMCU_RST">
      <description>Condition for RST</description>
      <accept Dname="MG32F02A072"/>
      <accept Dname="MG32F02A132"/>
      <accept Dname="MG32F02A032"/>
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02A064"/>
      <accept Dname="MG32F02U064"/>
      <accept Dname="MG32F02V032"/>
    </condition>
    <!-- ********************************************************************************** -->
    <!-- ChipInit of URT Wizard -->
    <condition id="ChipInit_132_URT">
      <description>Condition for URT</description>
      <accept Dname="MG32F02A072"/>
      <accept Dname="MG32F02A132"/>
      <require Cclass="ChipInit_Wizard" Cgroup="CSC"/>
    </condition>
    <condition id="ChipInit_032_URT">
      <description>Condition for URT</description>
      <accept Dname="MG32F02A032"/>
      <require Cclass="ChipInit_Wizard" Cgroup="CSC"/>
    </condition>
    <condition id="ChipInit_128_URT">
      <description>Condition for URT</description>
      <!-- <require condition="DNAME_128"/> -->
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02A064"/>
      <accept Dname="MG32F02U064"/>
      <require Cclass="ChipInit_Wizard" Cgroup="CSC"/>
    </condition>
    <condition id="ChipInit_V032_URT">
      <description>Condition for URT</description>
      <accept Dname="MG32F02V032"/>
      <require Cclass="ChipInit_Wizard" Cgroup="CSC"/>
    </condition>
    <!-- ********************************************************************************** -->
    <!-- ChipInit of TM Wizard (20210830 11:09) -->
    <condition id="ChipInit_132_TM">
      <description>Condition for TM</description>
      <accept Dname="MG32F02A072"/>
      <accept Dname="MG32F02A132"/>
    </condition>
    <condition id="ChipInit_032_TM">
      <description>Condition for TM</description>
      <accept Dname="MG32F02A032"/>
    </condition>
    <condition id="ChipInit_128_TM">
      <description>Condition for TM</description>
      <!-- <require condition="DNAME_128"/> -->
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02A064"/>
      <accept Dname="MG32F02U064"/>
    </condition>
    <condition id="ChipInit_V032_TM">
      <description>Condition for TM</description>
      <accept Dname="MG32F02V032"/>
    </condition>
    <!-- ********************************************************************************** -->
    <!-- ChipInit of ADC Wizard (20210830 11:00) -->
    <condition id="ChipInit_132_ADC">
      <description>Condition for ADC</description>
      <accept Dname="MG32F02A072"/>
      <accept Dname="MG32F02A132"/>
      <require Cclass="Driver" Cgroup="Driver-All"/>
    </condition>
    <condition id="ChipInit_032_ADC">
      <description>Condition for ADC</description>
      <accept Dname="MG32F02A032"/>
      <require Cclass="Driver" Cgroup="Driver-All"/>
    </condition>
    <condition id="ChipInit_128_ADC">
      <description>Condition for ADC</description>
      <!-- <require condition="DNAME_128"/> -->
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02A064"/>
      <accept Dname="MG32F02U064"/>
      <require Cclass="Driver" Cgroup="Driver-All"/>
    </condition>
    <condition id="ChipInit_V032_ADC">
      <description>Condition for ADC</description>
      <accept Dname="MG32F02V032"/>
      <require Cclass="Driver" Cgroup="Driver-All"/>
    </condition>
    <!-- ********************************************************************************** -->
    <!-- DAC : MG32F02A132, MG32F02A072 -->
    <condition id="ChipInit_132_DAC">
      <description>Condition for DAC </description>
      <accept Dname="MG32F02A132"/>
      <accept Dname="MG32F02A072"/>
    </condition>
