XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
    <!-- DAC : MG32F02A128, U128, A064, U064 -->
    <condition id="ChipInit_128_DAC">
      <description>Condition for DAC </description>
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02A064"/>
      <accept Dname="MG32F02U064"/>
    </condition>
    <!-- ********************************************************************************** -->
    <!-- CMP : MG32F02A132, MG32F02A072 -->
    <condition id="ChipInit_132_CMP">
      <description>Condition for CMP </description>
      <accept Dname="MG32F02A132"/>
      <accept Dname="MG32F02A072"/>
    </condition>
    <!-- CMP : MG32F02A032 -->
    <condition id="ChipInit_032_CMP">
      <description>Condition for CMP </description>
      <accept Dname="MG32F02A032"/>
    </condition>
    <!-- CMP : MG32F02A128, U128, A064, U064 -->
    <condition id="ChipInit_128_CMP">
      <description>Condition for CMP </description>
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02A064"/>
      <accept Dname="MG32F02U064"/>
    </condition>
    <!-- ********************************************************************************** -->
    <!-- APB : MG32F02A132, MG32F02A072 -->
    <condition id="ChipInit_132_APB">
      <description>Condition for APB </description>
      <accept Dname="MG32F02A132"/>
      <accept Dname="MG32F02A072"/>
    </condition>
    <!-- APB : MG32F02A032 -->
    <condition id="ChipInit_032_APB">
      <description>Condition for APB </description>
      <accept Dname="MG32F02A032"/>
    </condition>
    <!-- APB : MG32F02A128, U128, A064, U064 -->
    <condition id="ChipInit_128_APB">
      <description>Condition for APB </description>
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02A064"/>
      <accept Dname="MG32F02U064"/>
    </condition>
    <!-- APB : MG32F02V032 -->
    <condition id="ChipInit_V032_APB">
      <description>Condition for APB </description>
      <accept Dname="MG32F02V032"/>
    </condition>
    <!-- ********************************************************************************** -->
    <!-- APX : MG32F02A128, U128, A064, U064 -->
    <condition id="ChipInit_128_APX_CCL">
      <description>Condition for APX CCL </description>
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02A064"/>
      <accept Dname="MG32F02U064"/>
    </condition>
    <condition id="ChipInit_V032_APX_CCL">
      <description>Condition for APX CCL </description>
      <accept Dname="MG32F02V032"/>
    </condition>
    <!-- ********************************************************************************** -->
    <!-- RTC : MG32F02A132, MG32F02A072 -->
    <!-- ********************************************************************************** -->
    <!-- I2C : MG32F02A132, MG32F02A072 -->
    <condition id="ChipInit_132_I2C">
      <description>Condition for I2C </description>
      <accept Dname="MG32F02A132"/>
      <accept Dname="MG32F02A072"/>
    </condition>
    <!-- I2C : MG32F02A032 -->
    <condition id="ChipInit_032_I2C">
      <description>Condition for I2C </description>
      <accept Dname="MG32F02A032"/>
    </condition>
    <!-- I2C : MG32F02A128, U128, A064, U064 -->
    <condition id="ChipInit_128_I2C">
      <description>Condition for I2C </description>
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02A064"/>
      <accept Dname="MG32F02U064"/>
    </condition>
    <!-- I2C : MG32F02V032 -->
    <condition id="ChipInit_V032_I2C">
      <description>Condition for I2C </description>
      <accept Dname="MG32F02V032"/>
    </condition>
   <!-- ********************************************************************************** -->
    <!-- IEC60730 dep config -->
    <condition id="IEC60730_132">
      <description>Condition for IEC60730</description>
      <accept Dname="MG32F02A072"/>
      <accept Dname="MG32F02A132"/>
      <require Cclass="Driver" Cgroup="Driver-All"/>
      <!-- <require Tcompiler="ARMCC"/> (2022.11.09 09:55 Modify for IEC60730 in GCC state)-->    
    </condition>
    <condition id="IEC60730_032">
      <description>Condition for IEC60730</description>
      <accept Dname="MG32F02A032"/>
      <require Cclass="Driver" Cgroup="Driver-All"/>
      <!-- <require Tcompiler="ARMCC"/> (2022.11.09 09:55 Modify for IEC60730 in GCC state)-->    
    </condition>
    <condition id="IEC60730_128">
      <description>Condition for IEC60730</description>
      <!-- <require condition="DNAME_128"/> -->
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02A064"/>
      <accept Dname="MG32F02U064"/>
      <require Cclass="Driver" Cgroup="Driver-All"/>
      <!-- <require Tcompiler="ARMCC"/> (2022.11.09 09:55 Modify for IEC60730 in GCC state)-->    
    </condition>
    <condition id="IEC60730_V032">
      <description>Condition for IEC60730</description>
      <accept Dname="MG32F02V032"/>
      <require Cclass="Driver" Cgroup="Driver-All"/>
      <!-- <require Tcompiler="ARMCC"/> (2022.11.09 09:55 Modify for IEC60730 in GCC state)-->    
    </condition>
    <!-- ********************************************************************************** -->
    <!-- SYS_IRQ Request condition -->
    <condition id="SYS_IRQ_MG32_ALL">
      <description>SYS IRQ for MG32 ALL MCU</description>
      <accept Dname="MG32F02A132"/>
      <accept Dname="MG32F02A072"/>
      <accept Dname="MG32F02A032"/>
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02A064"/>
      <accept Dname="MG32F02U064"/>
      <accept Dname="MG32F02V032"/>
    </condition>
    <!-- ********************************************************************************** -->
    <!-- TM20_IRQ Request condition (TM20) -->
    <condition id="TM20_IRQ_MG32_1ST_3RD_4TH">
      <description>TM20 IRQ for MG32_1ST,3RD,4TH</description>
      <accept Dname="MG32F02A132"/>
      <accept Dname="MG32F02A072"/>
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02A064"/>
      <accept Dname="MG32F02U064"/>
      <accept Dname="MG32F02V032"/>
    </condition>
    <!-- ********************************************************************************** -->
    <!-- URT123_IRQ Request condition (URT123) -->
    <!-- URT1 -->
    <condition id="URT123_IRQ_MG32_ALL">
      <description>URT123 IRQ for MG32 ALL MCU</description>
      <accept Dname="MG32F02A132"/>
      <accept Dname="MG32F02A072"/>
      <accept Dname="MG32F02A032"/>
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02A064"/>
      <accept Dname="MG32F02U064"/>
      <accept Dname="MG32F02V032"/>
    </condition>
    <!-- ********************************************************************************** -->
    <!-- COMP_IRQ Request condition (COMP) -->
    <condition id="COMP_IRQ_MG32_1ST_2ND_3RD">
      <description>COMP IRQ for MG32_1ST,2ND,3RD</description>
      <accept Dname="MG32F02A132"/>
      <accept Dname="MG32F02A072"/>
      <accept Dname="MG32F02A032"/>
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02A064"/>
      <accept Dname="MG32F02U064"/>
    </condition>
    <!-- ********************************************************************************** -->
    <!-- TM2x_IRQ Request condition (TM26) -->
    <condition id="TM2x_IRQ_MG32_1ST_3RD">
      <description>TM2x IRQ for MG32_1ST, 3RD</description>
      <accept Dname="MG32F02A132"/>
      <accept Dname="MG32F02A072"/>
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02A064"/>
      <accept Dname="MG32F02U064"/>
    </condition>
    <!-- ********************************************************************************** -->
    <!-- DAC_IRQ Request condition (DAC) -->
    <condition id="DAC_IRQ_MG32_1ST_3RD">
      <description>DAC IRQ for MG32_1ST, 3RD</description>
      <accept Dname="MG32F02A132"/>
      <accept Dname="MG32F02A072"/>
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02A064"/>
      <accept Dname="MG32F02U064"/>
    </condition>
    <!-- ********************************************************************************** -->
    <!-- URT4x_IRQ Request condition (URT4x) -->
    <condition id="URT4x_IRQ_MG32_3RD_4TH">
      <description>URT4X IRQ for MG32_3RD, 4TH</description>
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02A064"/>
      <accept Dname="MG32F02U064"/>
      <accept Dname="MG32F02V032"/>
    </condition>
    <!-- ********************************************************************************** -->
    <!-- APX_IRQ Request condition -->
    <condition id="APX_IRQ_MG32_3RD_4TH">
      <description>APX IRQ for MG32F02A128,U128,A064,U064, V032</description>
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02A064"/>
      <accept Dname="MG32F02U064"/>
      <accept Dname="MG32F02V032"/>
    </condition>
    <!-- ********************************************************************************** -->
    <!-- I2Cx_IRQ Request condition (MG32_1ST,3RD,4TH) -->
    <condition id="I2Cx_IRQ_MG32_1ST_3RD_4TH">
      <description>I2Cx IRQ for MG32_1ST,3RD,4TH</description>
      <accept Dname="MG32F02A132"/>
      <accept Dname="MG32F02A072"/>
      <!-- <accept Dname="MG32F02A032"/> -->
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02A064"/>
      <accept Dname="MG32F02U064"/>
      <accept Dname="MG32F02V032"/>
    </condition>
    <!-- ********************************************************************************** -->
    <!-- USB_IRQ Request condition -->
    <condition id="USB_IRQ_MG32_3RD_Uxxx">
      <description>USB IRQ for MG32F02U128,U064</description>
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02U064"/>
    </condition>
    <!-- ******************************************************************************************* -->
    <!-- ********************************************************************************** -->
    <!-- Board Support - TH186A Board - for MG32F02A132 -->
    <condition id="BSP_TH186A_A132">
      <description>Board Support - TH186A Board - for MG32F02A132</description>
      <require Cclass="Driver" Cgroup="Driver-All"/>
      <!-- <require Cclass="ChipInit_Wizard" Cgroup="GPIO"/> -->
      <accept Dname="MG32F02A132"/>
      <accept Dname="MG32F02A072"/>
    </condition>
    <!-- ********************************************************************************** -->
    <condition id="BSP_TH197B_A032">
      <description>Board Support - TH218A Board - for MG32F02A032</description>
      <require Cclass="Driver" Cgroup="Driver-All"/>
      <!-- <require Cclass="ChipInit_Wizard" Cgroup="GPIO"/> -->
      <accept Dname="MG32F02A032"/>
    </condition>
    <!-- ********************************************************************************** -->
    <condition id="BSP_TH218A_A128">
      <description>Board Support - TH218A Board - for MG32F02A128</description>
      <require Cclass="Driver" Cgroup="Driver-All"/>
      <!-- <require Cclass="ChipInit_Wizard" Cgroup="GPIO"/> -->
      <accept Dname="MG32F02A128"/>
      <accept Dname="MG32F02A064"/>
    </condition>
    <!-- ********************************************************************************** -->
    <condition id="BSP_TH217A_U128">
      <description>Board Support - TH217A Board - for MG32F02U128</description>
      <require Cclass="Driver" Cgroup="Driver-All"/>
      <!-- <require Cclass="ChipInit_Wizard" Cgroup="GPIO"/> -->
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02U064"/>
    </condition>    
    <!-- ********************************************************************************** -->
    <condition id="BSP_TH222A_U128">
      <description>Board Support - TH222A Board - for MG32F02A128/U128/A064/U064</description>
      <require Cclass="Driver" Cgroup="Driver-All"/>
      <!-- <require Cclass="ChipInit_Wizard" Cgroup="GPIO"/> -->
      <accept Dname="MG32F02U128"/>
      <accept Dname="MG32F02U064"/>
    </condition>    
    <!-- ********************************************************************************** -->
    <condition id="BSP_MG04_06">
      <description>Board Support - MG04-06 - for MG32F02V032</description>
      <require Cclass="Driver" Cgroup="Driver-All"/>
      <require Cclass="Middleware" Cgroup="Middleware-All"/>
      <!-- <require Cclass="ChipInit_Wizard" Cgroup="GPIO"/> -->
      <accept Dname="MG32F02V032"/>
    </condition>    
    <!-- ********************************************************************************** -->
    <condition id="BSP_MG04_06_REQ1">
      <description>Board Support - MG04-06 - for MG32F02V032</description>
      <require Cclass="Driver" Cgroup="Driver-All"/>
      <require Cclass="Middleware" Cgroup="Middleware-All"/>
      <require Cclass="Board Support" Cgroup="LCD" Csub="SPI LCD"/>
      <accept Dname="MG32F02V032"/>
    </condition>    
