XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
  </conditions>
  <!-- ********************************************************************************************************************************* -->
  <!-- ******************************************************************************************* -->
  <!-- taxonomy (description) -->
  <!-- ******************************************************************************************* -->
  <taxonomy>
    <description Cclass="Board Support" Cgroup="ARGB">ARGB LED</description>
    <description Cclass="Board Support" Cgroup="Audio Output">Audio Output</description>
    <description Cclass="Board Support" Cgroup="BLE">BLE support</description>
    <description Cclass="Board Support" Cgroup="Button">Button group</description>
    <description Cclass="Board Support" Cgroup="LCD">LCD group</description>
    <description Cclass="Board Support" Cgroup="Communication" >Communication interface</description> 
    <description Cclass="Board Support" Cgroup="Memory">Storage device</description> 
    <description Cclass="Board Support" Cgroup="Buzzer">Buzzer control</description> 
    <description Cclass="Board Support" Cgroup="Motor">Motor group(RC Servo, Step Motor)</description> 
    <description Cclass="Board Support" Cgroup="QEI">QEI function</description> 
    <description Cclass="Board Support" Cgroup="Switch">Switch group</description> 
    <description Cclass="Board Support" Cgroup="Switch">Switch group</description> 
    <description Cclass="Board Support" Cgroup="Humidity and Temperature sensor">AM2302</description>
  </taxonomy>

  <!-- ********************************************************************************************************************************* -->
  <!-- component section (optional for all Software Packs)-->
  <components>
    <!-- ******************************************************************************************* -->
    <!-- Startup for MG32F02A132 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.4" condition="DNAME_132 CMSIS">
      <description>System Startup for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_MG32F02A132    /* Device Startup for MG32F02A132 */
      </RTE_Components_h>
      <files>
        <!--  include folder -->
        <file category="include"      name="Device/MG32x02z/MG32F02A132/MG32x02z_ConfigerWizard/Include/"/>
        <file category="include"      name="Device/MG32x02z/MG32F02A132/Include/"/>
        <file category="include"      name="Device/MG32x02z/MG32F02A_Driver/Include/"/>
        <file category="include"      name="Sample/Driver/Include/"/>
        <file category="include"      name="Device/MG32x02z/Common/Startup/"/>
        <!-- startup files -->
        <!-- ARM Compiler Toolchain -->
        <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z.s" attr="config" condition="ARMCC"  version="1.0.1"/>
        <file category="sourceC"      name="Device/MG32x02z/Common/Startup/system_MG32x02z.c"  attr="config" condition="SYSTEM_TCOM"      version="1.0.2"/>
        <file category="header"       name="Device/MG32x02z/Common/Startup/system_MG32x02z.h"  attr="config" condition="SYSTEM_TCOM"      version="1.0.1"/>
        <file category="header"       name="Device/MG32x02z/MG32F02A132/Include/MG32x02z_Ex.h" attr="config" condition="SYSTEM_TCOM"      version="1.0.0"/>
        <!-- GCC Compiler Toolchain -->
        <file category="linkerScript" name="Device/MG32x02z/MG32F02A132/linkerScript/MG32F02A132_FLASH.LD"   attr="config" condition="GCC" version="1.0.0"/>
        <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z_GCC.S"  attr="config" condition="Startup IEC60730=0 GCC" version="1.0.0"/>
        <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z_GCC2.S" attr="config" condition="Startup IEC60730=1 GCC" version="1.0.0"/>
        <!-- Read Chip ID & main with Wizard - templates -->
        <file category="sourceC"      name="Sample/Driver/Source/Sample_Show_UID.c"     attr="template" condition="SYSTEM_TCOM" select="Read chip UID"/>
        <file category="sourceC"      name="Sample/Driver/Source/Sample_main_wizard.c"  attr="template" condition="SYSTEM_TCOM" select="main initial with Chip Initial Template"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- Startup for MG32F02A072 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.4" condition="DNAME_072 CMSIS">
      <description>System Startup for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_MG32F02A072    /* Device Startup for MG32F02A072 */
      </RTE_Components_h>
      <files>
        <!--  include folder -->
        <file category="include"      name="Device/MG32x02z/MG32F02A132/MG32x02z_ConfigerWizard/Include/"/>
        <file category="include"      name="Device/MG32x02z/MG32F02A132/Include/"/>
        <file category="include"      name="Device/MG32x02z/MG32F02A_Driver/Include/"/>
        <file category="include"      name="Sample/Driver/Include/"/>
        <file category="include"      name="Device/MG32x02z/Common/Startup/"/>
        <!-- startup files -->
        <!-- ARM Compiler Toolchain -->
        <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z.s" attr="config" condition="ARMCC"  version="1.0.1"/>
        <file category="sourceC"      name="Device/MG32x02z/Common/Startup/system_MG32x02z.c"  attr="config" condition="SYSTEM_TCOM"      version="1.0.2"/>
        <file category="header"       name="Device/MG32x02z/Common/Startup/system_MG32x02z.h"  attr="config" condition="SYSTEM_TCOM"      version="1.0.1"/>
        <file category="header"       name="Device/MG32x02z/MG32F02A132/Include/MG32x02z_Ex.h" attr="config" condition="SYSTEM_TCOM"      version="1.0.0"/>
        <!-- GCC Compiler Toolchain -->
        <file category="linkerScript" name="Device/MG32x02z/MG32F02A132/linkerScript/MG32F02A072_FLASH.LD"   attr="config" condition="GCC" version="1.0.0"/>
        <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z_GCC.S"  attr="config" condition="Startup IEC60730=0 GCC" version="1.0.0"/>
        <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z_GCC2.S" attr="config" condition="Startup IEC60730=1 GCC" version="1.0.0"/>
        <!-- <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z_GCC.S"          attr="config" condition="GCC" version="1.0.0"/> -->
        <!-- Read Chip ID & main with Wizard - templates -->
        <file category="sourceC"      name="Sample/Driver/Source/Sample_Show_UID.c"     attr="template" condition="SYSTEM_TCOM" select="Read chip UID"/>
        <file category="sourceC"      name="Sample/Driver/Source/Sample_main_wizard.c"  attr="template" condition="SYSTEM_TCOM" select="main initial with Chip Initial Template"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- Startup for MG32F02A032 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.4" condition="DNAME_032 CMSIS">
      <description>System Startup for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_MG32F02A032    /* Device Startup for MG32F02A032 */
      </RTE_Components_h>
      <files>
        <!--  include folder -->
        <file category="include"      name="Device/MG32x02z/MG32F02A032/MG32x02z_ConfigerWizard/Include/"/>
        <file category="include"      name="Device/MG32x02z/MG32F02A032/Include/"/>
        <file category="include"      name="Device/MG32x02z/MG32F02A_Driver/Include/"/>
        <file category="include"      name="Sample/Driver/Include/"/>
        <file category="include"      name="Device/MG32x02z/Common/Startup/"/>
        <!-- startup files -->
        <!-- ARM Compiler Toolchain -->
        <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z.s" attr="config" condition="ARMCC"  version="1.0.1"/>
        <file category="sourceC"      name="Device/MG32x02z/Common/Startup/system_MG32x02z.c"  attr="config" condition="SYSTEM_TCOM"      version="1.0.2"/>
        <file category="header"       name="Device/MG32x02z/Common/Startup/system_MG32x02z.h"  attr="config" condition="SYSTEM_TCOM"      version="1.0.1"/>
        <file category="header"       name="Device/MG32x02z/MG32F02A032/Include/MG32x02z_Ex.h" attr="config" condition="SYSTEM_TCOM"      version="1.0.0"/>
        <!-- GCC Compiler Toolchain -->
        <file category="linkerScript" name="Device/MG32x02z/MG32F02A032/linkerScript/MG32F02A032_FLASH.LD"   attr="config" condition="GCC" version="1.0.0"/>
        <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z_GCC.S"  attr="config" condition="Startup IEC60730=0 GCC" version="1.0.0"/>
        <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z_GCC2.S" attr="config" condition="Startup IEC60730=1 GCC" version="1.0.0"/>
        <!-- <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z_GCC.S"          attr="config" condition="GCC" version="1.0.0"/> -->
        <!-- Read Chip ID & main with Wizard - templates -->
        <file category="sourceC"      name="Sample/Driver/Source/Sample_Show_UID.c"     attr="template" condition="SYSTEM_TCOM" select="Read chip UID"/>
        <file category="sourceC"      name="Sample/Driver/Source/Sample_main_wizard.c"  attr="template" condition="SYSTEM_TCOM" select="main initial with Chip Initial Template"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- Startup for MG32F02A128 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.4" condition="DNAME_A128 CMSIS">
      <description>System Startup for Megawin MAxxx Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_MG32F02A128    /* Device Startup for MG32F02A128 */
      </RTE_Components_h>
      <files>
        <!--  include folder -->
        <file category="include"      name="Device/MG32x02z/MG32F02A128/MG32x02z_ConfigerWizard/Include/"/>
        <file category="include"      name="Device/MG32x02z/MG32F02A128/Include/"/>
        <file category="include"      name="Device/MG32x02z/MG32F02A_Driver/Include/"/>
        <file category="include"      name="Sample/Driver/Include/"/>
        <file category="include"      name="Device/MG32x02z/Common/Startup/"/>
        <!-- startup files -->
        <!-- ARM Compiler Toolchain -->
        <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z.s" attr="config" condition="ARMCC" version="1.0.1"/>
        <file category="sourceC"      name="Device/MG32x02z/Common/Startup/system_MG32x02z.c"  attr="config" condition="SYSTEM_TCOM"      version="1.0.2"/>
        <file category="header"       name="Device/MG32x02z/Common/Startup/system_MG32x02z.h"  attr="config" condition="SYSTEM_TCOM"      version="1.0.1"/>
        <file category="header"       name="Device/MG32x02z/MG32F02A128/Include/MG32x02z_Ex.h" attr="config" condition="SYSTEM_TCOM"      version="1.0.0"/>
        <!-- GCC Compiler Toolchain -->
        <file category="linkerScript" name="Device/MG32x02z/MG32F02A128/linkerScript/MG32F02A128_FLASH.LD"   attr="config" condition="GCC" version="1.0.0"/>
        <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z_GCC.S"  attr="config" condition="Startup IEC60730=0 GCC" version="1.0.0"/>
        <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z_GCC2.S" attr="config" condition="Startup IEC60730=1 GCC" version="1.0.0"/>
        <!-- <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z_GCC.S"          attr="config" condition="GCC" version="1.0.0"/> -->
        <!-- Read Chip ID & main with Wizard - templates -->
        <file category="sourceC"      name="Sample/Driver/Source/Sample_Show_UID.c"     attr="template" condition="SYSTEM_TCOM" select="Read chip UID"/>
        <file category="sourceC"      name="Sample/Driver/Source/Sample_main_wizard.c"  attr="template" condition="SYSTEM_TCOM" select="main initial with Chip Initial Template"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- Startup for MG32F02U128 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.4" condition="DNAME_U128 CMSIS">
      <description>System Startup for Megawin MAxxx Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_MG32F02U128    /* Device Startup for MG32F02U128 */
      </RTE_Components_h>
      <files>
        <!--  include folder -->
        <file category="include"      name="Device/MG32x02z/MG32F02A128/MG32x02z_ConfigerWizard/Include/"/>
        <file category="include"      name="Device/MG32x02z/MG32F02A128/Include/"/>
        <file category="include"      name="Device/MG32x02z/MG32F02A_Driver/Include/"/>
        <file category="include"      name="Sample/Driver/Include/"/>
        <file category="include"      name="Device/MG32x02z/Common/Startup/"/>
        <!-- startup files -->
        <!-- ARM Compiler Toolchain -->
        <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z.s" attr="config" condition="ARMCC" version="1.0.1"/>
        <file category="sourceC"      name="Device/MG32x02z/Common/Startup/system_MG32x02z.c"  attr="config" condition="SYSTEM_TCOM"      version="1.0.2"/>
        <file category="header"       name="Device/MG32x02z/Common/Startup/system_MG32x02z.h"  attr="config" condition="SYSTEM_TCOM"      version="1.0.1"/>
        <file category="header"       name="Device/MG32x02z/MG32F02A128/Include/MG32x02z_Ex.h" attr="config" condition="SYSTEM_TCOM"      version="1.0.0"/>
        <!-- GCC Compiler Toolchain -->
        <file category="linkerScript" name="Device/MG32x02z/MG32F02A128/linkerScript/MG32F02U128_FLASH.LD"   attr="config" condition="GCC" version="1.0.0"/>
        <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z_GCC.S"  attr="config" condition="Startup IEC60730=0 GCC" version="1.0.0"/>
        <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z_GCC2.S" attr="config" condition="Startup IEC60730=1 GCC" version="1.0.0"/>
        <!-- <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z_GCC.S"          attr="config" condition="GCC" version="1.0.0"/> -->
        <!-- Read Chip ID & main with Wizard - templates -->
        <file category="sourceC"      name="Sample/Driver/Source/Sample_Show_UID.c"     attr="template" condition="SYSTEM_TCOM" select="Read chip UID"/>
        <file category="sourceC"      name="Sample/Driver/Source/Sample_main_wizard.c"  attr="template" condition="SYSTEM_TCOM" select="main initial with Chip Initial Template"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- Startup for MG32F02A064 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.4" condition="DNAME_A064 CMSIS">
      <description>System Startup for Megawin MAxxx Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_MG32F02A064    /* Device Startup for MG32F02A064 */
      </RTE_Components_h>
      <files>
        <!--  include folder -->
        <file category="include"      name="Device/MG32x02z/MG32F02A128/MG32x02z_ConfigerWizard/Include/"/>
        <file category="include"      name="Device/MG32x02z/MG32F02A128/Include/"/>
        <file category="include"      name="Device/MG32x02z/MG32F02A_Driver/Include/"/>
        <file category="include"      name="Sample/Driver/Include/"/>
        <file category="include"      name="Device/MG32x02z/Common/Startup/"/>
        <!-- startup files -->
        <!-- ARM Compiler Toolchain -->
        <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z.s" attr="config" condition="ARMCC" version="1.0.1"/>
        <file category="sourceC"      name="Device/MG32x02z/Common/Startup/system_MG32x02z.c"  attr="config" condition="SYSTEM_TCOM"      version="1.0.2"/>
        <file category="header"       name="Device/MG32x02z/Common/Startup/system_MG32x02z.h"  attr="config" condition="SYSTEM_TCOM"      version="1.0.1"/>
        <file category="header"       name="Device/MG32x02z/MG32F02A128/Include/MG32x02z_Ex.h" attr="config" condition="SYSTEM_TCOM"      version="1.0.0"/>
        <!-- GCC Compiler Toolchain -->
        <file category="linkerScript" name="Device/MG32x02z/MG32F02A128/linkerScript/MG32F02A064_FLASH.LD"   attr="config" condition="GCC" version="1.0.0"/>
        <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z_GCC.S"  attr="config" condition="Startup IEC60730=0 GCC" version="1.0.0"/>
        <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z_GCC2.S" attr="config" condition="Startup IEC60730=1 GCC" version="1.0.0"/>
        <!-- <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z_GCC.S"          attr="config" condition="GCC" version="1.0.0"/> -->
       <!-- Read Chip ID & main with Wizard - templates -->
        <file category="sourceC"      name="Sample/Driver/Source/Sample_Show_UID.c"     attr="template" condition="SYSTEM_TCOM" select="Read chip UID"/>
        <file category="sourceC"      name="Sample/Driver/Source/Sample_main_wizard.c"  attr="template" condition="SYSTEM_TCOM" select="main initial with Chip Initial Template"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- Startup for MG32F02U064 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.4" condition="DNAME_U064 CMSIS">
      <description>System Startup for Megawin MAxxx Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_MG32F02U064    /* Device Startup for MG32F02U064 */
      </RTE_Components_h>
      <files>
        <!--  include folder -->
        <file category="include"      name="Device/MG32x02z/MG32F02A128/MG32x02z_ConfigerWizard/Include/"/>
        <file category="include"      name="Device/MG32x02z/MG32F02A128/Include/"/>
        <file category="include"      name="Device/MG32x02z/MG32F02A_Driver/Include/"/>
        <file category="include"      name="Sample/Driver/Include/"/>
        <file category="include"      name="Device/MG32x02z/Common/Startup/"/>
        <!-- startup files -->
        <!-- ARM Compiler Toolchain -->
        <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z.s" attr="config" condition="ARMCC" version="1.0.1"/>
        <file category="sourceC"      name="Device/MG32x02z/Common/Startup/system_MG32x02z.c"  attr="config" condition="SYSTEM_TCOM"      version="1.0.2"/>
        <file category="header"       name="Device/MG32x02z/Common/Startup/system_MG32x02z.h"  attr="config" condition="SYSTEM_TCOM"      version="1.0.1"/>
        <file category="header"       name="Device/MG32x02z/MG32F02A128/Include/MG32x02z_Ex.h" attr="config" condition="SYSTEM_TCOM"      version="1.0.0"/>
        <!-- GCC Compiler Toolchain -->
        <file category="linkerScript" name="Device/MG32x02z/MG32F02A128/linkerScript/MG32F02U064_FLASH.LD"   attr="config" condition="GCC" version="1.0.0"/>
        <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z_GCC.S"  attr="config" condition="Startup IEC60730=0 GCC" version="1.0.0"/>
        <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z_GCC2.S" attr="config" condition="Startup IEC60730=1 GCC" version="1.0.0"/>
        <!-- <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z_GCC.S"          attr="config" condition="GCC" version="1.0.0"/> -->
        <!-- Read Chip ID & main with Wizard - templates -->
        <file category="sourceC"      name="Sample/Driver/Source/Sample_Show_UID.c"     attr="template" condition="SYSTEM_TCOM" select="Read chip UID"/>
        <file category="sourceC"      name="Sample/Driver/Source/Sample_main_wizard.c"  attr="template" condition="SYSTEM_TCOM" select="main initial with Chip Initial Template"/>
      </files>
    </component>
