XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
    <!-- ******************************************************************************************* -->
    <!-- Startup for MG32F02V032 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.4" condition="DNAME_V032 CMSIS">
      <description>System Startup for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_MG32F02V032    /* Device Startup for MG32F02V032 */
      </RTE_Components_h>
      <files>
        <!--  include folder -->
        <file category="include"      name="Device/MG32x02z/MG32F02V032/MG32x02z_ConfigerWizard/Include/"/>
        <file category="include"      name="Device/MG32x02z/MG32F02V032/Include/"/>
        <file category="include"      name="Device/MG32x02z/MG32F02A_Driver/Include/"/>
        <file category="include"      name="Sample/Driver/Include/"/>
        <file category="include"      name="Device/MG32x02z/Common/Startup/"/>
        <!-- startup files -->
        <!-- ARM Compiler Toolchain -->
        <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z.s" attr="config" condition="ARMCC" version="1.0.1"/>
        <file category="sourceC"      name="Device/MG32x02z/Common/Startup/system_MG32x02z.c"  attr="config" condition="SYSTEM_TCOM"      version="1.0.2"/>
        <file category="header"       name="Device/MG32x02z/Common/Startup/system_MG32x02z.h"  attr="config" condition="SYSTEM_TCOM"      version="1.0.1"/>
        <file category="header"       name="Device/MG32x02z/MG32F02V032/Include/MG32x02z_Ex.h" attr="config" condition="SYSTEM_TCOM"      version="1.0.0"/>
        <!-- GCC Compiler Toolchain -->
        <file category="linkerScript" name="Device/MG32x02z/MG32F02V032/linkerScript/MG32F02V032_FLASH.LD"   attr="config" condition="GCC" version="1.0.0"/>
        <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z_GCC.S"  attr="config" condition="Startup IEC60730=0 GCC" version="1.0.0"/>
        <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z_GCC2.S" attr="config" condition="Startup IEC60730=1 GCC" version="1.0.0"/>
        <!-- <file category="sourceAsm"    name="Device/MG32x02z/Common/Startup/startup_MG32x02z_GCC.S"          attr="config" condition="GCC" version="1.0.0"/> -->
        <!-- Read Chip ID & main with Wizard - templates -->
        <file category="sourceC"      name="Sample/Driver/Source/Sample_Show_UID.c"     attr="template" condition="SYSTEM_TCOM" select="Read chip UID"/>
        <file category="sourceC"      name="Sample/Driver/Source/Sample_main_wizard.c"  attr="template" condition="SYSTEM_TCOM" select="main initial with Chip Initial Template"/>
      </files>
    </component>
    <!-- ********************************************************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- PW configuration wizard for all MCU -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="PW" Cversion="1.0.1" condition="ChipInit_ALLMCU_PW">
      <description>Power control for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_PW               
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_PW_Init.h" attr="config" version="1.0.1"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_PW_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- RST configuration wizard for all MCU -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="RST" Cversion="1.0.1" condition="ChipInit_ALLMCU_RST">
      <description>Reset control for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_RST              
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_RST_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_RST_Init.c" attr="config" version="1.0.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- GPIO configuration wizard for MG32F02A132_LQFP80 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="GPIO" Cvariant="LQFP80" Cversion="1.0.2" isDefaultVariant="true" condition="ChipInit_132_GPIO">
      <description>GPIO configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_Package_LQFP80            
        #define MG32x02z_ConfigerWizard_GPIO
        #define MG32x02z_GPIO_FILENAME  "MG32x02z_GPIO_LQFP80_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A132/LQFP80/MG32x02z_GPIO_LQFP80_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_GPIO_Init.c" attr="config" version="1.0.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- GPIO configuration wizard for MG32F02A132_LQFP64 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="GPIO" Cvariant="LQFP64" Cversion="1.0.2" condition="ChipInit_132_GPIO">
      <description>GPIO configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_Package_LQFP64              
        #define MG32x02z_ConfigerWizard_GPIO
        #define MG32x02z_GPIO_FILENAME  "MG32x02z_GPIO_LQFP64_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A132/LQFP64/MG32x02z_GPIO_LQFP64_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_GPIO_Init.c" attr="config" version="1.0.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- GPIO configuration wizard for MG32F02A072_LQFP48 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="GPIO" Cvariant="LQFP48" Cversion="1.0.2"  condition="ChipInit_072_GPIO">
      <description>GPIO configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_Package_LQFP48              
        #define MG32x02z_ConfigerWizard_GPIO
        #define MG32x02z_GPIO_FILENAME  "MG32x02z_GPIO_LQFP48_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A072/LQFP48/MG32x02z_GPIO_LQFP48_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_GPIO_Init.c" attr="config" version="1.0.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- GPIO configuration wizard for MG32F02A072_LQFP64 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="GPIO" Cvariant="LQFP64" Cversion="1.0.2" isDefaultVariant="true" condition="ChipInit_072_GPIO">
      <description>GPIO configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_Package_LQFP64              
        #define MG32x02z_ConfigerWizard_GPIO
        #define MG32x02z_GPIO_FILENAME  "MG32x02z_GPIO_LQFP64_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A072/LQFP64/MG32x02z_GPIO_LQFP64_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_GPIO_Init.c" attr="config" version="1.0.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- GPIO configuration wizard for MG32F02A032_LQFP48 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="GPIO" Cvariant="LQFP48" Cversion="1.0.2" isDefaultVariant="true" condition="ChipInit_032_GPIO">
      <description>GPIO configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_Package_LQFP48            
        #define MG32x02z_ConfigerWizard_GPIO
        #define MG32x02z_GPIO_FILENAME  "MG32x02z_GPIO_LQFP48_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A032/LQFP48/MG32x02z_GPIO_LQFP48_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_GPIO_Init.c" attr="config" version="1.0.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- GPIO configuration wizard for MG32F02A032_QFN32 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="GPIO" Cvariant="QFN32" Cversion="1.0.2" condition="ChipInit_032_GPIO">
      <description>GPIO configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_Package_QFN32        
        #define MG32x02z_ConfigerWizard_GPIO
        #define MG32x02z_GPIO_FILENAME  "MG32x02z_GPIO_QFN32_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A032/QFN32/MG32x02z_GPIO_QFN32_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_GPIO_Init.c" attr="config" version="1.0.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- GPIO configuration wizard for MG32F02A032_TSSOP20 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="GPIO" Cvariant="TSSOP20" Cversion="1.0.2" condition="ChipInit_032_GPIO">
      <description>GPIO configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_Package_TSSOP20          
        #define MG32x02z_ConfigerWizard_GPIO
        #define MG32x02z_GPIO_FILENAME  "MG32x02z_GPIO_TSSOP20_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A032/TSSOP20/MG32x02z_GPIO_TSSOP20_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_GPIO_Init.c" attr="config" version="1.0.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- GPIO configuration wizard for MG32F02A128_LQFP80 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="GPIO" Cvariant="LQFP80" Cversion="1.0.0" isDefaultVariant="true" condition="ChipInit_A128_GPIO">
      <description>GPIO configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_Package_LQFP80         
        #define MG32x02z_ConfigerWizard_GPIO
        #define MG32x02z_GPIO_FILENAME  "MG32x02z_GPIO_LQFP80_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A128/LQFP80/MG32x02z_GPIO_LQFP80_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_GPIO_Init.c" attr="config" version="1.0.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- GPIO configuration wizard for MG32F02A128_LQFP64 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="GPIO" Cvariant="LQFP64" Cversion="1.0.0" condition="ChipInit_A128_GPIO">
      <description>GPIO configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_Package_LQFP64    
        #define MG32x02z_ConfigerWizard_GPIO
        #define MG32x02z_GPIO_FILENAME  "MG32x02z_GPIO_LQFP64_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A128/LQFP64/MG32x02z_GPIO_LQFP64_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_GPIO_Init.c" attr="config" version="1.0.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- GPIO configuration wizard for MG32F02U128_LQFP80 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="GPIO" Cvariant="LQFP80U" Cversion="1.0.0" isDefaultVariant="true" condition="ChipInit_U128_GPIO">
      <description>GPIO configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_Package_LQFP80         
        #define MG32x02z_ConfigerWizard_GPIO
        #define MG32x02z_GPIO_FILENAME  "MG32x02z_GPIO_LQFP80U_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02U128/LQFP80U/MG32x02z_GPIO_LQFP80U_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_GPIO_Init.c" attr="config" version="1.0.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- GPIO configuration wizard for MG32F02U128_LQFP64 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="GPIO" Cvariant="LQFP64U" Cversion="1.0.0" condition="ChipInit_U128_GPIO">
      <description>GPIO configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_Package_LQFP64    
        #define MG32x02z_ConfigerWizard_GPIO
        #define MG32x02z_GPIO_FILENAME  "MG32x02z_GPIO_LQFP64U_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02U128/LQFP64U/MG32x02z_GPIO_LQFP64U_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_GPIO_Init.c" attr="config" version="1.0.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- GPIO configuration wizard for MG32F02A064_LQFP64 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="GPIO" Cvariant="LQFP64" Cversion="1.0.0" isDefaultVariant="true" condition="ChipInit_A064_GPIO">
      <description>GPIO configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_Package_LQFP64         
        #define MG32x02z_ConfigerWizard_GPIO
        #define MG32x02z_GPIO_FILENAME  "MG32x02z_GPIO_LQFP64_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A064/LQFP64/MG32x02z_GPIO_LQFP64_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_GPIO_Init.c" attr="config" version="1.0.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- GPIO configuration wizard for MG32F02A064_LQFP48 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="GPIO" Cvariant="LQFP48" Cversion="1.0.0" condition="ChipInit_A064_GPIO">
      <description>GPIO configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_Package_LQFP48        
        #define MG32x02z_ConfigerWizard_GPIO
        #define MG32x02z_GPIO_FILENAME  "MG32x02z_GPIO_LQFP48_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A064/LQFP48/MG32x02z_GPIO_LQFP48_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_GPIO_Init.c" attr="config" version="1.0.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
