XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- GPIO configuration wizard for MG32F02U064_LQFP64 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="GPIO" Cvariant="LQFP64U" Cversion="1.0.0" isDefaultVariant="true" condition="ChipInit_U064_GPIO">
      <description>GPIO configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_Package_LQFP64         
        #define MG32x02z_ConfigerWizard_GPIO
        #define MG32x02z_GPIO_FILENAME  "MG32x02z_GPIO_LQFP64U_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02U064/LQFP64U/MG32x02z_GPIO_LQFP64U_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_GPIO_Init.c" attr="config" version="1.0.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- GPIO configuration wizard for MG32F02U064_LQFP48 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="GPIO" Cvariant="LQFP48U" Cversion="1.0.0" condition="ChipInit_U064_GPIO">
      <description>GPIO configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_Package_LQFP48   
        #define MG32x02z_ConfigerWizard_GPIO
        #define MG32x02z_GPIO_FILENAME  "MG32x02z_GPIO_LQFP48U_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02U064/LQFP48U/MG32x02z_GPIO_LQFP48U_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_GPIO_Init.c" attr="config" version="1.0.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- GPIO configuration wizard for MG32F02V032_LQFP32 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="GPIO" Cvariant="LQFP32" Cversion="1.0.0" isDefaultVariant="true" condition="ChipInit_V032_GPIO">
      <description>GPIO configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_Package_LQFP32      
        #define MG32x02z_ConfigerWizard_GPIO
        #define MG32x02z_GPIO_FILENAME  "MG32x02z_GPIO_LQFP32_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02V032/LQFP32/MG32x02z_GPIO_LQFP32_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_GPIO_Init.c" attr="config" version="1.0.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- GPIO configuration wizard for MG32F02V032_QFN32 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="GPIO" Cvariant="QFN32" Cversion="1.0.0" condition="ChipInit_V032_GPIO">
      <description>GPIO configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_Package_QFN32        
        #define MG32x02z_ConfigerWizard_GPIO
        #define MG32x02z_GPIO_FILENAME  "MG32x02z_GPIO_QFN32_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02V032/QFN32/MG32x02z_GPIO_QFN32_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_GPIO_Init.c" attr="config" version="1.0.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- GPIO configuration wizard for MG32F02V032_TSSOP20 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="GPIO" Cvariant="TSSOP20" Cversion="1.0.0" condition="ChipInit_V032_GPIO">
      <description>GPIO configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_Package_TSSOP20          
        #define MG32x02z_ConfigerWizard_GPIO
        #define MG32x02z_GPIO_FILENAME  "MG32x02z_GPIO_TSSOP20_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02V032/TSSOP20/MG32x02z_GPIO_TSSOP20_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_GPIO_Init.c" attr="config" version="1.0.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- CSC configuration wizard for MG32F02A132 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="CSC" Cversion="1.0.4" condition="CSC_INIT_MG32F02A132">
      <description>Clock Source Control for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_CSC            
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A132/MG32x02z_CSC_Init.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_CSC_Init.c" attr="config" version="1.1.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- CSC configuration wizard for MG32F02A072 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="CSC" Cversion="1.0.4" condition="CSC_INIT_MG32F02A072">
      <description>Clock Source Control for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_CSC            
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A072/MG32x02z_CSC_Init.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_CSC_Init.c" attr="config" version="1.1.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- CSC configuration wizard for MG32F02A032 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="CSC" Cversion="1.0.4" condition="CSC_INIT_MG32F02A032">
      <description>Clock Source Control for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_CSC            
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A032/MG32x02z_CSC_Init.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_CSC_Init.c" attr="config" version="1.1.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- CSC configuration wizard for MG32F02A128 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="CSC" Cversion="1.0.4" condition="CSC_INIT_MG32F02A128">
      <description>Clock Source Control for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_CSC            
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A128/MG32x02z_CSC_Init.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_CSC_Init.c" attr="config" version="1.1.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- CSC configuration wizard for MG32F02U128 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="CSC" Cversion="1.0.4" condition="CSC_INIT_MG32F02U128">
      <description>Clock Source Control for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_CSC            
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02U128/MG32x02z_CSC_Init.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_CSC_Init.c" attr="config" version="1.1.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- CSC configuration wizard for MG32F02A064 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="CSC" Cversion="1.0.4" condition="CSC_INIT_MG32F02A064">
      <description>Clock Source Control for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_CSC            
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A064/MG32x02z_CSC_Init.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_CSC_Init.c" attr="config" version="1.1.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- CSC configuration wizard for MG32F02U064 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="CSC" Cversion="1.0.4" condition="CSC_INIT_MG32F02U064">
      <description>Clock Source Control for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_CSC            
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02U064/MG32x02z_CSC_Init.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_CSC_Init.c" attr="config" version="1.1.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- CSC configuration wizard for MG32F02V032 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="CSC" Cversion="1.0.4" condition="CSC_INIT_MG32F02V032">
      <description>Clock Source Control for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_CSC            
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02V032/MG32x02z_CSC_Init.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_CSC_Init.c" attr="config" version="1.1.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- EXIC configuration wizard for MG32F02A132 _LQFP80 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="EXIC" Cvariant="LQFP80" Cversion="1.0.2" isDefaultVariant="true" condition="ChipInit_132_EXIC">
      <description>EXIC initial for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_EXIC          
        #define MG32x02z_EXIC_FILENAME  "MG32x02z_EXIC_LQFP80_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A132/LQFP80/MG32x02z_EXIC_LQFP80_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_EXIC_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- EXIC configuration wizard for MG32F02A132 _LQFP64 -->
    <!-- ******************************************************************************************* -->
   <component Cclass="ChipInit_Wizard" Cgroup="EXIC" Cvariant="LQFP64" Cversion="1.0.2" condition="ChipInit_132_EXIC">
      <description>EXIC initial for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_EXIC          
        #define MG32x02z_EXIC_FILENAME  "MG32x02z_EXIC_LQFP64_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A132/LQFP64/MG32x02z_EXIC_LQFP64_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_EXIC_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- EXIC configuration wizard for MG32F02A072 _LQFP48 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="EXIC" Cvariant="LQFP48" Cversion="1.0.2" condition="ChipInit_072_EXIC">
      <description>EXIC initial for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_EXIC          
        #define MG32x02z_EXIC_FILENAME  "MG32x02z_EXIC_LQFP48_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A072/LQFP48/MG32x02z_EXIC_LQFP48_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_EXIC_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- EXIC configuration wizard for MG32F02A072 _LQFP64 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="EXIC" Cvariant="LQFP64" Cversion="1.0.2" isDefaultVariant="true" condition="ChipInit_072_EXIC">
      <description>EXIC initial for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_EXIC          
        #define MG32x02z_EXIC_FILENAME  "MG32x02z_EXIC_LQFP64_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A072/LQFP64/MG32x02z_EXIC_LQFP64_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_EXIC_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- EXIC configuration wizard for MG32F02A032 _LQFP48 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="EXIC" Cvariant="LQFP48" Cversion="1.0.2" isDefaultVariant="true" condition="ChipInit_032_EXIC">
      <description>EXIC initial for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_EXIC          
        #define MG32x02z_EXIC_FILENAME  "MG32x02z_EXIC_LQFP48_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A032/LQFP48/MG32x02z_EXIC_LQFP48_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_EXIC_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- EXIC configuration wizard for MG32F02A032 _QFN32 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="EXIC" Cvariant="QFN32" Cversion="1.0.2" condition="ChipInit_032_EXIC">
      <description>EXIC initial for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_EXIC          
        #define MG32x02z_EXIC_FILENAME  "MG32x02z_EXIC_QFN32_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A032/QFN32/MG32x02z_EXIC_QFN32_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_EXIC_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
