XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
    <!-- ******************************************************************************************* -->
    <!-- EXIC configuration wizard for MG32F02A032 _TSSOP20 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="EXIC" Cvariant="TSSOP20" Cversion="1.0.2" condition="ChipInit_032_EXIC">
      <description>EXIC initial for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_EXIC          
        #define MG32x02z_EXIC_FILENAME  "MG32x02z_EXIC_TSSOP20_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A032/TSSOP20/MG32x02z_EXIC_TSSOP20_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_EXIC_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- EXIC configuration wizard for MG32F02A128 _LQFP80 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="EXIC" Cvariant="LQFP80" Cversion="1.0.2" isDefaultVariant="true" condition="ChipInit_A128_EXIC">
      <description>EXIC initial for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_EXIC          
        #define MG32x02z_EXIC_FILENAME  "MG32x02z_EXIC_LQFP80_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A128/LQFP80/MG32x02z_EXIC_LQFP80_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_EXIC_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- EXIC configuration wizard for MG32F02A128 _LQFP64 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="EXIC" Cvariant="LQFP64" Cversion="1.0.2" condition="ChipInit_A128_EXIC">
      <description>EXIC initial for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_EXIC          
        #define MG32x02z_EXIC_FILENAME  "MG32x02z_EXIC_LQFP64_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A128/LQFP64/MG32x02z_EXIC_LQFP64_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_EXIC_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- EXIC configuration wizard for MG32F02U128 _LQFP80 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="EXIC" Cvariant="LQFP80U" Cversion="1.0.2" isDefaultVariant="true" condition="ChipInit_U128_EXIC">
      <description>EXIC initial for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_EXIC          
        #define MG32x02z_EXIC_FILENAME  "MG32x02z_EXIC_LQFP80U_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02U128/LQFP80U/MG32x02z_EXIC_LQFP80U_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_EXIC_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- EXIC configuration wizard for MG32F02U128 _LQFP64 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="EXIC" Cvariant="LQFP64U" Cversion="1.0.2" condition="ChipInit_U128_EXIC">
      <description>EXIC initial for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_EXIC          
        #define MG32x02z_EXIC_FILENAME  "MG32x02z_EXIC_LQFP64U_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02U128/LQFP64U/MG32x02z_EXIC_LQFP64U_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_EXIC_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- EXIC configuration wizard for MG32F02A064 _LQFP64 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="EXIC" Cvariant="LQFP64" Cversion="1.0.2" isDefaultVariant="true" condition="ChipInit_A064_EXIC">
      <description>EXIC initial for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_EXIC          
        #define MG32x02z_EXIC_FILENAME  "MG32x02z_EXIC_LQFP64_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A064/LQFP64/MG32x02z_EXIC_LQFP64_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_EXIC_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- EXIC configuration wizard for MG32F02A064 _LQFP48 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="EXIC" Cvariant="LQFP48" Cversion="1.0.2" condition="ChipInit_A064_EXIC">
      <description>EXIC initial for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_EXIC          
        #define MG32x02z_EXIC_FILENAME  "MG32x02z_EXIC_LQFP48_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02A064/LQFP48/MG32x02z_EXIC_LQFP48_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_EXIC_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- EXIC configuration wizard for MG32F02U064 _LQFP64 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="EXIC" Cvariant="LQFP64U" Cversion="1.0.2" isDefaultVariant="true" condition="ChipInit_U064_EXIC">
      <description>EXIC initial for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_EXIC          
        #define MG32x02z_EXIC_FILENAME  "MG32x02z_EXIC_LQFP64U_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02U064/LQFP64U/MG32x02z_EXIC_LQFP64U_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_EXIC_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- EXIC configuration wizard for MG32F02U064 _LQFP48 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="EXIC" Cvariant="LQFP48U" Cversion="1.0.2" condition="ChipInit_U064_EXIC">
      <description>EXIC initial for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_EXIC          
        #define MG32x02z_EXIC_FILENAME  "MG32x02z_EXIC_LQFP48U_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02U064/LQFP48U/MG32x02z_EXIC_LQFP48U_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_EXIC_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- EXIC configuration wizard for MG32F02V032 _LQFP32 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="EXIC" Cvariant="LQFP32" Cversion="1.0.2"  condition="ChipInit_V032_EXIC">
      <description>EXIC initial for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_EXIC          
        #define MG32x02z_EXIC_FILENAME  "MG32x02z_EXIC_LQFP32_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02V032/LQFP32/MG32x02z_EXIC_LQFP32_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_EXIC_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- EXIC configuration wizard for MG32F02V032 _QFN32 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="EXIC" Cvariant="QFN32" Cversion="1.0.2" condition="ChipInit_V032_EXIC">
      <description>EXIC initial for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_EXIC          
        #define MG32x02z_EXIC_FILENAME  "MG32x02z_EXIC_QFN32_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02V032/QFN32/MG32x02z_EXIC_QFN32_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_EXIC_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- EXIC configuration wizard for MG32F02V032 _TSSOP20 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="EXIC" Cvariant="TSSOP20" Cversion="1.0.2" condition="ChipInit_V032_EXIC">
      <description>EXIC initial for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_EXIC          
        #define MG32x02z_EXIC_FILENAME  "MG32x02z_EXIC_TSSOP20_Init.h"
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Package/MG32F02V032/TSSOP20/MG32x02z_EXIC_TSSOP20_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_EXIC_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- GPL configuration wizard for MG32F02A132/072 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="GPL" Cversion="1.0.1" condition="ChipInit_132_GPL">
      <description>GPL recipe initial for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_GPL        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A132/MG32x02z_ConfigerWizard/Include/MG32x02z_GPL_Init.h" attr="config" version="1.0.1"/>
        <file category="sourceC" name="Device/MG32x02z/MG32F02A132/MG32x02z_ConfigerWizard/Source/MG32x02z_GPL_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- GPL configuration wizard for MG32F02A032 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="GPL" Cversion="1.0.1" condition="ChipInit_032_GPL">
      <description>GPL recipe initial for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_GPL        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A032/MG32x02z_ConfigerWizard/Include/MG32x02z_GPL_Init.h" attr="config" version="1.0.1"/>
        <file category="sourceC" name="Device/MG32x02z/MG32F02A032/MG32x02z_ConfigerWizard/Source/MG32x02z_GPL_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- GPL configuration wizard for MG32F02A128/U128/A064/U064 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="GPL" Cversion="1.0.1" condition="ChipInit_128_GPL">
      <description>GPL recipe initial for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_GPL        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A128/MG32x02z_ConfigerWizard/Include/MG32x02z_GPL_Init.h" attr="config" version="1.0.1"/>
        <file category="sourceC" name="Device/MG32x02z/MG32F02A128/MG32x02z_ConfigerWizard/Source/MG32x02z_GPL_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- GPL configuration wizard for MG32F02V032 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="GPL" Cversion="1.0.1" condition="ChipInit_V032_GPL">
      <description>GPL recipe initial for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_GPL        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02V032/MG32x02z_ConfigerWizard/Include/MG32x02z_GPL_Init.h" attr="config" version="1.0.1"/>
        <file category="sourceC" name="Device/MG32x02z/MG32F02V032/MG32x02z_ConfigerWizard/Source/MG32x02z_GPL_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- MEM configuration wizard for MG32F02A132/072 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="MEM" Cversion="1.0.1" condition="ChipInit_132_MEM">
      <description>MEM configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_MEM       
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A132/MG32x02z_ConfigerWizard/Include/MG32x02z_MEM_Init.h" attr="config" version="1.0.1"/>
        <file category="sourceC" name="Device/MG32x02z/MG32F02A132/MG32x02z_ConfigerWizard/Source/MG32x02z_MEM_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- MEM configuration wizard for MG32F02A032 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="MEM" Cversion="1.0.1" condition="ChipInit_032_MEM">
      <description>MEM configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_MEM       
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A032/MG32x02z_ConfigerWizard/Include/MG32x02z_MEM_Init.h" attr="config" version="1.0.1"/>
        <file category="sourceC" name="Device/MG32x02z/MG32F02A032/MG32x02z_ConfigerWizard/Source/MG32x02z_MEM_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- MEM configuration wizard for MG32F02A128/U128/A064/U064 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="MEM" Cversion="1.0.1" condition="ChipInit_128_MEM">
      <description>MEM configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_MEM       
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A128/MG32x02z_ConfigerWizard/Include/MG32x02z_MEM_Init.h" attr="config" version="1.0.1"/>
        <file category="sourceC" name="Device/MG32x02z/MG32F02A128/MG32x02z_ConfigerWizard/Source/MG32x02z_MEM_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
