XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
    <!-- ******************************************************************************************* -->
    <!-- MEM configuration wizard for MG32F02V032 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="MEM" Cversion="1.0.1" condition="ChipInit_V032_MEM">
      <description>MEM configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_MEM       
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A032/MG32x02z_ConfigerWizard/Include/MG32x02z_MEM_Init.h" attr="config" version="1.0.1"/>
        <file category="sourceC" name="Device/MG32x02z/MG32F02A032/MG32x02z_ConfigerWizard/Source/MG32x02z_MEM_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- EMB configuration wizard for MG32F02A132 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="EMB" Cversion="1.0.2" condition="ChipInit_132_EMB">
      <description>EMB configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_EMB       
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A132/MG32x02z_ConfigerWizard/Include/MG32x02z_EMB_Init.h" attr="config" version="1.0.1"/>
        <file category="sourceC" name="Device/MG32x02z/MG32F02A132/MG32x02z_ConfigerWizard/Source/MG32x02z_EMB_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- EMB configuration wizard for MG32F02A128/U128/A064/U064 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="EMB" Cversion="1.0.2" condition="ChipInit_128_EMB">
      <description>EMB configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_EMB       
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A128/MG32x02z_ConfigerWizard/Include/MG32x02z_EMB_Init.h" attr="config" version="1.0.1"/>
        <file category="sourceC" name="Device/MG32x02z/MG32F02A128/MG32x02z_ConfigerWizard/Source/MG32x02z_EMB_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- URT configuration wizard for MG32F02A132/072 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="URT" Cversion="1.0.2" condition="ChipInit_132_URT">
      <description>URTx configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_URT  
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A132/MG32x02z_ConfigerWizard/Include/MG32x02z_URT_Init.h" attr="config" version="1.0.3"/>
        <file category="sourceC" name="Device/MG32x02z/MG32F02A132/MG32x02z_ConfigerWizard/Source/MG32x02z_URT_Init.c" attr="config" version="1.0.3"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- URT configuration wizard for MG32F02A032 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="URT" Cversion="1.0.1" condition="ChipInit_032_URT">
      <description>URTx configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_URT       
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A032/MG32x02z_ConfigerWizard/Include/MG32x02z_URT_Init.h" attr="config" version="1.0.3"/>
        <file category="sourceC" name="Device/MG32x02z/MG32F02A032/MG32x02z_ConfigerWizard/Source/MG32x02z_URT_Init.c" attr="config" version="1.0.3"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- URT configuration wizard for MG32F02A128/U128/A064/U064 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="URT" Cversion="1.0.1" condition="ChipInit_128_URT">
      <description>URTx configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_URT       
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A128/MG32x02z_ConfigerWizard/Include/MG32x02z_URT_Init.h" attr="config" version="1.0.3"/>
        <file category="sourceC" name="Device/MG32x02z/MG32F02A128/MG32x02z_ConfigerWizard/Source/MG32x02z_URT_Init.c" attr="config" version="1.0.3"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- URT configuration wizard for MG32F02V032 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="URT" Cversion="1.0.1" condition="ChipInit_V032_URT">
      <description>URTx configuration for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_URT       
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02V032/MG32x02z_ConfigerWizard/Include/MG32x02z_URT_Init.h" attr="config" version="1.0.3"/>
        <file category="sourceC" name="Device/MG32x02z/MG32F02V032/MG32x02z_ConfigerWizard/Source/MG32x02z_URT_Init.c" attr="config" version="1.0.3"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- TM configuration wizard for MG32F02A132/072 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="Timer" Cversion="1.0.0" condition="ChipInit_132_TM">
      <description>TM Initial wizard for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_TM        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A132/MG32x02z_ConfigerWizard/Include/MG32x02z_TM_Init.h" attr="config" version="1.2.2"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_TM_Init.c" attr="config" version="1.1.2"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- TM configuration wizard for MG32F02A032 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="Timer" Cversion="1.0.0" condition="ChipInit_032_TM">
      <description>TM Initial wizard for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_TM        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A032/MG32x02z_ConfigerWizard/Include/MG32x02z_TM_Init.h" attr="config" version="1.2.2"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_TM_Init.c" attr="config" version="1.1.2"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- TM configuration wizard for MG32F02A128/U128/A064/U064 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="Timer" Cversion="1.0.0" condition="ChipInit_128_TM">
      <description>TM Initial wizard for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_TM        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A128/MG32x02z_ConfigerWizard/Include/MG32x02z_TM_Init.h" attr="config" version="1.2.2"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_TM_Init.c" attr="config" version="1.1.2"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- TM configuration wizard for MG32F02V032 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="Timer" Cversion="1.0.0" condition="ChipInit_V032_TM">
      <description>TM Initial wizard for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_TM        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02V032/MG32x02z_ConfigerWizard/Include/MG32x02z_TM_Init.h" attr="config" version="1.2.2"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_TM_Init.c" attr="config" version="1.1.2"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- ADC configuration wizard for MG32F02A132/072 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="ADC" Cversion="1.0.0" condition="ChipInit_132_ADC">
      <description>ADC Initial wizard for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_ADC        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A132/MG32x02z_ConfigerWizard/Include/MG32x02z_ADC_Init.h" attr="config" version="1.1.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ADC_Init.c" attr="config" version="1.1.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ADC configuration wizard for MG32F02A032 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="ADC" Cversion="1.0.0" condition="ChipInit_032_ADC">
      <description>ADC Initial wizard for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_ADC        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A032/MG32x02z_ConfigerWizard/Include/MG32x02z_ADC_Init.h" attr="config" version="1.1.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ADC_Init.c" attr="config" version="1.1.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ADC configuration wizard for MG32F02A128/U128/A064/U064 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="ADC" Cversion="1.0.0" condition="ChipInit_128_ADC">
      <description>ADC Initial wizard for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_ADC        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A128/MG32x02z_ConfigerWizard/Include/MG32x02z_ADC_Init.h" attr="config" version="1.1.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ADC_Init.c" attr="config" version="1.1.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ADC configuration wizard for MG32F02V032 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="ADC" Cversion="1.0.0" condition="ChipInit_V032_ADC">
      <description>ADC Initial wizard for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_ADC        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02V032/MG32x02z_ConfigerWizard/Include/MG32x02z_ADC_Init.h" attr="config" version="1.1.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ADC_Init.c" attr="config" version="1.1.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- DAC configuration wizard for MG32F02A132/072 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="DAC" Cversion="1.0.0" condition="ChipInit_132_DAC">
      <description>DAC Initial wizard for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_DAC        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A132/MG32x02z_ConfigerWizard/Include/MG32x02z_DAC_Init.h" attr="config" version="1.1.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_DAC_Init.c" attr="config" version="1.1.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- DAC configuration wizard for MG32F02A128/U128/A064/U064 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="DAC" Cversion="1.0.0" condition="ChipInit_128_DAC">
      <description>DAC Initial wizard for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_DAC        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A128/MG32x02z_ConfigerWizard/Include/MG32x02z_DAC_Init.h" attr="config" version="1.1.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_DAC_Init.c" attr="config" version="1.1.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- CMP configuration wizard for MG32F02A132/072 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="CMP" Cversion="1.0.0" condition="ChipInit_132_CMP">
      <description>CMP Initial wizard for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_CMP        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A132/MG32x02z_ConfigerWizard/Include/MG32x02z_CMP_Init.h" attr="config" version="1.1.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_CMP_Init.c" attr="config" version="1.1.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- CMP configuration wizard for MG32F02A032 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="CMP" Cversion="1.0.0" condition="ChipInit_032_CMP">
      <description>CMP Initial wizard for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_CMP        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A032/MG32x02z_ConfigerWizard/Include/MG32x02z_CMP_Init.h" attr="config" version="1.1.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_CMP_Init.c" attr="config" version="1.1.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- CMP configuration wizard for MG32F02A128/U128/A064/U064 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="CMP" Cversion="1.0.0" condition="ChipInit_128_CMP">
      <description>CMP Initial wizard for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_CMP        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A128/MG32x02z_ConfigerWizard/Include/MG32x02z_CMP_Init.h" attr="config" version="1.1.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_CMP_Init.c" attr="config" version="1.1.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
