XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- APB configuration wizard for MG32F02A132/072 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="APB" Cversion="1.0.0" condition="ChipInit_132_APB">
      <description>APB Initial wizard for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_APB        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A132/MG32x02z_ConfigerWizard/Include/MG32x02z_APB_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_APB_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- APB configuration wizard for MG32F02A032 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="APB" Cversion="1.0.0" condition="ChipInit_032_APB">
      <description>APB Initial wizard for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_APB        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A032/MG32x02z_ConfigerWizard/Include/MG32x02z_APB_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_APB_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- APB configuration wizard for MG32F02A128/U128/A064/U064 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="APB" Cversion="1.0.0" condition="ChipInit_128_APB">
      <description>APB Initial wizard for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_APB        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A128/MG32x02z_ConfigerWizard/Include/MG32x02z_APB_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_APB_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- APB configuration wizard for MG32F02V032 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="APB" Cversion="1.0.0" condition="ChipInit_V032_APB">
      <description>APB Initial wizard for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_APB        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02V032/MG32x02z_ConfigerWizard/Include/MG32x02z_APB_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_APB_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- APX CCL configuration wizard for MG32F02A128/U128/A064/U064 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="APX_CCL" Cversion="1.0.0" condition="ChipInit_128_APX_CCL">
      <description>APX_CCL Initial wizard for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_APX_CCL        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A128/MG32x02z_ConfigerWizard/Include/MG32x02z_CCL_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/MG32F02A128/MG32x02z_ConfigerWizard/Source/MG32x02z_CCL_Init.c" attr="config" version="1.0.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- APX CCL configuration wizard for MG32F02V032 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="APX_CCL" Cversion="1.0.0" condition="ChipInit_V032_APX_CCL">
      <description>APX_CCL Initial wizard for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_APX_CCL        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02V032/MG32x02z_ConfigerWizard/Include/MG32x02z_CCL_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/MG32F02V032/MG32x02z_ConfigerWizard/Source/MG32x02z_CCL_Init.c" attr="config" version="1.0.0"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- RTC configuration wizard for MG32F02A132/072 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="RTC" Cversion="1.0.0" condition="ChipInit_ALLMCU_RST">
      <description>RTC Initial wizard for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_RTC        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_RTC_Init.h" attr="config" version="1.0.1"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_RTC_Init.c" attr="config" version="1.0.2"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- I2C configuration wizard for MG32F02A132/072 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="I2C" Cversion="1.0.0" condition="ChipInit_132_I2C">
      <description>I2C Initial wizard for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_I2C        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A132/MG32x02z_ConfigerWizard/Include/MG32x02z_I2C_Init.h" attr="config" version="1.0.1"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_I2C_Init.c" attr="config" version="1.0.2"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- I2C configuration wizard for MG32F02A032 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="I2C" Cversion="1.0.0" condition="ChipInit_032_I2C">
      <description>I2C Initial wizard for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_I2C        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A032/MG32x02z_ConfigerWizard/Include/MG32x02z_I2C_Init.h" attr="config" version="1.0.1"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_I2C_Init.c" attr="config" version="1.0.2"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- I2C configuration wizard for MG32F02A128/U128/A064/U064 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="I2C" Cversion="1.0.0" condition="ChipInit_128_I2C">
      <description>I2C Initial wizard for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_I2C        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02A128/MG32x02z_ConfigerWizard/Include/MG32x02z_I2C_Init.h" attr="config" version="1.0.1"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_I2C_Init.c" attr="config" version="1.0.2"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- I2C configuration wizard for MG32F02V032 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="I2C" Cversion="1.0.0" condition="ChipInit_V032_I2C">
      <description>I2C Initial wizard for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_I2C        
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/MG32F02V032/MG32x02z_ConfigerWizard/Include/MG32x02z_I2C_Init.h" attr="config" version="1.0.1"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_I2C_Init.c" attr="config" version="1.0.2"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- SPI configuration wizard for All MCU -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="SPI" Cversion="1.0.0" condition="ChipInit_ALLMCU_RST">
      <description>SPI control for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_SPI              
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_SPI_Init.h" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_SPI_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- WWDT configuration wizard for All MCU -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="WWDT" Cversion="1.0.0" condition="ChipInit_ALLMCU_RST">
      <description>WWDT control for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_WWDT              
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_WWDT_Init.h" attr="config" version="1.0.1"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_WWDT_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- ******************************************************************************************* -->
    <!-- IWDT configuration wizard for All MCU -->
    <!-- ******************************************************************************************* -->
    <component Cclass="ChipInit_Wizard" Cgroup="IWDT" Cversion="1.0.0" condition="ChipInit_ALLMCU_RST">
      <description>WWDT control for Megawin MG32x02A Series</description>
      <RTE_Components_h>
        #define MG32x02z_ConfigerWizard_IWDT              
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_IWDT_Init.h" attr="config" version="1.0.1"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_IWDT_Init.c" attr="config" version="1.0.1"/>
        <file category="header" name="Device/MG32x02z/Common/Initial/Include/MG32x02z_ChipInit.h" attr="config" version="1.0.6"/>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z_ChipInit.c" attr="config" version="1.1.0"/>
      </files>
    </component>
