XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
    <!-- Driver selction (MG32F02A032)-->
    <component Cclass="Driver" Cgroup="Driver-All" Cversion="1.0.2" condition="DNAME_DRIVER_032">
      <description>Select MG32x02z driver for project</description>
      <RTE_Components_h>
        #define IRQHandler_Driver_Level_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Driver/Source/MG32x02z__Common_DRV.c" version="1.0.0"/>
        <file category="include" name="Device/MG32x02z/MG32F02A_Driver/Include/" version="1.0.1"/>
        <file category="include" name="Sample/Driver/Include/" version="1.0.1"/>
        <file category="source" name="Sample/Driver/Source/Sample_RTC_WakeupFromSLEEPMode.c" attr="template" select="Sample code - Wakeup from SLEEP mode"/>
        <file category="source" name="Sample/Driver/Source/Sample_RTC_WakeupFromSTOPMode.c" attr="template" select="Sample code - Wakeup from STOP mode"/>
        <file category="source" name="Sample/Driver/Source/Sample_Enter_STOP_SLEEP_Mode.c" attr="template" select="Sample code - Enter SLEEP or STOP mode"/>
        <!-- ADC Driver -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Driver/Source/MG32x02z_ADC_DRV.c" version="1.0.2"/>
        <file category="source" name="Sample/Driver/Source/Sample_ADC_Conversion.c" attr="template" select="ADC conversion Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_ADC_GetVrefVoltage.c" attr="template" select="ADC: Get MCU Vref voltage"/>
        <!-- <file category="source" name="Sample/Driver/Source/Sample_Show_VBUF_3V3.c" attr="template" select="Read VBUF setting when Vdd=3.3V"/> -->
        <!-- APB Driver -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Driver/Source/MG32x02z_APB_DRV.c" version="1.0.0"/>
        <file category="source" name="Sample/Driver/Source/Sample_IR_Transmit.c" attr="template" select="TM00+TM36 PWM mix IR data, output by IR_OUT pin"/>
        <!-- CFG Driver -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Driver/Source/MG32x02z_CFG_DRV.c" version="1.0.1"/>
        <!-- CM0 Driver -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Driver/Source/MG32x02z_CM0_DRV.c" version="1.0.0"/>
        <file category="source" name="Sample/Driver/Source/Sample_SysTick_Init.c" attr="template" select="SysTick initial Template"/>
        <file category="sourceC" name="Sample/Driver/Source/Sample_Retarget.c" attr="template" select="Function (fputc for printf, fgetc for scanf, division)"/>
        <!-- <file category="source" name="Sample/Driver/Source/Sample_MISC_SysTickPrintfInitial.c" attr="template" select="SysTick and printf application Template"/> (20210830 09:55) -->
        <!-- CMP Driver -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Driver/Source/MG32x02z_CMP_DRV.c" version="1.0.1"/>
        <file category="source" name="Sample/Driver/Source/Sample_CMP_Init.c" attr="template" select="Comparator initial Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_CMP_WakeupFromSLEEPMode.c" attr="template" select="Sample code - CMP Wakeup from SLEEP mode"/>
        <file category="source" name="Sample/Driver/Source/Sample_CMP_WakeupFromSTOPMode.c" attr="template" select="Sample code - CMP Wakeup from STOP mode"/>
        <!-- CSC Driver -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Driver/Source/MG32x02z_CSC_DRV.c" version="1.0.3"/>
        <file category="source" name="Sample/Driver/Source/Sample_CSC_XOSC_Init.c" attr="template" select="CSC initial and use XOSC "/>
        <file category="source" name="Sample/Driver/Source/Sample_CSC_EXTCK_Init.c" attr="template" select="CSC initial and use EXTCK"/>
        <file category="source" name="Sample/Driver/Source/Sample_CSC_PLL_Init.c" attr="template" select="CSC use PLL sample code"/>
        <!-- DAC Driver
    <file category="sourceC" name="Device/MG32x02z/MG32F02A_Driver/Source/MG32x02z_DAC_DRV.c"  version="1.0.1"/>
    <file category="source" name="Sample/Driver/Source/Sample_DAC_Output.c" attr="template" select="DAC Output code Template"/>
     -->
        <!-- DMA Driver -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Driver/Source/MG32x02z_DMA_DRV.c" version="1.0.0"/>
        <file category="source" name="Sample/Driver/Source/Sample_DMA_M2M.c" attr="template" select="DMA memory to memory Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_DMA.c" attr="template" select="DMA M2M/M2P/P2M/P2P Template"/>
        <!-- EMB Driver 
    <file category="sourceC" name="Device/MG32x02z/MG32F02A_Driver/Source/MG32x02z_EMB_DRV.c"  version="1.0.0"/>
    -->
        <!-- EXIC Driver -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Driver/Source/MG32x02z_EXIC_DRV.c" version="1.0.0"/>
        <file category="source" name="Sample/Driver/Source/Sample_EXIC_Init.c" attr="template" select="EXIC initial Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_IR_Receive.c" attr="template" select="EXIC0 and TM10 to receive IR data"/>
        <!-- GPIO Driver -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Driver/Source/MG32x02z_GPIO_DRV.c" version="1.0.0"/>
        <file category="source" name="Sample/Driver/Source/Sample_GPIO_Init.c" attr="template" select="GPIO initial Template"/>
        <!-- GPL Driver -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Driver/Source/MG32x02z_GPL_DRV.c" version="1.0.0"/>
        <file category="source" name="Sample/Driver/Source/Sample_GPL_CRC.c" attr="template" select="GPL's CRC initial Template"/>
        <!-- I2C Driver -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Driver/Source/MG32x02z_I2C_DRV.c" version="1.0.1"/>
        <file category="source" name="Sample/Driver/Source/Sample_I2C_ByteMode.c" attr="template" select="I2C ByteMode Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_I2C_ByteMode_Simple.c" attr="template" select="I2C ByteMode pooling"/>
        <file category="source" name="Sample/Driver/Source/Sample_I2C_withDMA.c" attr="template" select="I2C+DMA pooling"/>
        <file category="source" name="Sample/Driver/Source/Sample_I2C_Filter.c" attr="template" select="Enable GPIO Filter."/>
        <file category="source" name="Sample/Driver/Source/Sample_I2C_ColorSensor_TCS34725.c" attr="template" select="Application TCS34725 Component."/>
        <!-- IWDT Driver -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Driver/Source/MG32x02z_IWDT_DRV.c" version="1.0.0"/>
        <file category="source" name="Sample/Driver/Source/Sample_IWDT_Init.c" attr="template" select="IWDT initial Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_IWDT_GeneralTimer.c" attr="template" select="IWDT general timer (window event INT)"/>
        <!-- MEM Driver -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Driver/Source/MG32x02z_MEM_DRV.c" version="1.0.0"/>
        <file category="source" name="Sample/Driver/Source/Sample_MEM_FlashAccess.c" attr="template" select="MEM Flash Access Template"/>
        <!-- PW Driver -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Driver/Source/MG32x02z_PW_DRV.c" version="1.0.0"/>
        <file category="source" name="Sample/Driver/Source/Sample_PW_BODx.c" attr="template" select="BODx+Interrupt in ON/SLEEP mode"/>
        <!-- RST Driver -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Driver/Source/MG32x02z_RST_DRV.c" version="1.0.0"/>
        <file category="source" name="Sample/Driver/Source/Sample_RST_TriggerReset.c" attr="template" select="triggert cold reset or warm reset"/>
        <file category="source" name="Sample/Driver/Source/Sample_RST_DetectResetEvent.c" attr="template" select="check reset flags"/>
        <!-- RTC Driver -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Driver/Source/MG32x02z_RTC_DRV.c" version="1.0.1"/>
        <file category="source" name="Sample/Driver/Source/Sample_RTC_Init.c" attr="template" select="RTC initial Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_RTC_PerpetualCalendar.c" attr="template" select="RTC PerpetualCalendar Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_RTC_GeneralTimer.c" attr="template" select="RTC general timer (overflow event INT)"/>
        <!-- SPI Driver -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Driver/Source/MG32x02z_SPI_DRV.c" version="1.0.2"/>
        <file category="source" name="Sample/Driver/Source/Sample_SPI_Flash.c" attr="template" select="SPI access flash IC"/>
        <file category="source" name="Sample/Driver/Source/Sample_SPI_Master_StandardSPI.c" attr="template" select="SPI Master (Standard mode) Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_SPI_Master_StandardSPI_DMA_M2P.c" attr="template" select="SPI Master (Master Standard+DMA M2P) Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_SPI_Master_StandardSPI_DMA_P2M.c" attr="template" select="SPI Master (Master Standard+DMA P2M) Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_SPI_Master_StandardSPI_IT_Receive.c" attr="template" select="SPI Master (Master Standard+IT P2M) Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_SPI_Slave_StandardSPI.c" attr="template" select="SPI slave (Standard mode) Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_SPI_Slave_StandardSPI_DMA_M2P.c" attr="template" select="SPI Slave (Slave Standard+DMA M2P) Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_SPI_Slave_StandardSPI_DMA_P2M.c" attr="template" select="SPI Slave (Slave Standard+DMA P2M) Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_SPI_Master_QPI.c" attr="template" select="(Master mode) SPI 4-line Data Bus"/>
        <file category="source" name="Sample/Driver/Source/Sample_SPI_Master_DPI.c" attr="template" select="(Master mode) SPI 2-line Data  Bus"/>
        <file category="source" name="Sample/Driver/Source/Sample_SPI_TemperatureDetector.c" attr="template" select="RTD sample code for driver"/>
        <file category="source" name="Sample/Driver/Source/Sample_SPI_Master_OPI_PSRAM.c" attr="template" select="OPI PSRAM access"/>
        <!-- SYS Driver -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Driver/Source/MG32x02z_SYS_DRV.c" version="1.0.0"/>
        <!-- TM Driver -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Driver/Source/MG32x02z_TM_DRV.c" version="1.0.0"/>
        <file category="source" name="Sample/Driver/Source/Sample_TM00_Delay.c" attr="template" select="TM00 delay 1ms@12MHz Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_TM01_TRGO_UEV.c" attr="template" select="TM01 output plus to another peripheral Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_TM10_ClockOut.c" attr="template" select="TM10 output 50% clock Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_TM16_AutoStop.c" attr="template" select="TM16 output n clocks Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_TM20_Capture.c" attr="template" select="TM20 capture Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_TM26_OC.c" attr="template" select="TM26 compare output Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_TM36_PWM.c" attr="template" select="TM36 PWM initial Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_TM36_IC3_DMA.c" attr="template" select="TM36 IC3 initial Template with DMA access"/>
        <!-- URT APB Driver -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Driver/Source/MG32x02z_URT_DRV.c" version="1.0.3"/>
        <file category="source" name="Sample/Driver/Source/Sample_URT0_UART_DMA.c" attr="template" select="UAR0 with DMA (P2M) Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_URT0_UART_Init.c" attr="template" select="UAR0 stardard initial Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_URT0_SPIMasterMode_TxRx.c" attr="template" select="UART0 initial to SPI master mode"/>
        <file category="source" name="Sample/Driver/Source/Sample_URT1_UART_Init.c" attr="template" select="UAR1 stardard initial Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_URT2_UART_Init.c" attr="template" select="UAR2 stardard initial Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_URT3_UART_Init.c" attr="template" select="UAR3 stardard initial Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_URT0_SPIFlash.c" attr="template" select="URT access flash IC"/>
        <file category="source" name="Sample/Driver/Source/Sample_URT0_RXIdleReload_IT.c" attr="template" select="RX idle reload function"/>
        <!-- WWDT Driver -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Driver/Source/MG32x02z_WWDT_DRV.c" version="1.0.0"/>
        <file category="source" name="Sample/Driver/Source/Sample_WWDT_Init.c" attr="template" select="WWDT initial Template"/>
        <file category="source" name="Sample/Driver/Source/Sample_WWDT_GeneralTimer.c" attr="template" select="WWDT general timer (warning event INT)"/>
      </files>
    </component>
