XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
    <!-- for MG32F02A032 Middleware -->
    <component Cclass="Middleware" Cgroup="Middleware-All" Cversion="1.0.0" condition="DNAME_Middleware_032">
      <description>Select MG32x02z middleware for project</description>
      <RTE_Components_h>
        #define IRQHandler_Middleware_Level_
      </RTE_Components_h>
      <files>
        <file category="include" name="Device/MG32x02z/MG32F02A_Middleware/Include/" version="1.0.1"/>
        <!-- <file category="include" name="Sample/Middleware/Include/" version="1.0.1" /> (2021.9.3 No any files in this folder) -->
        <!-- Common Middleware -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Middleware/Source/MG32x02z_Common_MID.c" version="1.0.0"/>
        <!-- ADC Middleware -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Middleware/Source/MG32x02z_ADC_MID.c" version="1.0.1"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_ADC_Sum_SetupExample.c" attr="template" select="ADC+Window detect+Sum"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_ADC_GetVrefVoltage.c" attr="template" select="ADC: Get MCU Vref voltage"/>
        <!-- APB Middleware -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Middleware/Source/MG32x02z_APB_MID.c" version="1.0.0"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_APB_OBMx_SetupExample.c" attr="template" select="APB initial"/>
        <!-- CFG Driver 
    <file category="sourceC" name="Device/MG32x02z/MG32F02A_Middleware/Source/MG32x02z_CFG_MID.c"  version="1.0.0"/>
    -->
        <!-- CM0 Middleware -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Middleware/Source/MG32x02z_cortex_MID.c" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Middleware/Source/MG32x02z_Common_MID.c" version="1.0.0"/>
        <!-- CMP Middleware -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Middleware/Source/MG32x02z_CMP_MID.c" version="1.0.0"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_CMP_SetupExample.c" attr="template" select="CMP initial"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_CMP_WakeupFromSLEEPMode.c" attr="template" select="Sample code - CMP Wakeup from SLEEP mode"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_CMP_WakeupFromSTOPMode.c" attr="template" select="Sample code - CMP Wakeup from STOP mode"/>
        <!-- CSC Middleware -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Middleware/Source/MG32x02z_CSC_MID.c" version="1.0.1"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_CSC.c" attr="template" select="CSC use interrupt"/>
        <!-- DMA Middleware -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Middleware/Source/MG32x02z_DMA_MID.c" version="1.0.0"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_DMA_M2M.c" attr="template" select="DMA initial"/>
        <!-- EXIC Middleware -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Middleware/Source/MG32x02z_EXIC_MID.c" version="1.0.1"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_EXIC_Init.c" attr="template" select="Initial PA0~3 with INT condition"/>
        <!-- GPIO Middleware -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Middleware/Source/MG32x02z_GPIO_MID.c" version="1.0.0"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_GPIO_Init.c" attr="template" select="Initial GPIO and read/write GPIO"/>
        <!-- GPL Middleware -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Middleware/Source/MG32x02z_GPL_MID.c" version="1.0.0"/>
        <!-- I2C Middleware -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Middleware/Source/MG32x02z_I2C_MID.c" version="1.0.1"/>
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Middleware/Source/MG32x02z_I2C_MID_ex.c" version="1.0.0"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_I2C.c" attr="template" select="I2C Master and Slsve Transfer / Memory Access"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_I2C_Master.c" attr="template" select="I2C Master Transfer "/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_I2C_MEM.c" attr="template" select="I2C Memory Access (EEPROM 24C-Series)"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_I2C_Slave.c" attr="template" select="I2C Slave mode"/>
        <!-- IWDT Middleware -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Middleware/Source/MG32x02z_IWDT_MID.c" version="1.0.0"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_IWDT_Period.c" attr="template" select="Enable IWDT (IT), then period time into interrupt"/>
        <!-- MEM Middleware -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Middleware/Source/MG32x02z_MEM_MID.c" version="1.0.0"/>
        <!-- PW Middleware -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Middleware/Source/MG32x02z_PW_MID.c" version="1.0.0"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_PW.c" attr="template" select="PW use interrupt"/>
        <!-- RST Driver 
    <file category="sourceC" name="Device/MG32x02z/MG32F02A_Middleware/Source/MG32x02z_RST_MID.c"  version="1.0.0"/>
    -->
        <file category="source" name="Sample/Middleware/Source/Sample_MID_RST.c" attr="template" select="RST check reset flag ans configure reset"/>
        <!-- RTC Middleware -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Middleware/Source/MG32x02z_RTC_MID.c" version="1.0.0"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_RTC_PerpetualCalendar.c" attr="template" select="RTC perpetual calendar and print calendar date"/>
        <!-- SPI Middleware -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Middleware/Source/MG32x02z_SPI_MID.c" version="1.0.4"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_SPI_Master_TXRX_DMA.c" attr="template" select="SPIx/URTx(USPIx) master transmit and receive use DMA"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_SPI_Master_TXRX.c" attr="template" select="SPIx/URTx(USPIx) master transmit and receive"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_SPI_Master_TXRX_IT.c" attr="template" select="SPIx/URTx(USPIx) master transmit and receive use interrupt"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_SPI_Slave_TXRX.c" attr="template" select="SPIx/URTx(USPIx) slave transmit and receive"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_SPI_Slave_TXRX_IT.c" attr="template" select="SPIx/URTx(USPIx) slave transmit and receive use interrupt"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_SPI_TemperatureDetector.c" attr="template" select="RTD sample code for middleware"/>
        <!-- SYS Middleware -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Middleware/Source/MG32x02z_SYS_MID.c" version="1.0.0"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_SYS_GetChipID.c" attr="template" select="SYS get chip body"/>
        <!-- TM Middleware -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Middleware/Source/MG32x02z_TM_MID.c" version="1.0.0"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_TM00_Period.c" attr="template" select="TM00 period output"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_TM20_8bitx2_OC.c" attr="template" select="TM20 8bitx2 Output compare"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_TM20_OC.c" attr="template" select="TM20 Output compare"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_TM26_PWM.c" attr="template" select="TM26 PWM initial"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_TM26_QEI.c" attr="template" select="TM26 QEI initial"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_TM36_8bitx2_PWM_DMA.c" attr="template" select="TM36 8bitx2 PWM with DMA access"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_TM36_8bitx2PWM_DTG_CentralAlign_DMA.c" attr="template" select="TM36 8bitx2 PWM (DTG+DMA)"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_TM36_IC1_Rising2Rising.c" attr="template" select="TM36 IC1 input capture"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_TM36_IC3_DMA.c" attr="template" select="TM36 IC3 DMA"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_TM36_PWM_DMA.c" attr="template" select="TM36 PWM+DMA initial"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_TM36_PWM_DTG_CentralAlign.c" attr="template" select="TM36 PWM+DTG initial with central align"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_TM36_PWM_DTG_CentralAlign_DMA.c" attr="template" select="TM36 PWM+DTG initial with central align with DMA"/>
        <!-- URT APB Middleware -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Middleware/Source/MG32x02z_URT_MID.c" version="1.0.1"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_URT_RX.c" attr="template" select="URTx use blocking mode to receive data"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_URT_RX_DMA.c" attr="template" select="DMA mode to receive data"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_URT_TX.c" attr="template" select="URTx use blocking mode to transfer data"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_URT_TX_DMA.c" attr="template" select="DMA mode to transfer data"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_URT_RXTX.c" attr="template" select="URTx use blocking mode to receive and transfer data"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_URT_RXTX_DMA.c" attr="template" select="DMA mode to receive and transfer data"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_URT_RX_IT.c" attr="template" select="URTx use interrupt mode to receive data"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_URT_TX_IT.c" attr="template" select="URTx use interrupt mode to transfer data"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_URT_RXTX_IT.c" attr="template" select="URTx use interrupt mode to receive and transfer data"/>
        <!-- WWDT Middleware -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02A_Middleware/Source/MG32x02z_WWDT_MID.c" version="1.0.0"/>
        <file category="source" name="Sample/Middleware/Source/Sample_MID_WWDT_Period.c" attr="template" select="Enable WWDT(IT) then period time into interrupt"/>
      </files>
    </component>
