XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
    <!-- ********************************************************************************** -->
    <!-- ********************************************************************************** -->
    <!-- ********************************************************************************** -->
    <!-- ********************************************************************************** -->
    <!-- SVC priority selection -->
    <component Cclass="IRQ_Handler" Cgroup="11. SVC priority" Cvariant="Level-0 (High)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Config SVC IRQ priority</description>
      <RTE_Components_h>
        #define MG32x02z_SVC_IRQ_
        #define MG32x02z_SVC_IRQ_Priority0
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="11. SVC priority" Cvariant="Level-1" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Config SVC IRQ priority</description>
      <RTE_Components_h>
        #define MG32x02z_SVC_IRQ_
        #define MG32x02z_SVC_IRQ_Priority1
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
      <component Cclass="IRQ_Handler" Cgroup="11. SVC priority" Cvariant="Level-2" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Config SVC IRQ priority</description>
      <RTE_Components_h>
        #define MG32x02z_SVC_IRQ_
        #define MG32x02z_SVC_IRQ_Priority2
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
      <component Cclass="IRQ_Handler" Cgroup="11. SVC priority" Cvariant="Level-3 (Low)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Config SVC IRQ priority</description>
      <RTE_Components_h>
        #define MG32x02z_SVC_IRQ_
        #define MG32x02z_SVC_IRQ_Priority3
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- ********************************************************************************** -->
    <!-- PendSV priority selection -->
    <component Cclass="IRQ_Handler" Cgroup="14. PendSV priority" Cvariant="Level-0 (High)" Cversion="1.0.0" custom="true" condition="MG32x02z_MCU">
      <description>Config PendSV IRQ priority</description>
      <RTE_Components_h>
        #define MG32x02z_PENDSV_IRQ_
        #define MG32x02z_PENDSV_IRQ_Priority0
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="14. PendSV priority" Cvariant="Level-1" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Config PendSV IRQ priority</description>
      <RTE_Components_h>
        #define MG32x02z_PENDSV_IRQ_
        #define MG32x02z_PENDSV_IRQ_Priority1
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
      <component Cclass="IRQ_Handler" Cgroup="14. PendSV priority" Cvariant="Level-2" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Config PendSV IRQ priority</description>
      <RTE_Components_h>
        #define MG32x02z_PENDSV_IRQ_
        #define MG32x02z_PENDSV_IRQ_Priority2
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
      <component Cclass="IRQ_Handler" Cgroup="14. PendSV priority" Cvariant="Level-3 (Low)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Config PendSV IRQ priority</description>
      <RTE_Components_h>
        #define MG32x02z_PENDSV_IRQ_
        #define MG32x02z_PENDSV_IRQ_Priority3
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- ********************************************************************************** -->
    <!-- SysTick callback selection -->
    <component Cclass="IRQ_Handler" Cgroup="15. SysTick priority" Cvariant="Level-0 (High)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Config SysTick IRQ priority</description>
      <RTE_Components_h>
        #define MG32x02z_SYSTICK_IRQ_
        #define MG32x02z_SYSTICK_IRQ_Priority0
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="15. SysTick priority" Cvariant="Level-1" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Config SysTick IRQ priority</description>
      <RTE_Components_h>
        #define MG32x02z_SYSTICK_IRQ_
        #define MG32x02z_SYSTICK_IRQ_Priority1
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
      <component Cclass="IRQ_Handler" Cgroup="15. SysTick priority" Cvariant="Level-2" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Config SysTick IRQ priority</description>
      <RTE_Components_h>
        #define MG32x02z_SYSTICK_IRQ_
        #define MG32x02z_SYSTICK_IRQ_Priority2
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
      <component Cclass="IRQ_Handler" Cgroup="15. SysTick priority" Cvariant="Level-3 (Low)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Config SysTick IRQ priority</description>
      <RTE_Components_h>
        #define MG32x02z_SYSTICK_IRQ_
        #define MG32x02z_SYSTICK_IRQ_Priority3
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- ********************************************************************************** -->
    <!-- WWDT IRQ handler & NVIC controller -->
    <component Cclass="IRQ_Handler" Cgroup="16. Enable WWDT NVIC" Cvariant="Level-0 (High)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Window Watchdog interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_WWDT_IRQ_
        #define MG32x02z_WWDT_IRQ_Priority0
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="16. Enable WWDT NVIC" Cvariant="Level-1" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Window Watchdog interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_WWDT_IRQ_
        #define MG32x02z_WWDT_IRQ_Priority1
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="16. Enable WWDT NVIC" Cvariant="Level-2" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Window Watchdog interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_WWDT_IRQ_
        #define MG32x02z_WWDT_IRQ_Priority2
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="16. Enable WWDT NVIC" Cvariant="Level-3 (Low)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Window Watchdog interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_WWDT_IRQ_
        #define MG32x02z_WWDT_IRQ_Priority3
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- ********************************************************************************** -->
    <!-- SYS IRQ handler & NVIC controller (MG32F02V032) -->
    <!-- ******************************************* -->
    <!--  *** SYS's Priority with Level-0 (High) *** -->
    <component Cclass="IRQ_Handler" Cgroup="17. Enable SYS NVIC" Cvariant="Level-0 (High)" Cversion="1.0.0" isDefaultVariant="true" condition="SYS_IRQ_MG32_ALL">
      <description>System global Interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_SYS_IRQ_
        #define MG32x02z_SYS_IRQ_Priority0
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    
    <!-- ******************************************* -->
    <!--  *** SYS's Priority with Level-1 *** -->
    <component Cclass="IRQ_Handler" Cgroup="17. Enable SYS NVIC" Cvariant="Level-1" Cversion="1.0.0" condition="SYS_IRQ_MG32_ALL">
      <description>System global Interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_SYS_IRQ_
        #define MG32x02z_SYS_IRQ_Priority1
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    
    <!-- ******************************************* -->
    <!--  *** SYS's Priority with Level-2 *** -->
    <component Cclass="IRQ_Handler" Cgroup="17. Enable SYS NVIC" Cvariant="Level-2" Cversion="1.0.0" condition="SYS_IRQ_MG32_ALL">
      <description>System global Interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_SYS_IRQ_
        #define MG32x02z_SYS_IRQ_Priority2
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    
    <!-- ******************************************* -->
    <!--  *** SYS's Priority with Level-3 (Low) *** -->
    <component Cclass="IRQ_Handler" Cgroup="17. Enable SYS NVIC" Cvariant="Level-3 (Low)" Cversion="1.0.0" condition="SYS_IRQ_MG32_ALL">
      <description>System global Interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_SYS_IRQ_
        #define MG32x02z_SYS_IRQ_Priority3
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    
    <!-- ********************************************************************************** -->
    <!-- EXINT0 IRQ handler & NVIC controller -->
    <component Cclass="IRQ_Handler" Cgroup="19. Enable EXINT0 NVIC" Cvariant="Level-0 (High)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>EXIC EXINT0 (PA) interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_EXINT0_IRQ_
        #define MG32x02z_EXINT0_IRQ_Priority0
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
