XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
    <component Cclass="IRQ_Handler" Cgroup="21. Enable EXINT2 NVIC" Cvariant="Level-2" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>EXIC EXINT2 (PC) interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_EXINT2_IRQ_
        #define MG32x02z_EXINT2_IRQ_Priority2
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="21. Enable EXINT2 NVIC" Cvariant="Level-3 (Low)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>EXIC EXINT2 (PC) interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_EXINT2_IRQ_
        #define MG32x02z_EXINT2_IRQ_Priority3
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- ********************************************************************************** -->
    <!-- EXINT3 IRQ handler & NVIC controller -->
    <component Cclass="IRQ_Handler" Cgroup="22. Enable EXINT3 NVIC" Cvariant="Level-0 (High)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>EXIC EXINT3/4 (PD/PE) interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_EXINT3_IRQ_
        #define MG32x02z_EXINT3_IRQ_Priority0
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="22. Enable EXINT3 NVIC" Cvariant="Level-1" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>EXIC EXINT3/4 (PD/PE) interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_EXINT3_IRQ_
        #define MG32x02z_EXINT3_IRQ_Priority1
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="22. Enable EXINT3 NVIC" Cvariant="Level-2" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>EXIC EXINT3/4 (PD/PE) interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_EXINT3_IRQ_
        #define MG32x02z_EXINT3_IRQ_Priority2
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="22. Enable EXINT3 NVIC" Cvariant="Level-3 (Low)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>EXIC EXINT3/4 (PD/PE) interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_EXINT3_IRQ_
        #define MG32x02z_EXINT3_IRQ_Priority3
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- ********************************************************************************** -->
    <!-- CMP IRQ handler & NVIC controller -->
    <component Cclass="IRQ_Handler" Cgroup="23. Enable COMP NVIC" Cvariant="Level-0 (High)" Cversion="1.0.0" condition="COMP_IRQ_MG32_1ST_2ND_3RD">
      <description>Analog Comparators global Interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_COMP_IRQ_
        #define MG32x02z_COMP_IRQ_Priority0
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="23. Enable COMP NVIC" Cvariant="Level-1" Cversion="1.0.0" condition="COMP_IRQ_MG32_1ST_2ND_3RD">
      <description>Analog Comparators global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_COMP_IRQ_
        #define MG32x02z_COMP_IRQ_Priority1
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="23. Enable COMP NVIC" Cvariant="Level-2" Cversion="1.0.0" condition="COMP_IRQ_MG32_1ST_2ND_3RD">
      <description>Analog Comparators global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_COMP_IRQ_
        #define MG32x02z_COMP_IRQ_Priority2
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="23. Enable COMP NVIC" Cvariant="Level-3 (Low)" Cversion="1.0.0" condition="COMP_IRQ_MG32_1ST_2ND_3RD">
      <description>Analog Comparators global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_COMP_IRQ_
        #define MG32x02z_COMP_IRQ_Priority3
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- ********************************************************************************** -->
    <!-- DMA IRQ handler & NVIC controller -->
    <component Cclass="IRQ_Handler" Cgroup="24. Enable DMA NVIC" Cvariant="Level-0 (High)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>DMA all channel global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_DMA_IRQ_
        #define MG32x02z_DMA_IRQ_Priority0
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="24. Enable DMA NVIC" Cvariant="Level-1" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>DMA all channel global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_DMA_IRQ_
        #define MG32x02z_DMA_IRQ_Priority1
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
