XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
    <component Cclass="IRQ_Handler" Cgroup="24. Enable DMA NVIC" Cvariant="Level-2" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>DMA all channel global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_DMA_IRQ_
        #define MG32x02z_DMA_IRQ_Priority2
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="24. Enable DMA NVIC" Cvariant="Level-3 (Low)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>DMA all channel global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_DMA_IRQ_
        #define MG32x02z_DMA_IRQ_Priority3
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- ********************************************************************************** -->
    <!-- ADC IRQ handler & NVIC controller -->
    <component Cclass="IRQ_Handler" Cgroup="26. Enable ADC NVIC" Cvariant="Level-0 (High)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>ADC global Interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_ADC_IRQ_
        #define MG32x02z_ADC_IRQ_Priority0
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="26. Enable ADC NVIC" Cvariant="Level-1" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>ADC global Interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_ADC_IRQ_
        #define MG32x02z_ADC_IRQ_Priority1
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="26. Enable ADC NVIC" Cvariant="Level-2" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>ADC global Interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_ADC_IRQ_
        #define MG32x02z_ADC_IRQ_Priority2
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="26. Enable ADC NVIC" Cvariant="Level-3 (Low)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>ADC global Interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_ADC_IRQ_
        #define MG32x02z_ADC_IRQ_Priority3
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- ********************************************************************************** -->
    <!-- DAC IRQ handler & NVIC controller -->
    <component Cclass="IRQ_Handler" Cgroup="27. Enable DAC NVIC" Cvariant="Level-0 (High)" Cversion="1.0.0" condition="DAC_IRQ_MG32_1ST_3RD">
      <description>DAC global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_DAC_IRQ_
        #define MG32x02z_DAC_IRQ_Priority0
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="27. Enable DAC NVIC" Cvariant="Level-1" Cversion="1.0.0" condition="DAC_IRQ_MG32_1ST_3RD">
      <description>DAC global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_DAC_IRQ_
        #define MG32x02z_DAC_IRQ_Priority1
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="27. Enable DAC NVIC" Cvariant="Level-2" Cversion="1.0.0" condition="DAC_IRQ_MG32_1ST_3RD">
      <description>DAC global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_DAC_IRQ_
        #define MG32x02z_DAC_IRQ_Priority2
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="27. Enable DAC NVIC" Cvariant="Level-3" Cversion="1.0.0" condition="DAC_IRQ_MG32_1ST_3RD">
      <description>DAC global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_DAC_IRQ_
        #define MG32x02z_DAC_IRQ_Priority3
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- ********************************************************************************** -->    
    <!-- ******************************************* -->
    <!--  *** TM0x's Priority with Level-0 (High) *** -->
    <component Cclass="IRQ_Handler" Cgroup="28. Enable TM0x NVIC" Cvariant="Level-0 (High)" Cversion="1.0.0" isDefaultVariant="true" condition="MG32x02z_MCU">
      <description>Timer TM0x global Interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_TM0x_IRQ_
        #define MG32x02z_TM0x_IRQ_Priority0
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    
    <!--  *** TM0x's Priority with Level-1 *** -->
    <component Cclass="IRQ_Handler" Cgroup="28. Enable TM0x NVIC" Cvariant="Level-1" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Timer TM0x global Interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_TM0x_IRQ_
        #define MG32x02z_TM0x_IRQ_Priority1
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    
    <!--  *** TM0x's Priority with Level-2 *** -->
    <component Cclass="IRQ_Handler" Cgroup="28. Enable TM0x NVIC" Cvariant="Level-2" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Timer TM0x global Interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_TM0x_IRQ_
        #define MG32x02z_TM0x_IRQ_Priority2
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
     
    <!--  *** TM0x's Priority with Level-3 (Low) *** -->
    <component Cclass="IRQ_Handler" Cgroup="28. Enable TM0x NVIC" Cvariant="Level-3 (Low)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Timer TM0x global Interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_TM0x_IRQ_
        #define MG32x02z_TM0x_IRQ_Priority3
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- ********************************************************************************** -->
    <!-- TM10 IRQ handler & NVIC controller -->
    <component Cclass="IRQ_Handler" Cgroup="29. Enable TM10 NVIC" Cvariant="Level-0 (High)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Timer TM10 interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_TM10_IRQ_
        #define MG32x02z_TM10_IRQ_Priority0
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
