XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
    <component Cclass="IRQ_Handler" Cgroup="29. Enable TM10 NVIC" Cvariant="Level-1" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Timer TM10 interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_TM10_IRQ_
        #define MG32x02z_TM10_IRQ_Priority1
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="29. Enable TM10 NVIC" Cvariant="Level-2" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Timer TM10 interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_TM10_IRQ_
        #define MG32x02z_TM10_IRQ_Priority2
        #define MG32x02z_IRQ_Handler_
    </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="29. Enable TM10 NVIC" Cvariant="Level-3 (Low)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Timer TM10 interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_TM10_IRQ_
        #define MG32x02z_TM10_IRQ_Priority3
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- ********************************************************************************** -->
    <!-- TM1x IRQ handler & NVIC controller -->
    <component Cclass="IRQ_Handler" Cgroup="30. Enable TM1x NVIC" Cvariant="Level-0 (High)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Timer TM1x global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_TM1x_IRQ_
        #define MG32x02z_TM1x_IRQ_Priority0
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="30. Enable TM1x NVIC" Cvariant="Level-1" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Timer TM1x global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_TM1x_IRQ_
        #define MG32x02z_TM1x_IRQ_Priority1
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="30. Enable TM1x NVIC" Cvariant="Level-2" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Timer TM1x global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_TM1x_IRQ_
        #define MG32x02z_TM1x_IRQ_Priority2
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="30. Enable TM1x NVIC" Cvariant="Level-3 (Low)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Timer TM1x global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_TM1x_IRQ_
        #define MG32x02z_TM1x_IRQ_Priority3
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- ********************************************************************************** -->
    <!-- TM20 IRQ handler & NVIC controller -->
    <component Cclass="IRQ_Handler" Cgroup="31. Enable TM20 NVIC" Cvariant="Level-0 (High)" Cversion="1.0.0" condition="TM20_IRQ_MG32_1ST_3RD_4TH">
      <description>Timer TM20 interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_TM20_IRQ_
        #define MG32x02z_TM20_IRQ_Priority0
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="31. Enable TM20 NVIC" Cvariant="Level-1" Cversion="1.0.0" condition="TM20_IRQ_MG32_1ST_3RD_4TH">
      <description>Timer TM20 interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_TM20_IRQ_
        #define MG32x02z_TM20_IRQ_Priority1
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="31. Enable TM20 NVIC" Cvariant="Level-2" Cversion="1.0.0" condition="TM20_IRQ_MG32_1ST_3RD_4TH">
      <description>Timer TM20 interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_TM20_IRQ_
        #define MG32x02z_TM20_IRQ_Priority2
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="31. Enable TM20 NVIC" Cvariant="Level-3 (Low)" Cversion="1.0.0" condition="TM20_IRQ_MG32_1ST_3RD_4TH">
      <description>Timer TM20 interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_TM20_IRQ_
        #define MG32x02z_TM20_IRQ_Priority3
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- ********************************************************************************** -->
    <!-- TM2x IRQ handler & NVIC controller -->
    <component Cclass="IRQ_Handler" Cgroup="32. Enable TM2x NVIC" Cvariant="Level-0 (High)" Cversion="1.0.0" condition="TM2x_IRQ_MG32_1ST_3RD">
      <description>Timer TM2x global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_TM2x_IRQ_
        #define MG32x02z_TM2x_IRQ_Priority0
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
