XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
    <component Cclass="IRQ_Handler" Cgroup="32. Enable TM2x NVIC" Cvariant="Level-1" Cversion="1.0.0" condition="TM2x_IRQ_MG32_1ST_3RD">
      <description>Timer TM2x global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_TM2x_IRQ_
        #define MG32x02z_TM2x_IRQ_Priority1
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="32. Enable TM2x NVIC" Cvariant="Level-2" Cversion="1.0.0" condition="TM2x_IRQ_MG32_1ST_3RD">
      <description>Timer TM2x global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_TM2x_IRQ_
        #define MG32x02z_TM2x_IRQ_Priority2
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="32. Enable TM2x NVIC" Cvariant="Level-3 (Low)" Cversion="1.0.0" condition="TM2x_IRQ_MG32_1ST_3RD">
      <description>Timer TM2x global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_TM2x_IRQ_
        #define MG32x02z_TM2x_IRQ_Priority3
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- ********************************************************************************** -->
    <!-- TM3x IRQ handler & NVIC controller -->
    <component Cclass="IRQ_Handler" Cgroup="33. Enable TM3x NVIC" Cvariant="Level-0 (High)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Timer TM3x global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_TM3x_IRQ_
        #define MG32x02z_TM3x_IRQ_Priority0
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="33. Enable TM3x NVIC" Cvariant="Level-1" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Timer TM3x global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_TM3x_IRQ_
        #define MG32x02z_TM3x_IRQ_Priority1
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="33. Enable TM3x NVIC" Cvariant="Level-2" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Timer TM3x global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_TM3x_IRQ_
        #define MG32x02z_TM3x_IRQ_Priority2
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="33. Enable TM3x NVIC" Cvariant="Level-3 (Low)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>Timer TM3x global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_TM3x_IRQ_
        #define MG32x02z_TM3x_IRQ_Priority3
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- ********************************************************************************** -->
    <!-- URT0 IRQ handler & NVIC controller -->
    <component Cclass="IRQ_Handler" Cgroup="36. Enable URT0 NVIC" Cvariant="Level-0 (High)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>UART URT0 interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_URT0_IRQ_
        #define MG32x02z_URT0_IRQ_Priority0
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="36. Enable URT0 NVIC" Cvariant="Level-1" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>UART URT0 interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_URT0_IRQ_
        #define MG32x02z_URT0_IRQ_Priority1
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
