XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
    <component Cclass="IRQ_Handler" Cgroup="36. Enable URT0 NVIC" Cvariant="Level-2" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>UART URT0 interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_URT0_IRQ_
        #define MG32x02z_URT0_IRQ_Priority2
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="36. Enable URT0 NVIC" Cvariant="Level-3 (Low)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>UART URT0 interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_URT0_IRQ_
        #define MG32x02z_URT0_IRQ_Priority3
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- ********************************************************************************** -->
    <!-- URT123 IRQ handler & NVIC controller -->
    <!-- ********************************************************************************** -->
    <!-- ******************************************* -->
    <!-- URT123 IRQ handler & NVIC controller (MG32_2ND, MG32_4TH) -->
    <!--  *** URT123's Priority with Level-0 (High) *** -->
    <component Cclass="IRQ_Handler" Cgroup="37. Enable URT123 NVIC" Cvariant="Level-0 (High)" Cversion="1.0.0" isDefaultVariant="true" condition="URT123_IRQ_MG32_ALL">
      <description>UART URT1/2/3 interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_URT123_IRQ_
        #define MG32x02z_URT123_IRQ_Priority0
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    
    <!--  *** URT123's Priority with Level-1 *** -->
    <component Cclass="IRQ_Handler" Cgroup="37. Enable URT123 NVIC" Cvariant="Level-1" Cversion="1.0.0" condition="URT123_IRQ_MG32_ALL">
      <description>UART URT1/2/3 interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_URT123_IRQ_
        #define MG32x02z_URT123_IRQ_Priority1
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>

    <!--  *** URT123's Priority with Level-2 *** -->
    <component Cclass="IRQ_Handler" Cgroup="37. Enable URT123 NVIC" Cvariant="Level-2" Cversion="1.0.0" condition="URT123_IRQ_MG32_ALL">
      <description>UART URT1/2/3 interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_URT123_IRQ_
        #define MG32x02z_URT123_IRQ_Priority2
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    
    <!--  *** URT123's Priority with Level-3 (Low) *** -->
    <component Cclass="IRQ_Handler" Cgroup="37. Enable URT123 NVIC" Cvariant="Level-3 (Low)" Cversion="1.0.0" condition="URT123_IRQ_MG32_ALL">
      <description>UART URT1/2/3 interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_URT123_IRQ_
        #define MG32x02z_URT123_IRQ_Priority3
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- ********************************************************************************** -->
    <!-- ******************************************* -->
    <!-- URT4x IRQ handler & NVIC controller (MG32_2ND, MG32_4TH) -->
    <!--  *** URT4x's Priority with Level-0 (High) *** -->
    <component Cclass="IRQ_Handler" Cgroup="38. Enable URT4x NVIC" Cvariant="Level-0 (High)" Cversion="1.0.0" isDefaultVariant="true" condition="URT4x_IRQ_MG32_3RD_4TH">
      <description>UART URT4/5/6/7.. global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_URT4x_IRQ_
        #define MG32x02z_URT4x_IRQ_Priority0
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    
    <!--  *** URT4x's Priority with Level-1 *** -->
    <component Cclass="IRQ_Handler" Cgroup="38. Enable URT4x NVIC" Cvariant="Level-1" Cversion="1.0.0" condition="URT4x_IRQ_MG32_3RD_4TH">
      <description>UART URT4/5/6/7.. global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_URT4x_IRQ_
        #define MG32x02z_URT4x_IRQ_Priority1
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>

    <!--  *** URT4x's Priority with Level-2 *** -->
    <component Cclass="IRQ_Handler" Cgroup="38. Enable URT4x NVIC" Cvariant="Level-2" Cversion="1.0.0" condition="URT4x_IRQ_MG32_3RD_4TH">
      <description>UART URT4/5/6/7.. global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_URT4x_IRQ_
        #define MG32x02z_URT4x_IRQ_Priority2
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    
    <!--  *** URT4x's Priority with Level-3 (Low) *** -->
    <component Cclass="IRQ_Handler" Cgroup="38. Enable URT4x NVIC" Cvariant="Level-3 (Low)" Cversion="1.0.0" condition="URT4x_IRQ_MG32_3RD_4TH">
      <description>UART URT4/5/6/7.. global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_URT4x_IRQ_
        #define MG32x02z_URT4x_IRQ_Priority3
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- ********************************************************************************** -->
    <!-- SPI0 IRQ handler & NVIC controller -->
    <component Cclass="IRQ_Handler" Cgroup="40. Enable SPI0 NVIC" Cvariant="Level-0 (High)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>SPI0 interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_SPI0_IRQ_
        #define MG32x02z_SPI0_IRQ_Priority0
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="40. Enable SPI0 NVIC" Cvariant="Level-1" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>SPI0 interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_SPI0_IRQ_
        #define MG32x02z_SPI0_IRQ_Priority1
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="40. Enable SPI0 NVIC" Cvariant="Level-2" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>SPI0 interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_SPI0_IRQ_
        #define MG32x02z_SPI0_IRQ_Priority2
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
