XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
    <component Cclass="IRQ_Handler" Cgroup="40. Enable SPI0 NVIC" Cvariant="Level-3 (Low)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>SPI0 interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_SPI0_IRQ_
        #define MG32x02z_SPI0_IRQ_Priority3
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- ********************************************************************************** -->
    <!-- I2C0 IRQ handler & NVIC controller -->
    <component Cclass="IRQ_Handler" Cgroup="44. Enable I2C0 NVIC" Cvariant="Level-0 (High)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>I2C0 interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_I2C0_IRQ_
        #define MG32x02z_I2C0_IRQ_Priority0
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="44. Enable I2C0 NVIC" Cvariant="Level-1" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>I2C0 interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_I2C0_IRQ_
        #define MG32x02z_I2C0_IRQ_Priority1
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="44. Enable I2C0 NVIC" Cvariant="Level-2" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>I2C0 interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_I2C0_IRQ_
        #define MG32x02z_I2C0_IRQ_Priority2
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="44. Enable I2C0 NVIC" Cvariant="Level-3 (Low)" Cversion="1.0.0" condition="MG32x02z_MCU">
      <description>I2C0 interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_I2C0_IRQ_
        #define MG32x02z_I2C0_IRQ_Priority3
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- ********************************************************************************** -->
    <!-- I2Cx IRQ handler & NVIC controller -->
    <component Cclass="IRQ_Handler" Cgroup="45. Enable I2Cx NVIC" Cvariant="Level-0 (High)" Cversion="1.0.0" condition="I2Cx_IRQ_MG32_1ST_3RD_4TH">
      <description>I2Cx global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_I2Cx_IRQ_
        #define MG32x02z_I2Cx_IRQ_Priority0
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="45. Enable I2Cx NVIC" Cvariant="Level-1" Cversion="1.0.0" condition="I2Cx_IRQ_MG32_1ST_3RD_4TH">
      <description>I2Cx global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_I2Cx_IRQ_
        #define MG32x02z_I2Cx_IRQ_Priority1
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="45. Enable I2Cx NVIC" Cvariant="Level-2" Cversion="1.0.0" condition="I2Cx_IRQ_MG32_1ST_3RD_4TH">
      <description>I2Cx global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_I2Cx_IRQ_
        #define MG32x02z_I2Cx_IRQ_Priority2
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="45. Enable I2Cx NVIC" Cvariant="Level-3 (Low)" Cversion="1.0.0" condition="I2Cx_IRQ_MG32_1ST_3RD_4TH">
      <description>I2Cx global interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_I2Cx_IRQ_
        #define MG32x02z_I2Cx_IRQ_Priority3
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- ********************************************************************************** -->
    <!-- USB IRQ handler & NVIC controller -->
    <component Cclass="IRQ_Handler" Cgroup="46. Enable USB NVIC" Cvariant="Level-0 (High)" Cversion="1.0.0" condition="USB_IRQ_MG32_3RD_Uxxx">
      <description>USB interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_USB_IRQ_
        #define MG32x02z_USB_IRQ_Priority0
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="46. Enable USB NVIC" Cvariant="Level-1" Cversion="1.0.0" condition="USB_IRQ_MG32_3RD_Uxxx">
      <description>USB interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_USB_IRQ_
        #define MG32x02z_USB_IRQ_Priority1
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
