XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
    <component Cclass="IRQ_Handler" Cgroup="46. Enable USB NVIC" Cvariant="Level-2" Cversion="1.0.0" condition="USB_IRQ_MG32_3RD_Uxxx">
      <description>USB interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_USB_IRQ_
        #define MG32x02z_USB_IRQ_Priority2
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="46. Enable USB NVIC" Cvariant="Level-3 (Low)" Cversion="1.0.0" condition="USB_IRQ_MG32_3RD_Uxxx">
      <description>USB interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_USB_IRQ_
        #define MG32x02z_USB_IRQ_Priority3
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- ********************************************************************************** -->
    <!-- APX IRQ handler & NVIC controller (for MG32F02A128/U128/A064/U064) -->
    <component Cclass="IRQ_Handler" Cgroup="47. Enable APX NVIC" Cvariant="Level-0 (High)" Cversion="1.0.0" condition="APX_IRQ_MG32_3RD_4TH">
      <description>APX interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_APX_IRQ_
        #define MG32x02z_APX_IRQ_Priority0
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="47. Enable APX NVIC" Cvariant="Level-1" Cversion="1.0.0" condition="APX_IRQ_MG32_3RD_4TH">
      <description>APX interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_APX_IRQ_
        #define MG32x02z_APX_IRQ_Priority1
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="47. Enable APX NVIC" Cvariant="Level-2" Cversion="1.0.0" condition="APX_IRQ_MG32_3RD_4TH">
      <description>APX interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_APX_IRQ_
        #define MG32x02z_APX_IRQ_Priority2
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="IRQ_Handler" Cgroup="47. Enable APX NVIC" Cvariant="Level-3 (Low)" Cversion="1.0.0" condition="APX_IRQ_MG32_3RD_4TH">
      <description>APX interrupt</description>
      <RTE_Components_h>
        #define MG32x02z_APX_IRQ_
        #define MG32x02z_APX_IRQ_Priority3
        #define MG32x02z_IRQ_Handler_
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="Device/MG32x02z/Common/Initial/Source/MG32x02z__IRQHandler.c" attr="config" version="1.0.10"/>
        <file category="header"  name="Device/MG32x02z/Common/Initial/Include/MG32x02z__IRQHandler.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- ********************************************************************************** -->
    <!-- ********************************************************************************** -->
    <!-- ********************************************************************************** -->
    <!-- IEC60730 Support for MG32_1ST -->
    <component Cclass="IEC60730_Support" Cgroup="Run after Reset" Cversion="1.0.1" condition="IEC60730_132">
      <description>Run IEC60730 after Rest</description>
      <RTE_Components_h>
        #define MG32x02z_IEC60730_ALL_
      </RTE_Components_h>
      <files>
        <!-- Common file -->
        <file category="sourceAsm"  name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_RAM_ASM.s" attr="config" version="1.0.1" condition="ARMCC"/>
        <file category="sourceAsm"  name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_CPU_Reg.s" attr="config" version="1.0.0" condition="ARMCC"/>
        <file category="sourceAsm"  name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_CPU_Reg_GCC.S" attr="config" version="1.0.1" condition="GCC"/>
        <file category="sourceAsm"  name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_RAM_ASM_GCC.S" attr="config" version="1.0.1" condition="GCC"/>
        <file category="sourceC"    name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_CPU_PC.c" attr="config" version="1.0.0"/>
        <file category="sourceC"    name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_GPIO.c" attr="config" version="1.0.0"/>
        <file category="sourceC"    name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_Interrupt.c" attr="config" version="1.0.0"/>
        <file category="sourceC"    name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_Manager.c" attr="config" version="1.0.1"/>
        <file category="sourceC"    name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_IWDT.c" attr="config" version="1.0.0"/>
        <file category="header"     name="Device/MG32x02z/Common/IEC60730/Include/MG32x02z_IEC60730_Common.h" attr="config" version="1.0.0"/>
        <!-- independent file -->
        <file category="sourceC"    name="Device/MG32x02z/MG32F02A132/IEC60730/Source/MG32x02z_IEC60730_ADC.c" attr="config" version="1.0.0"/>
        <file category="sourceC"    name="Device/MG32x02z/MG32F02A132/IEC60730/Source/MG32x02z_IEC60730_Flash.c" attr="config" version="1.0.1"/>
        <file category="sourceC"    name="Device/MG32x02z/MG32F02A132/IEC60730/Source/MG32x02z_IEC60730_CSC.c" attr="config" version="1.0.0"/>
        <file category="header"     name="Device/MG32x02z/MG32F02A132/IEC60730/Include/MG32x02z_IEC60730_Manager.h" attr="config" version="1.0.0"/>
        <file category="header"     name="Device/MG32x02z/MG32F02A132/IEC60730/Include/MG32x02z_IEC60730_GPIO.h" attr="config" version="1.0.0"/>
      </files>
    </component>
