XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
    <!-- IEC60730 Support for MG32_2ND -->
    <component Cclass="IEC60730_Support" Cgroup="Run after Reset" Cversion="1.0.0" condition="IEC60730_032">
      <description>Run IEC60730 after Rest</description>
      <RTE_Components_h>
        #define MG32x02z_IEC60730_ALL_
      </RTE_Components_h>
      <files>
        <!-- Common file -->
        <file category="sourceAsm"  name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_CPU_Reg.s" attr="config" version="1.0.0" condition="ARMCC"/>
        <file category="sourceAsm"  name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_RAM_ASM.s" attr="config" version="1.0.1" condition="ARMCC"/>
        <file category="sourceAsm"  name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_CPU_Reg_GCC.S" attr="config" version="1.0.1" condition="GCC"/>
        <file category="sourceAsm"  name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_RAM_ASM_GCC.S" attr="config" version="1.0.1" condition="GCC"/>
        <file category="sourceC"    name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_CPU_PC.c" attr="config" version="1.0.0"/>
        <file category="sourceC"    name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_GPIO.c" attr="config" version="1.0.0"/>
        <file category="sourceC"    name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_Interrupt.c" attr="config" version="1.0.0"/>
        <file category="sourceC"    name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_Manager.c" attr="config" version="1.0.1"/>
        <file category="sourceC"    name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_IWDT.c" attr="config" version="1.0.0"/>
        <file category="header"     name="Device/MG32x02z/Common/IEC60730/Include/MG32x02z_IEC60730_Common.h" attr="config" version="1.0.0"/>
        <!-- independent file -->
        <file category="sourceC"    name="Device/MG32x02z/MG32F02A032/IEC60730/Source/MG32x02z_IEC60730_ADC.c" attr="config" version="1.0.0"/>
        <file category="sourceC"    name="Device/MG32x02z/MG32F02A032/IEC60730/Source/MG32x02z_IEC60730_Flash.c" attr="config" version="1.0.0"/>
        <file category="sourceC"    name="Device/MG32x02z/MG32F02A032/IEC60730/Source/MG32x02z_IEC60730_CSC.c" attr="config" version="1.0.0"/>
        <file category="header"     name="Device/MG32x02z/MG32F02A032/IEC60730/Include/MG32x02z_IEC60730_Manager.h" attr="config" version="1.0.0"/>
        <file category="header"     name="Device/MG32x02z/MG32F02A032/IEC60730/Include/MG32x02z_IEC60730_GPIO.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- IEC60730 Support for MG32_3RD -->
    <component Cclass="IEC60730_Support" Cgroup="Run after Reset" Cversion="1.0.1" condition="IEC60730_128">
      <description>Run IEC60730 after Rest</description>
      <RTE_Components_h>
        #define MG32x02z_IEC60730_ALL_
      </RTE_Components_h>
      <files>
        <!-- Common file -->
        <file category="sourceAsm"  name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_CPU_Reg.s" attr="config" version="1.0.0" condition="ARMCC"/>
        <file category="sourceAsm"  name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_RAM_ASM.s" attr="config" version="1.0.1" condition="ARMCC"/>
        <file category="sourceAsm"  name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_CPU_Reg_GCC.S" attr="config" version="1.0.1" condition="GCC"/>
        <file category="sourceAsm"  name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_RAM_ASM_GCC.S" attr="config" version="1.0.1" condition="GCC"/>
        <file category="sourceC"    name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_CPU_PC.c" attr="config" version="1.0.0"/>
        <file category="sourceC"    name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_GPIO.c" attr="config" version="1.0.0"/>
        <file category="sourceC"    name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_Interrupt.c" attr="config" version="1.0.0"/>
        <file category="sourceC"    name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_Manager.c" attr="config" version="1.0.1"/>
        <file category="sourceC"    name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_IWDT.c" attr="config" version="1.0.0"/>
        <file category="header"     name="Device/MG32x02z/Common/IEC60730/Include/MG32x02z_IEC60730_Common.h" attr="config" version="1.0.0"/>
        <!-- independent file -->
        <file category="sourceC"    name="Device/MG32x02z/MG32F02A128/IEC60730/Source/MG32x02z_IEC60730_ADC.c" attr="config" version="1.0.0"/>
        <file category="sourceC"    name="Device/MG32x02z/MG32F02A128/IEC60730/Source/MG32x02z_IEC60730_Flash.c" attr="config" version="1.0.1"/>
        <file category="sourceC"    name="Device/MG32x02z/MG32F02A128/IEC60730/Source/MG32x02z_IEC60730_CSC.c" attr="config" version="1.0.0"/>
        <file category="header"     name="Device/MG32x02z/MG32F02A128/IEC60730/Include/MG32x02z_IEC60730_Manager.h" attr="config" version="1.0.0"/>
        <file category="header"     name="Device/MG32x02z/MG32F02A128/IEC60730/Include/MG32x02z_IEC60730_GPIO.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- IEC60730 Support for MG32_4TH -->
    <component Cclass="IEC60730_Support" Cgroup="Run after Reset" Cversion="1.0.0" condition="IEC60730_V032">
      <description>Run IEC60730 after Rest</description>
      <RTE_Components_h>
        #define MG32x02z_IEC60730_ALL_
      </RTE_Components_h>
      <files>
        <!-- Common file -->
        <file category="sourceAsm"  name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_CPU_Reg.s" attr="config" version="1.0.0" condition="ARMCC"/>
        <file category="sourceAsm"  name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_RAM_ASM.s" attr="config" version="1.0.1" condition="ARMCC"/>
        <file category="sourceAsm"  name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_CPU_Reg_GCC.S" attr="config" version="1.0.1" condition="GCC"/>
        <file category="sourceAsm"  name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_RAM_ASM_GCC.S" attr="config" version="1.0.1" condition="GCC"/>
        <file category="sourceC"    name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_CPU_PC.c" attr="config" version="1.0.0"/>
        <file category="sourceC"    name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_GPIO.c" attr="config" version="1.0.0"/>
        <file category="sourceC"    name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_Interrupt.c" attr="config" version="1.0.0"/>
        <file category="sourceC"    name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_Manager.c" attr="config" version="1.0.1"/>
        <file category="sourceC"    name="Device/MG32x02z/Common/IEC60730/Source/MG32x02z_IEC60730_IWDT.c" attr="config" version="1.0.0"/>
        <file category="header"     name="Device/MG32x02z/Common/IEC60730/Include/MG32x02z_IEC60730_Common.h" attr="config" version="1.0.0"/>
        <!-- independent file -->
        <file category="sourceC" name="Device/MG32x02z/MG32F02V032/IEC60730/Source/MG32x02z_IEC60730_ADC.c" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/MG32F02V032/IEC60730/Source/MG32x02z_IEC60730_Flash.c" attr="config" version="1.0.0"/>
        <file category="sourceC" name="Device/MG32x02z/MG32F02V032/IEC60730/Source/MG32x02z_IEC60730_CSC.c" attr="config" version="1.0.0"/>
        <file category="header" name="Device/MG32x02z/MG32F02V032/IEC60730/Include/MG32x02z_IEC60730_Manager.h" attr="config" version="1.0.0"/>
        <file category="header" name="Device/MG32x02z/MG32F02V032/IEC60730/Include/MG32x02z_IEC60730_GPIO.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- ********************************************************************************** -->
    <!-- ********************************************************************************** -->
    <!-- ********************************************************************************** -->
    <!--  (Show in Manage Run-Time Envitoment - Board Support) -->
    <!-- ******************************************************************************************* -->
    <!--  TH186x Board Support (MG32F02A132/072) -->
    <bundle Cbundle="TH186x" Cclass="Board Support" Cversion="1.0.0">
      <description>MG32F02A132 Development Board</description>
      <doc></doc>
      <!-- Audio Output->DAC+DMA+Timer Audio output -->
      <component Cgroup="Audio Output" Csub="DAC+DMA+Timer Audio output" condition="BSP_TH186A_A132">
        <description>Initial DAC Audio output (DAC + DMA + Timer)</description>
        <RTE_Components_h>#define BSP_TH186A_Audio</RTE_Components_h>
        <files>
          <file category="source" name="Board Support/Common/Source/Audio_raw_data.c" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/TH186x/Source/BSP_DAC_TH186A.c" attr="config" version="1.0.0"/>
        </files>
      </component>
