XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
      <!-- Button->GPIO I/O -->
      <component Cgroup="Button" Csub="Button control" condition="BSP_TH186A_A132">
        <description>Initial button with GPIO control</description>
        <RTE_Components_h>#define BSP_TH186A_Button</RTE_Components_h>
        <files>
          <file category="source" name="Board Support/Common/Source/BSP_Button.c" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/Common/Include/BSP_Button.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <!-- BLE->MG126 BLE support -->
      <component Cgroup="BLE" Csub="MG126 BLE support" condition="BSP_TH186A_A132">
        <description>MG126 BLE support</description>
        <RTE_Components_h>#define BSP_TH186A_BLE</RTE_Components_h>
        <files>
          <file category="source" name="Board Support/Common/Source/BSP_BLE.c" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/Common/Include/BSP_BLE.h" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/Common/Source/BSP_BLE_app.c" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/Common/Include/BSP_BLE_API.h" attr="config" version="1.0.0"/>
          <file category="library" condition="ARMCC" name="Board Support/Common/Source/mg_BLE_libv4_m0.lib"/>
        </files>
      </component>
      <!-- Humidity and Temperature sensor -> AM2302 -->
      <component Cgroup="Humidity and Temperature sensor" Csub="AM2302" condition="BSP_TH186A_A132">
        <description>AM2302 - Humidity and Temperature sensor</description>
        <RTE_Components_h>#define BSP_TH186x_AM2302</RTE_Components_h>
        <files>
          <file category="source" name="Board Support/TH186x/Source/BSP_DHT_AM2302.c" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/TH186x/Include/BSP_DHT_AM2302.h" attr="config" version="1.0.0"/>
        </files>
      </component>
    </bundle>
    <!-- ******************************************************************************************* -->
    <!--  TH197B Board Support (MG32F02A032) -->
    <bundle Cbundle="TH197x" Cclass="Board Support" Cversion="1.0.0">
      <description>MG32F02A032 Development Board</description>
      <doc></doc>
      <!-- Button->GPIO I/O -->
      <component Cgroup="Button" Csub="Button control" condition="BSP_TH197B_A032">
        <description>Initial button with GPIO control</description>
        <RTE_Components_h>#define BSP_TH197x_Button</RTE_Components_h>
        <files>
          <file category="source" name="Board Support/Common/Source/BSP_Button.c" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/Common/Include/BSP_Button.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <!-- BLE->MG126 BLE support -->
      <component Cgroup="BLE" Csub="MG126 BLE support" condition="BSP_TH197B_A032">
        <description>MG126 BLE support</description>
        <RTE_Components_h>#define BSP_TH197x_BLE</RTE_Components_h>
        <files>
          <file category="source" name="Board Support/Common/Source/BSP_BLE.c" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/Common/Include/BSP_BLE.h" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/Common/Source/BSP_BLE_app.c" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/Common/Include/BSP_BLE_API.h" attr="config" version="1.0.0"/>
          <file category="library" condition="ARMCC" name="Board Support/Common/Source/mg_BLE_libv4_m0.lib"/>
        </files>
      </component>
      <!-- Humidity and Temperature sensor -> AM2302 -->
      <component Cgroup="Humidity and Temperature sensor" Csub="AM2302" condition="BSP_TH197B_A032">
        <description>AM2302 - Humidity and Temperature sensor</description>
        <RTE_Components_h>#define BSP_TH197x_AM2302</RTE_Components_h>
        <files>
          <file category="source" name="Board Support/TH197x/Source/BSP_DHT_AM2302.c" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/TH197x/Include/BSP_DHT_AM2302.h" attr="config" version="1.0.0"/>
        </files>
      </component>
  </bundle>
    <!-- ******************************************************************************************* -->
    <!--  TH217A Board Support (MG32F02U128) -->
    <bundle Cbundle="TH217x" Cclass="Board Support" Cversion="1.0.0">
      <description>MG32F02U128 Development Board</description>
      <doc></doc>
      <!-- Audio Output->DAC+DMA+Timer Audio output -->
      <component Cgroup="Audio Output" Csub="DAC+DMA+Timer Audio output" condition="BSP_TH217A_U128">
        <description>Initial DAC Audio output (DAC + DMA + Timer)</description>
        <RTE_Components_h>#define BSP_TH217x_Audio</RTE_Components_h>
        <files>
          <file category="source" name="Board Support/Common/Source/Audio_raw_data.c" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/TH217x/Source/BSP_DAC_TH217A.c" attr="config" version="1.0.0"/>
        </files>
      </component>
      <!-- Button->GPIO I/O -->
      <component Cgroup="Button" Csub="Button control" condition="BSP_TH217A_U128">
        <description>Initial button with GPIO control</description>
        <RTE_Components_h>#define BSP_TH217x_Button</RTE_Components_h>
        <files>
          <file category="source" name="Board Support/Common/Source/BSP_Button.c" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/Common/Include/BSP_Button.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <!-- BLE->MG126 BLE support -->
      <component Cgroup="BLE" Csub="MG126 BLE support" condition="BSP_TH217A_U128">
        <description>MG126 BLE support</description>
        <RTE_Components_h>#define BSP_TH217x_BLE</RTE_Components_h>
        <files>
          <file category="source" name="Board Support/Common/Source/BSP_BLE.c" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/Common/Include/BSP_BLE.h" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/Common/Source/BSP_BLE_app.c" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/Common/Include/BSP_BLE_API.h" attr="config" version="1.0.0"/>
          <file category="library" condition="ARMCC" name="Board Support/Common/Source/mg_BLE_libv4_m0.lib"/>
        </files>
      </component>
      <!-- Humidity and Temperature sensor -> AM2302 -->
      <component Cgroup="Humidity and Temperature sensor" Csub="AM2302" condition="BSP_TH217A_U128">
        <description>AM2302 - Humidity and Temperature sensor</description>
        <RTE_Components_h>#define BSP_TH217x_AM2302</RTE_Components_h>
        <files>
          <file category="source" name="Board Support/Common/Source/BSP_DHT_AM2302.c" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/Common/Include/BSP_DHT_AM2302.h" attr="config" version="1.0.0"/>
        </files>
      </component>
  </bundle>
    <!-- ******************************************************************************************* -->
    <bundle Cbundle="TH218x" Cclass="Board Support" Cversion="1.0.0">
      <description>MG32F02A128 Development Board</description>
      <doc></doc>
      <!-- Audio Output->DAC+DMA+Timer Audio output -->
      <component Cgroup="Audio Output" Csub="DAC+DMA+Timer Audio output" condition="BSP_TH218A_A128">
        <description>Initial DAC Audio output (DAC + DMA + Timer)</description>
        <RTE_Components_h>#define BSP_TH218x_Audio</RTE_Components_h>
        <files>
          <file category="source" name="Board Support/Common/Source/Audio_raw_data.c" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/TH218x/Source/BSP_DAC_TH218A.c" attr="config" version="1.0.0"/>
        </files>
      </component>
