XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
      <!-- Button->GPIO I/O -->
      <component Cgroup="Button" Csub="Button control" condition="BSP_TH218A_A128">
        <description>Initial button with GPIO control</description>
        <RTE_Components_h>#define BSP_TH218x_Button</RTE_Components_h>
        <files>
          <file category="source" name="Board Support/Common/Source/BSP_Button.c" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/Common/Include/BSP_Button.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <!-- BLE->MG126 BLE support -->
      <component Cgroup="BLE" Csub="MG126 BLE support" condition="BSP_TH218A_A128">
        <description>MG126 BLE support</description>
        <RTE_Components_h>#define BSP_TH218x_BLE</RTE_Components_h>
        <files>
          <file category="source" name="Board Support/Common/Source/BSP_BLE.c" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/Common/Include/BSP_BLE.h" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/Common/Source/BSP_BLE_app.c" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/Common/Include/BSP_BLE_API.h" attr="config" version="1.0.0"/>
          <file category="library" condition="ARMCC" name="Board Support/Common/Source/mg_BLE_libv4_m0.lib"/>
        </files>
      </component>
      <!-- Humidity and Temperature sensor -> AM2302 -->
      <component Cgroup="Humidity and Temperature sensor" Csub="AM2302" condition="BSP_TH218A_A128">
        <description>AM2302 - Humidity and Temperature sensor</description>
        <RTE_Components_h>#define BSP_TH218x_AM2302</RTE_Components_h>
        <files>
          <file category="source" name="Board Support/Common/Source/BSP_DHT_AM2302.c" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/Common/Include/BSP_DHT_AM2302.h" attr="config" version="1.0.0"/>
        </files>
      </component>
    </bundle>
    <!-- ******************************************************************************************* -->
    <bundle Cbundle="MG04_06x" Cclass="Board Support" Cversion="1.0.0">
      <description>MG32F02V032 Demo Board</description>
      <doc></doc>
      <!-- ARGB->ARGB LED -->
      <component Cgroup="ARGB" Csub="ARGB LED" condition="BSP_MG04_06">
        <description>Drive ARGB LED(WS2812B) via APX's ASB module</description>
        <RTE_Components_h>#define BSP_MG04_06x</RTE_Components_h>
        <files>
          <file category="sourceC" name="Board Support/MG04_06x/Source/BSP_ARGB.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/MG04_06x/Include/BSP_ARGB.h" attr="config" version="1.0.0"/>
          <file category="sourceC" name="Board Support/MG04_06x/Source/BSP_ARGBTable.c" attr="config" version="1.0.0"/>
          <file category="sourceC" name="Board Support/MG04_06x/Source/BSP_Common_MG04_06.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/MG04_06x/Include/BSP_Common_MG04_06.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <!-- Memory->SPI Flash -->
      <component Cgroup="Memory" Csub="SPI Flash" condition="BSP_MG04_06">
        <description>Use Flash(MX25R6435F) via SPI interface ( Use SPI module)</description>
        <RTE_Components_h>#define BSP_MG04_06x</RTE_Components_h>
        <files>
          <file category="sourceC" name="Board Support/MG04_06x/Source/BSP_SPIFlash.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/MG04_06x/Include/BSP_SPIFlash.h" attr="config" version="1.0.0"/>
          <file category="sourceC" name="Board Support/MG04_06x/Source/BSP_Common_MG04_06.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/MG04_06x/Include/BSP_Common_MG04_06.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <!-- Button->SAR ADC Key -->
      <component Cgroup="Button" Csub="SAR ADC Key" condition="BSP_MG04_06">
        <description>Detects Key by SAR ADC</description>
        <RTE_Components_h>#define BSP_MG04_06x</RTE_Components_h>
        <files>
          <file category="sourceC" name="Board Support/MG04_06x/Source/BSP_SARADCKey.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/MG04_06x/Include/BSP_SARADCKey.h" attr="config" version="1.0.0"/>
          <file category="sourceC" name="Board Support/MG04_06x/Source/BSP_Common_MG04_06.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/MG04_06x/Include/BSP_Common_MG04_06.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <!-- Button->Touch Key -->
      <component Cgroup="Button" Csub="Touch Key" condition="BSP_MG04_06">
        <description>Detects touch key by SAR ADC</description>
        <RTE_Components_h>#define BSP_MG04_06x</RTE_Components_h>
        <files>
          <file category="sourceC" name="Board Support/MG04_06x/Source/BSP_TouchKey.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/MG04_06x/Include/BSP_TouchKey.h" attr="config" version="1.0.0"/>
          <file category="sourceC" name="Board Support/MG04_06x/Source/BSP_Common_MG04_06.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/MG04_06x/Include/BSP_Common_MG04_06.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <!-- LCD->SPI LCD -->
      <component Cgroup="LCD" Csub="SPI LCD" condition="BSP_MG04_06_REQ1">
        <description>Drive LCD (ILI9341) via SPI interface (Use URT module)</description>
        <RTE_Components_h>#define BSP_MG04_06x</RTE_Components_h>
        <files>
          <file category="sourceC" name="Board Support/MG04_06x/Source/BSP_SPILCD.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/MG04_06x/Include/BSP_SPILCD.h" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/MG04_06x/Include/BSP_SPILCDFont.h" attr="config" version="1.0.0"/>
          <file category="sourceC" name="Board Support/MG04_06x/Source/BSP_Common_MG04_06.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/MG04_06x/Include/BSP_Common_MG04_06.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <!-- Communication->URT CON -->
      <component Cgroup="Communication" Csub="URT COM" condition="BSP_MG04_06">
        <description>Drive UART COM via URT module</description>
        <RTE_Components_h>#define BSP_MG04_06x</RTE_Components_h>
        <files>
          <file category="sourceC" name="Board Support/MG04_06x/Source/BSP_UARTCOM.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/MG04_06x/Include/BSP_UARTCOM.h" attr="config" version="1.0.0"/>
          <file category="sourceC" name="Board Support/MG04_06x/Source/BSP_Common_MG04_06.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/MG04_06x/Include/BSP_Common_MG04_06.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <!-- Humidity and Temperature sensor -> AM2302 -->
      <component Cgroup="Humidity and Temperature sensor" Csub="AM2302" condition="BSP_MG04_06">
        <description>AM2302 - Humidity and Temperature sensor</description>
        <RTE_Components_h>#define BSP_MG04_06x_AM2302</RTE_Components_h>
        <files>
          <file category="source" name="Board Support/Common/Source/BSP_DHT_AM2302.c" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/Common/Include/BSP_DHT_AM2302.h" attr="config" version="1.0.0"/>
        </files>
      </component>
    </bundle>
    <!-- ******************************************************************************************* -->
    <bundle Cbundle="TH222x" Cclass="Board Support" Cversion="1.0.0">
      <description>MG32F02VA128/U128/A064/U064 Demo Board</description>
      <doc></doc>
      <!-- LED->RGB -->
      <component Cgroup="LED" Csub="3. RGB LED" condition="BSP_TH222A_U128">
        <description>Drive RGB LED(GTG505RGBC) by TM36 PWM output</description>
        <RTE_Components_h>#define BSP_TH222x_RGB</RTE_Components_h>
        <files>
          <file category="sourceC" name="Board Support/TH222x/Source/BSP_3_RGB.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/TH222x/Include/BSP_3_RGB.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <!-- LED->2 Color Dot Matrix LED -->
      <component Cgroup="LED" Csub="17. 8x8 LEDs with 2 colors" condition="BSP_TH222A_U128">
        <description>Display via 8x8 Matrix LEDs</description>
        <RTE_Components_h>#define BSP_TH222x_8x8LEDs</RTE_Components_h>
        <files>
          <file category="sourceC" name="Board Support/TH222x/Source/BSP_17_2ColorDotMatrixLED.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/TH222x/Include/BSP_17_2ColorDotMatrixLED.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <!-- LED->LEDX8 -->
      <component Cgroup="LED" Csub="6. LEDx8" condition="BSP_TH222A_U128">
        <description>Control LEDx8 LED</description>
        <RTE_Components_h>#define BSP_TH222x_LEDX8</RTE_Components_h>
        <files>
          <file category="sourceC" name="Board Support/TH222x/Source/BSP_6_LEDX8.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/TH222x/Include/BSP_6_LEDX8.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <!-- LED->7 SEG display -->
      <component Cgroup="LED" Csub="18. 4x7 SEG display" condition="BSP_TH222A_U128">
        <description>Display via 4x(7-SEG display)</description>
        <RTE_Components_h>#define BSP_TH222x_4x7SegDisplay</RTE_Components_h>
        <files>
          <file category="sourceC" name="Board Support/TH222x/Source/BSP_18_7Segment.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/TH222x/Include/BSP_18_7Segment.h" attr="config" version="1.0.0"/>
        </files>
      </component>
