XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
      <!-- ARGB->ARGB -->
      <component Cgroup="ARGB" Csub="2. ARGB" condition="BSP_TH222A_U128">
        <description>Control WS2812 ARGB LED</description>
        <RTE_Components_h>#define BSP_TH222x_ARGB</RTE_Components_h>
        <files>
          <file category="sourceC" name="Board Support/TH222x/Source/BSP_2_ARGB_WS2812.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/TH222x/Include/BSP_2_ARGB_WS2812.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <!-- Buzzer->Buzzer -->
      <component Cgroup="Buzzer" Csub="10. Buzzer" condition="BSP_TH222A_U128">
        <description>Control Buzzer via GPIO</description>
        <RTE_Components_h>#define BSP_TH222x_Buzzer</RTE_Components_h>
        <files>
          <file category="sourceC" name="Board Support/TH222x/Source/BSP_10_Buzzer.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/TH222x/Include/BSP_10_Buzzer.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <!-- Switch->DIP switch -->
      <component Cgroup="Switch" Csub="5. DIP Switch" condition="BSP_TH222A_U128">
        <description>Control DIP Switch via GPIO</description>
        <RTE_Components_h>#define BSP_TH222x_DIPSwitch</RTE_Components_h>
        <files>
          <file category="sourceC" name="Board Support/TH222x/Source/BSP_5_DIPSwitch.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/TH222x/Include/BSP_5_DIPSwitch.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <!-- Motor->StepMotor -->
      <component Cgroup="Motor" Csub="7. Step Motor" condition="BSP_TH222A_U128">
        <description>Control 24BYJ-48 Step motor</description>
        <RTE_Components_h>#define BSP_TH222x_StepMotor</RTE_Components_h>
        <files>
          <file category="sourceC" name="Board Support/TH222x/Source/BSP_7_StepMotor.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/TH222x/Include/BSP_7_StepMotor.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <!-- Motor->RC Servo motor -->
      <component Cgroup="Motor" Csub="11. RC Servo Motor" condition="BSP_TH222A_U128">
        <description>Control RC Servo motor (e.g. SG90)</description>
        <RTE_Components_h>#define BSP_TH222x_RCServoMotor</RTE_Components_h>
        <files>
          <file category="sourceC" name="Board Support/TH222x/Source/BSP_11_RCServoMotor.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/TH222x/Include/BSP_11_RCServoMotor.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <!-- Memory->EEPROM -->
      <component Cgroup="Memory" Csub="14. EEPROM" condition="BSP_TH222A_U128">
        <description>Access EEPROM via I2C</description>
        <RTE_Components_h>#define BSP_TH222x_EEPROM</RTE_Components_h>
        <files>
          <file category="sourceC" name="Board Support/TH222x/Source/BSP_14_EEPROM.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/TH222x/Include/BSP_14_EEPROM.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <!-- Memory->SPI Flash -->
      <component Cgroup="Memory" Csub="13. SPI Flash" condition="BSP_TH222A_U128">
        <description>Access Flash via SPI</description>
        <RTE_Components_h>#define BSP_TH222x_SPIFlash</RTE_Components_h>
        <files>
          <file category="sourceC" name="Board Support/TH222x/Source/BSP_13_SPIFlash.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/TH222x/Include/BSP_13_SPIFlash.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <!-- Button->4x4 keyboard -->
      <component Cgroup="Button" Csub="15. 4x4 keyboard" condition="BSP_TH222A_U128">
        <description>Detects 4x4 Keyboard</description>
        <RTE_Components_h>#define BSP_TH222x_4x4Keyboard</RTE_Components_h>
        <files>
          <file category="sourceC" name="Board Support/TH222x/Source/BSP_15_4x4Keyboard.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/TH222x/Include/BSP_15_4x4Keyboard.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <!-- LCD->16x2 LCD -->
      <component Cgroup="LCD" Csub="19. 16x2 LCM" condition="BSP_TH222A_U128">
        <description>Display on 16x2 LCM</description>
        <RTE_Components_h>#define BSP_TH222x_16x2LCM</RTE_Components_h>
        <files>
          <file category="sourceC" name="Board Support/TH222x/Source/BSP_19_LCD.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/TH222x/Include/BSP_19_LCD.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <!-- Others->Variable Resistor -->
      <component Cgroup="Others" Csub="8. Variable Resistor" condition="BSP_TH222A_U128">
        <description>Access Variable Resistor via ADC</description>
        <RTE_Components_h>#define BSP_TH222x_VariableResistor</RTE_Components_h>
        <files>
          <file category="sourceC" name="Board Support/TH222x/Source/BSP_8_VariableResistor.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/TH222x/Include/BSP_8_VariableResistor.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <!-- QEI->Variable Resistor -->
      <component Cgroup="QEI" Csub="9. Rotary Encoder" condition="BSP_TH222A_U128">
        <description>Access Rotary Encoder via QEI function</description>
        <RTE_Components_h>#define BSP_TH222x_RotaryEncoder</RTE_Components_h>
        <files>
          <file category="sourceC" name="Board Support/TH222x/Source/BSP_9_RotaryEncoder.c" attr="config" version="1.0.0"/>
          <file category="header" name="Board Support/TH222x/Include/BSP_9_RotaryEncoder.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <!-- BLE->BLE support -->
      <component Cgroup="BLE" Csub="12. MG126 BLE support" condition="BSP_TH222A_U128">
        <description>MG126 BLE support</description>
        <RTE_Components_h>#define BSP_TH222x_BLE</RTE_Components_h>
        <files>
          <file category="source" name="Board Support/TH222x/Source/BSP_12_BLE.c" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/TH222x/Include/BSP_12_BLE.h" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/TH222x/Source/BSP_12_BLE_app.c" attr="config" version="1.0.0"/>
          <file category="source" name="Board Support/TH222x/Include/BSP_12_BLE_app.h" attr="config" version="1.0.0"/>
          <file category="library" condition="ARMCC" name="Board Support/TH222x/Source/mg_BLE_libv4_m0.lib"/>
        </files>
      </component>
