XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
    </bundle>
  </components>
  <!-- ********************************************************************************************************************************* -->
  <boards>
    <!-- ******************************************************************************************* -->
    <!-- board for MG32F02A132/072 -->
    <!-- ******************************************************************************************* -->
    <!--  Megawin's MG32F02A132 Development Board (Show in Pack Installer - Boards)  -->
    <board vendor="Megawin" name="MG32 TH186x_MG32F02A132_LQFP80_EV_Board" revision="V11">
      <description>MG32F02A132 Development Board</description>
      <mountedDevice deviceIndex="0" Dvendor="Megawin:70" Dname="MG32F02A132"/>
      <debugInterface adapter="JTAG/SW" connector="MLink"/>
      <feature type="CustomFF" n="120" m="60"/>
    </board>
    <!--  Megawin's LCD demo Board support  -->
    <board vendor="Megawin" name="MG32 MG04-02x(MG32F02A_LCD)" revision="V1.0">
      <description>LCD demo Development Board</description>
      <mountedDevice deviceIndex="0" Dvendor="Megawin:70" Dname="MG32F02A132"/>
      <debugInterface adapter="JTAG/SW" connector="MLink"/>
      <feature type="CustomFF" n="120" m="60"/>
    </board>
    <!-- ******************************************************************************************* -->
    <!-- board for MG32F02A032 -->
    <!-- ******************************************************************************************* -->
    <!--  Megawin's MG32F02A032 Development Board (Show in Pack Installer - Boards) -->
    <board vendor="Megawin" name="MG32 TH197x_MG32F02A032_LQFP48_EV_Board" revision="V11">
      <description>MG32F02A032 Development Board</description>
      <mountedDevice deviceIndex="0" Dvendor="Megawin:70" Dname="MG32F02A032"/>
      <debugInterface adapter="JTAG/SW" connector="MLink"/>
      <feature type="CustomFF" n="120" m="60"/>
    </board>
    <!--  Megawin's MG32F02A032 BLDC Development Board  -->
    <board vendor="Megawin" name="MG32 Control_V11 20190221" revision="V1.1">
      <description>MG32F02A032 BLDC Development Board</description>
      <mountedDevice deviceIndex="0" Dvendor="Megawin:70" Dname="MG32F02A032"/>
      <debugInterface adapter="JTAG/SW" connector="MLink"/>
      <feature type="CustomFF" n="120" m="60"/>
    </board>
    <!-- ******************************************************************************************* -->
    <!-- board for MG32F02U128 -->
    <!-- ******************************************************************************************* -->
    <!--  Megawin's MG32F02U128 Development Board (Show in Pack Installer - Boards) -->
    <board vendor="Megawin" name="MG32 TH217x_MG32F02U064_128_LQFP-80_EV_Board" revision="V12">
      <description>MG32F02U128 Development Board</description>
      <mountedDevice deviceIndex="0" Dvendor="Megawin:70" Dname="MG32F02U128"/>
      <debugInterface adapter="JTAG/SW" connector="MLink"/>
      <feature type="CustomFF" n="120" m="60"/>
    </board>
    <!--  Megawin's USB Keyboard for MG32F02U128 -->
    <board vendor="Megawin" name="MG32 MG04-05x(MG32F02U_KEYBOARD)" revision="V1.1">
      <description>MG32F02U128 Development Board</description>
      <mountedDevice deviceIndex="0" Dvendor="Megawin:70" Dname="MG32F02U128"/>
      <debugInterface adapter="JTAG/SW" connector="MLink"/>
      <feature type="CustomFF" n="120" m="60"/>
    </board>
    <!--  Megawin's MG32F02U128 MG04-04x MG32F02U_LCD  -->
    <board vendor="Megawin" name="MG32 MG04-04x(MG32F02U_LCD)" revision="V1.1">
      <description>MG32F02U128 MG04-04A MG32F02U_LCD</description>
      <mountedDevice deviceIndex="0" Dvendor="Megawin:70" Dname="MG32F02U128"/>
      <debugInterface adapter="JTAG/SW" connector="MLink"/>
      <feature type="CustomFF" n="120" m="60"/>
    </board>
    <!--  Megawin's MG32F02U128 TH222A_M0ICE Mother Board  -->
    <board vendor="Megawin" name="MG32 TH222x_M0 ICE Mother Board" revision="V10">
      <description>MG32F02U128 TH222A_M0ICE Mother Board</description>
      <mountedDevice deviceIndex="0" Dvendor="Megawin:70" Dname="MG32F02U128"/>
      <debugInterface adapter="JTAG/SW" connector="MLink"/>
      <feature type="CustomFF" n="120" m="60"/>
    </board>
    <!-- ******************************************************************************************* -->
    <!-- board for MG32F02A128 -->
    <!-- ******************************************************************************************* -->
    <!--  Megawin's MG32F02A128 Development Board (Show in Pack Installer - Boards) -->
    <board vendor="Megawin" name="MG32 TH218x_MG32F02A064_128_LQFP-80_EV_Board" revision="V12">
      <description>MG32F02A128 Development Board</description>
      <mountedDevice deviceIndex="0" Dvendor="Megawin:70" Dname="MG32F02A128"/>
      <debugInterface adapter="JTAG/SW" connector="MLink"/>
      <feature type="CustomFF" n="120" m="60"/>
    </board>
    <!-- ******************************************************************************************* -->
    <!-- board for MG32F02V032 -->
    <!-- ******************************************************************************************* -->
    <!--  Megawin's MG32F02V032 Development Board (Show in Pack Installer - Boards) -->
    <board vendor="Megawin" name="MG32 TH229x_MG32F02V032_LQFP-32_EV_Board" revision="V10">
      <description>MG32F02V032 Development Board</description>
      <mountedDevice deviceIndex="0" Dvendor="Megawin:70" Dname="MG32F02V032"/>
      <debugInterface adapter="JTAG/SW" connector="MLink"/>
      <feature type="CustomFF" n="120" m="60"/>
    </board>
    <!--  Megawin's LCD demo Board support  -->
    <board vendor="Megawin" name="MG32 MG04-06x(MG32F02V_ARGB)" revision="V1.1">
      <description>ARGB+LCD Development</description>
      <mountedDevice deviceIndex="0" Dvendor="Megawin:70" Dname="MG32F02V032"/>
      <debugInterface adapter="JTAG/SW" connector="MLink"/>
      <feature type="CustomFF" n="120" m="60"/>
    </board>
  </boards>
  <!-- ********************************************************************************************************************************* -->
  <examples>
    <!-- ******************************************************************************************* -->
    <!-- examples for MG32F02A132/072 -->
    <!-- ******************************************************************************************* -->
    <!-- ==================== for IEC60730 ==================== -->
    <example name="IEC60730 Project for MG32F02A132,072,MA862" folder="Examples/MG32F02A132/IEC60730_Project" doc="Abstract.txt" version="1.0">
      <description>IEC60730 managent</description>
      <board name="MG32 TH186x_MG32F02A132_LQFP80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z_IEC60730.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>IEC60730</keyword>
      </attributes>
    </example>
    <!-- ==================== for Basic project ==================== -->
    <example name="Basic Project" folder="Examples/MG32F02A132/Basic_Project" doc="Abstract.txt" version="1.0">
      <description>Simple enable GPIO and CSC peripheral</description>
      <board name="MG32 TH186x_MG32F02A132_LQFP80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="Basic_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>Basic</keyword>
      </attributes>
    </example>
    <!-- ==================== for Standard project ==================== -->
    <example name="Standard Project" folder="Examples/MG32F02A132/Standard_Project" doc="Abstract.txt" version="1.0">
      <description>Fully Enable All Peripheral with LED control</description>
      <board name="MG32 TH186x_MG32F02A132_LQFP80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="Standard_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>Standard</keyword>
      </attributes>
    </example>
    <!-- ==================== for LEDBreathing_Software project ==================== -->
    <example name="LED Breathing Project" folder="Examples/MG32F02A132/LEDBreathing_Software" doc="Abstract.txt" version="1.0">
      <description>LED breathing control</description>
      <board name="MG32 TH186x_MG32F02A132_LQFP80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>LED Breathing</keyword>
      </attributes>
    </example>
    <!-- ==================== for uCOS-II_Project project ==================== -->
    <example name="uCOS-II_Project" folder="Examples/MG32F02A132/uCOS-II_Project" doc="Abstract.txt" version="1.0">
      <description>(uCOS-II)Fully Enable All Peripheral with LED control</description>
      <board name="MG32 TH186x_MG32F02A132_LQFP80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="OS.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>uCOS-II</keyword>
      </attributes>
    </example>
    <!-- ==================== for BLE_MG126_Project ==================== -->
    <example name="BLE MG126 Project" folder="Examples/MG32F02A132/BLE_Project/BLE_MG126_Project" doc="Abstract.txt" version="1.0">
      <description>BLE(MG126) access with MG32F02A132</description>
      <board name="MG32 TH186x_MG32F02A132_LQFP80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="BLE_MG126_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>BLE</keyword>
      </attributes>
    </example>
    <!-- ==================== for LCD_Development function ==================== -->
    <example name="LCD demo Project" folder="Examples/MG32F02A132/LCD_Development" doc="abstract.txt" version="1.0">
      <description>
        Demo LCD 320x200 with another peripheral(Please set Stack Size &gt; 0x00002000)
      </description>
      <board name="MG32 MG04-02x(MG32F02A_LCD)" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>LCD demo</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_ARGB ==================== -->
    <example name="ARGB Project" folder="Examples/MG32F02A132/ARGB_Project" doc="Abstract.txt" version="1.0">
      <description>ARGB(WS2818) with MG32F02A132</description>
      <board name="MG32 TH186x_MG32F02A132_LQFP80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z_ARGB.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>ARGB</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_DAC_Audio (Driver level) ==================== -->
    <example name="DAC Audio Project (Driver level)" folder="Examples/MG32F02A132/DAC_Audio_Project/Driver/MG32F02A132_DAC_AudioOut_DRV" doc="Abstract.txt" version="1.0">
      <description>DAC Audio with MG32F02A132 (Driver level)(+DB05-02)</description>
      <board name="MG32 TH186x_MG32F02A132_LQFP80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="DAC_Audio.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>DAC Audio</keyword>
        <keyword>Audio</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_DAC_Audio (Middleware level) ==================== -->
    <example name="DAC Audio Project (Middleware level)" folder="Examples/MG32F02A132/DAC_Audio_Project/Middleware/MG32F02A132_DAC_AudioOut_MID" doc="Abstract.txt" version="1.0">
      <description>DAC Audio with MG32F02A132 (Middleware level)(+DB05-02)</description>
      <board name="MG32 TH186x_MG32F02A132_LQFP80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="DAC_Audio.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>DAC Audio</keyword>
        <keyword>Audio</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_SPI_FLASH (SPI FLASH) ==================== -->
    <example name="FLASH Project" folder="Examples/MG32F02A132/SPI_FLASH_Project" doc="Abstract.txt" version="1.0">
      <description>Access MX25L3206E flash by SPI </description>
      <board name="MG32 TH186x_MG32F02A132_LQFP80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="SPI_FLASH_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>SPI FLASH</keyword>
        <keyword>FLASH</keyword>
        <keyword>SPI</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_I2C_EEPROM (I2C FLASH) ==================== -->
    <example name="EEPROM 24C-Series Project" folder="Examples/MG32F02A132/I2C_24cEepromAccess_Project" doc="Abstract.txt" version="1.0">
      <description>Access 24C-Series EEPROM by I2C </description>
      <board name="MG32 TH186x_MG32F02A132_LQFP80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32F02_I2C_24C_Memory.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>EEPROM 24C-Series I2C</keyword>
        <keyword>EEPROM</keyword>
        <keyword>24C-Series</keyword>
        <keyword>I2C</keyword>
      </attributes>
    </example>
    <!-- ==================== for RTC Show Calendar ==================== -->
    <example name="RTC Show Calendar Project" folder="Examples/MG32F02A132/RTC_ShowCalendar" doc="Abstract.txt" version="1.0">
      <description>Display calendar through RTC module</description>
      <board name="MG32 TH186x_MG32F02A132_LQFP80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="RTC_ShowCalendar.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>RTC</keyword>
        <keyword>Calendar</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_PWM_AudioOut (Driver level) ==================== -->
    <example name="PWM Audio Project (Driver level)" folder="Examples/MG32F02A132/MG32F02A132_PWM_AudioOut/MG32F02A132_PWM_AudioOut_DRV" doc="Abstract.txt" version="1.0">
      <description>PWM Audio with MG32F02A132 (Driver level)(+DB05-02)</description>
      <board name="MG32 TH186x_MG32F02A132_LQFP80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z_PWM_AudioOut.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>PWM Audio</keyword>
        <keyword>Audio</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_PWM_AudioOut (Middleware level) ==================== -->
    <example name="PWM Audio Project (Middleware level)" folder="Examples/MG32F02A132/MG32F02A132_PWM_AudioOut/MG32F02A132_PWM_AudioOut_MID" doc="Abstract.txt" version="1.0">
      <description>PWM Audio with MG32F02A132 (Middleware level)(+DB05-02)</description>
      <board name="MG32 TH186x_MG32F02A132_LQFP80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z_PWM_AudioOut.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>PWM Audio</keyword>
        <keyword>Audio</keyword>
      </attributes>
    </example>
    <!-- ==================== for SPI_ePaper_2.13inch ==================== -->
    <example name="SPI_ePaper_2.13inch" folder="Examples/MG32F02A132/SPI_ePaper_2.13inch/" doc="Abstract.txt" version="1.0">
      <description>SPI driver with TH186x_MG32F02A132_LQFP80_EV_Board + 2.13inch e-Paper HAT</description>
      <board name="MG32 TH186x_MG32F02A132_LQFP80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="SPI_ePaper_2.13inch.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>SPI</keyword>
        <keyword>waveshare</keyword>
        <keyword>2.13</keyword>
      </attributes>
    </example>
    <!-- ******************************************************************************************* -->
    <!-- examples for MG32F02A032 -->
    <!-- ******************************************************************************************* -->
    <!-- ==================== for IEC60730 ==================== -->
    <example name="IEC60730 Project for MG32F02A032" folder="Examples/MG32F02A032/IEC60730_Project" doc="Abstract.txt" version="1.1">
      <description>IEC60730 managent</description>
      <board name="MG32 TH197x_MG32F02A032_LQFP48_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z_IEC60730.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>IEC60730</keyword>
      </attributes>
    </example>
    <!-- ==================== for Basic project ==================== -->
    <example name="Basic Project" folder="Examples/MG32F02A032/Basic_Project" doc="Abstract.txt" version="1.1">
      <description>Simple enable GPIO and CSC peripheral</description>
      <board name="MG32 TH197x_MG32F02A032_LQFP48_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="Basic_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>Basic</keyword>
      </attributes>
    </example>
    <!-- ==================== for Standard project ==================== -->
    <example name="Standard Project" folder="Examples/MG32F02A032/Standard_Project" doc="Abstract.txt" version="1.1">
      <description>Fully Enable All Peripheral with LED control</description>
      <board name="MG32 TH197x_MG32F02A032_LQFP48_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="Standard_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>Standard</keyword>
      </attributes>
    </example>
    <!-- ==================== for LEDBreathing_Software project ==================== -->
    <example name="LED Breathing Project" folder="Examples/MG32F02A032/LEDBreathing_Software" doc="Abstract.txt" version="1.0">
      <description>LED breathing control</description>
      <board name="MG32 TH197x_MG32F02A032_LQFP48_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>LED Breathing</keyword>
      </attributes>
    </example>
    <!-- ==================== for BLE_MG126_Project ==================== -->
    <example name="BLE MG126 Project" folder="Examples/MG32F02A032/BLE_Project/BLE_MG126_Project" doc="Abstract.txt" version="1.0">
      <description>BLE(MG126) access with MG32F02A032</description>
      <board name="MG32 TH197x_MG32F02A032_LQFP48_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="BLE_MG126_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>BLE</keyword>
      </attributes>
    </example>
    <!-- ==================== for BLE_HC06_Project ==================== -->
    <example name="BLE HC06 Project" folder="Examples/MG32F02A032/BLE_Project/BLE_HC06_Project" doc="Abstract.txt" version="1.0">
      <description>BLE(HC06) access with MG32F02A032</description>
      <board name="MG32 TH197x_MG32F02A032_LQFP48_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="BLE_HC06_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>BLE</keyword>
      </attributes>
    </example>
    <!-- ==================== for BLE_HC42_Project ==================== -->
    <example name="BLE HC42 Project" folder="Examples/MG32F02A032/BLE_Project/BLE_HC42_Project" doc="Abstract.txt" version="1.0">
      <description>BLE(HC42) access with MG32F02A032</description>
      <board name="MG32 TH197x_MG32F02A032_LQFP48_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="BLE_HC42_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>BLE</keyword>
      </attributes>
    </example>
    <!-- ==================== MGF02A032 BLDC_Sinewave project ==================== -->
    <example name="BLDC_Sinewave Project" folder="Examples/MG32F02A032/MG32F02A032 BLDC_Sinewave" doc="Abstract.txt" version="1.0">
      <description>BLDC+HALL+PWM+Sinewave control</description>
      <board name="MG32 Control_V11 20190221" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32F02A032 BLDC_Sinewave.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>BLDC Sinewave</keyword>
        <keyword>Sinewave</keyword>
      </attributes>
    </example>
    <!-- ==================== MG32F02A032 BLDC_Square project ==================== -->
    <example name="BLDC_Square Project" folder="Examples/MG32F02A032/MG32F02A032 BLDC_Square" doc="Abstract.txt" version="1.0">
      <description>BLDC+HALL+PWM+Square control</description>
      <board name="MG32 Control_V11 20190221" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32F02A032_BLDC_SQUARE.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>BLDC Square</keyword>
        <keyword>Square</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_ARGB ==================== -->
    <example name="ARGB Project" folder="Examples/MG32F02A032/ARGB_Project" doc="Abstract.txt" version="1.0">
      <description>ARGB(WS2818) with MG32F02A032</description>
      <board name="MG32 TH197x_MG32F02A032_LQFP48_EV_Board" vendor="Megawin"/>
      <project>
