XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
        <environment name="uv" load="MG32x02z_ARGB.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>ARGB</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_SPI_FLASH (SPI FLASH) ==================== -->
    <example name="FLASH Project" folder="Examples/MG32F02A032/SPI_FLASH_Project" doc="Abstract.txt" version="1.0">
      <description>Access MX25L3206E flash by SPI </description>
      <board name="MG32 TH197x_MG32F02A032_LQFP48_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="SPI_FLASH_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>SPI FLASH</keyword>
        <keyword>FLASH</keyword>
        <keyword>SPI</keyword>
      </attributes>
    </example>
    <!-- ==================== for RTC Show Calendar ==================== -->
    <example name="RTC Show Calendar Project" folder="Examples/MG32F02A032/RTC_ShowCalendar" doc="Abstract.txt" version="1.0">
      <description>Display calendar through RTC module</description>
      <board name="MG32 TH197x_MG32F02A032_LQFP48_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="RTC_ShowCalendar.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>RTC</keyword>
        <keyword>Calendar</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_PWM_AudioOut (Driver level) ==================== -->
    <example name="PWM Audio Project (Driver level)" folder="Examples/MG32F02A032/MG32F02A032_PWM_AudioOut/MG32F02A032_PWM_AudioOut_DRV" doc="Abstract.txt" version="1.0">
      <description>MG32 TH197x_MG32F02A032_LQFP48_EV_Board (Driver level)(+DB05-02)</description>
      <board name="MG32 TH197x_MG32F02A032_LQFP48_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z_PWM_AudioOut.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>PWM Audio</keyword>
        <keyword>Audio</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_PWM_AudioOut (Middleware level) ==================== -->
    <example name="PWM Audio Project (Middleware level)" folder="Examples/MG32F02A032/MG32F02A032_PWM_AudioOut/MG32F02A032_PWM_AudioOut_MID" doc="Abstract.txt" version="1.0">
      <description>MG32 TH197x_MG32F02A032_LQFP48_EV_Board (Middleware level)(+DB05-02)</description>
      <board name="MG32 TH197x_MG32F02A032_LQFP48_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z_PWM_AudioOut.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>PWM Audio</keyword>
        <keyword>Audio</keyword>
      </attributes>
    </example>
    <!-- ==================== for SPI_ePaper_2.13inch ==================== -->
    <example name="SPI_ePaper_2.13inch" folder="Examples/MG32F02A032/SPI_ePaper_2.13inch/" doc="Abstract.txt" version="1.0">
      <description>SPI driver with TH197x_MG32F02A032_LQFP48_EV_Board + 2.13inch e-Paper HAT</description>
      <board name="MG32 TH197x_MG32F02A032_LQFP48_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="SPI_ePaper_2.13inch.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>SPI</keyword>
        <keyword>waveshare</keyword>
        <keyword>2.13</keyword>
      </attributes>
    </example>
    <!-- ******************************************************************************************* -->
    <!-- examples for MG32F02A128 -->
    <!-- ******************************************************************************************* -->
    <!-- ==================== for Basic project ==================== -->
    <example name="Basic Project" folder="Examples/MG32F02A128/MG32F02A128/Basic_Project" doc="Abstract.txt" version="1.0">
      <description>Simple enable GPIO and CSC peripheral</description>
      <board name="MG32 TH218x_MG32F02A064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="Basic_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>Basic</keyword>
      </attributes>
    </example>
    <!-- ==================== for Standard project ==================== -->
    <example name="Standard Project" folder="Examples/MG32F02A128/MG32F02A128/Standard_Project" doc="Abstract.txt" version="1.0">
      <description>Fully Enable All Peripheral with LED control</description>
      <board name="MG32 TH218x_MG32F02A064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="Standard_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>Standard</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_DAC_Audio (Driver level) ==================== -->
    <example name="DAC Audio Project (Driver level)" folder="Examples/MG32F02A128/MG32F02A128/DAC_Audio_Project/Driver/MG32F02A128_DAC_AudioOut_DRV" doc="Abstract.txt" version="1.0">
      <description>DAC Audio with MG32F02A128 (Driver level)(+DB05-02)</description>
      <board name="MG32 TH218x_MG32F02A064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="DAC_Audio.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>DAC Audio</keyword>
        <keyword>Audio</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_DAC_Audio (Middleware level) ==================== -->
    <example name="DAC Audio Project (Middleware level)" folder="Examples/MG32F02A128/MG32F02A128/DAC_Audio_Project/Middleware/MG32F02A128_DAC_AudioOut_MID" doc="Abstract.txt" version="1.0">
      <description>DAC Audio with MG32F02A128 (Middleware level)(+DB05-02)</description>
      <board name="MG32 TH218x_MG32F02A064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="DAC_Audio.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>DAC Audio</keyword>
        <keyword>Audio</keyword>
      </attributes>
    </example>
    <!-- ==================== for BLE_MG126_Project for MG32F02A128 ==================== -->
    <example name="BLE MG126 Project" folder="Examples/MG32F02A128/MG32F02A128/BLE_Project/BLE_MG126_Project" doc="Abstract.txt" version="1.0">
      <description>BLE(MG126) access with MG32F02A128</description>
      <board name="MG32 TH218x_MG32F02A064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="BLE_MG126_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>BLE</keyword>
      </attributes>
    </example>
    <!-- ==================== for BLE_HC06_Project for MG32F02A128 ==================== -->
    <example name="BLE HC06 Project" folder="Examples/MG32F02A128/MG32F02A128/BLE_Project/BLE_HC06_Project" doc="Abstract.txt" version="1.0">
      <description>BLE(HC06) access with MG32F02A128</description>
      <board name="MG32 TH218x_MG32F02A064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="BLE_HC06_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>BLE</keyword>
      </attributes>
    </example>
    <!-- ==================== for BLE_HC42_Project for MG32F02A128 ==================== -->
    <example name="BLE HC42 Project" folder="Examples/MG32F02A128/MG32F02A128/BLE_Project/BLE_HC42_Project" doc="Abstract.txt" version="1.0">
      <description>BLE(HC42) access with MG32F02A128</description>
      <board name="MG32 TH218x_MG32F02A064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="BLE_HC42_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>BLE</keyword>
      </attributes>
    </example>
    <!-- ==================== for uCOS-II_Project project ==================== -->
    <example name="uCOS-II_Project" folder="Examples/MG32F02A128/MG32F02A128/uCOS-II_Project" doc="Abstract.txt" version="1.0">
      <description>(uCOS-II)Fully Enable All Peripheral with LED control</description>
      <board name="MG32 TH218x_MG32F02A064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="OS.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>uCOS-II</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_ARGB ==================== -->
    <example name="ARGB Project" folder="Examples/MG32F02A128/MG32F02A128/ARGB_Project" doc="Abstract.txt" version="1.0">
      <description>ARGB(WS2818) with MG32F02A128</description>
      <board name="MG32 TH218x_MG32F02A064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z_ARGB.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>ARGB</keyword>
      </attributes>
    </example>
    <!-- ==================== for LEDBreathing_Software project ==================== -->
    <example name="LED Breathing Project" folder="Examples/MG32F02A128/MG32F02A128/LEDBreathing_Software" doc="Abstract.txt" version="1.0">
      <description>LED breathing control</description>
      <board name="MG32 TH218x_MG32F02A064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>LED Breathing</keyword>
      </attributes>
    </example>
    <!-- ==================== for IEC60730 project ==================== -->
    <example name="IEC60730 Project for MG32F02A128" folder="Examples/MG32F02A128/MG32F02A128/IEC60730_Project" doc="Abstract.txt" version="1.0">
      <description>IEC60730 managent</description>
      <board name="MG32 TH218x_MG32F02A064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z_IEC60730.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>IEC60730</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_SPI_FLASH (SPI FLASH) ==================== -->
    <example name="FLASH Project" folder="Examples/MG32F02A128/MG32F02A128/SPI_FLASH_Project" doc="Abstract.txt" version="1.0">
      <description>Access MX25L3206E flash by SPI </description>
      <board name="MG32 TH218x_MG32F02A064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="SPI_FLASH_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>SPI FLASH</keyword>
        <keyword>FLASH</keyword>
        <keyword>SPI</keyword>
      </attributes>
    </example>
    <!-- ==================== for RTC Show Calendar ==================== -->
    <example name="RTC Show Calendar Project" folder="Examples/MG32F02A128/MG32F02A128/RTC_ShowCalendar" doc="Abstract.txt" version="1.0">
      <description>Display calendar through RTC module</description>
      <board name="MG32 TH218x_MG32F02A064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="RTC_ShowCalendar.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>RTC</keyword>
        <keyword>Calendar</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_PWM_AudioOut (Driver level) ==================== -->
    <example name="PWM Audio Project (Driver level)" folder="Examples/MG32F02A128/MG32F02A128/MG32F02A128_PWM_AudioOut/MG32F02A128_PWM_AudioOut_DRV" doc="Abstract.txt" version="1.0">
      <description>MG32 TH218x_MG32F02A064_128_LQFP-80_EV_Board (Driver level)(+DB05-02)</description>
      <board name="MG32 TH218x_MG32F02A064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z_PWM_AudioOut.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>PWM Audio</keyword>
        <keyword>Audio</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_PWM_AudioOut (Middleware level) ==================== -->
    <example name="PWM Audio Project (Middleware level)" folder="Examples/MG32F02A128/MG32F02A128/MG32F02A128_PWM_AudioOut/MG32F02A128_PWM_AudioOut_MID" doc="Abstract.txt" version="1.0">
      <description>MG32 TH218x_MG32F02A064_128_LQFP-80_EV_Board (Middleware level)(+DB05-02)</description>
      <board name="MG32 TH218x_MG32F02A064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z_PWM_AudioOut.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>PWM Audio</keyword>
        <keyword>Audio</keyword>
      </attributes>
    </example>
    <!-- ==================== for SPI_ePaper_2.13inch ==================== -->
    <example name="SPI_ePaper_2.13inch" folder="Examples/MG32F02A128/MG32F02A128/SPI_ePaper_2.13inch/" doc="Abstract.txt" version="1.0">
      <description>SPI driver with TH218x_MG32F02A064_128_LQFP-80_EV_Board + 2.13inch e-Paper HAT</description>
      <board name="MG32 TH218x_MG32F02A064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="SPI_ePaper_2.13inch.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>SPI</keyword>
        <keyword>waveshare</keyword>
        <keyword>2.13</keyword>
      </attributes>
    </example>
    <!-- ******************************************************************************************* -->
    <!-- examples for MG32F02U128 -->
    <!-- ******************************************************************************************* -->
    <!-- ==================== for Basic project ==================== -->
    <example name="Basic Project" folder="Examples/MG32F02A128/MG32F02U128/Basic_Project" doc="Abstract.txt" version="1.0">
      <description>Simple enable GPIO and CSC peripheral</description>
      <board name="MG32 TH217x_MG32F02U064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="Basic_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>Basic</keyword>
      </attributes>
    </example>
    <!-- ==================== for Standard project ==================== -->
    <example name="Standard Project" folder="Examples/MG32F02A128/MG32F02U128/Standard_Project" doc="Abstract.txt" version="1.0">
      <description>Fully Enable All Peripheral with LED control</description>
      <board name="MG32 TH217x_MG32F02U064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="Standard_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>Standard</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_DAC_Audio (Driver level) ==================== -->
    <example name="DAC Audio Project (Driver level)" folder="Examples/MG32F02A128/MG32F02U128/DAC_Audio_Project/Driver/MG32F02U128_DAC_AudioOut_DRV" doc="Abstract.txt" version="1.0">
      <description>DAC Audio with MG32F02U128 (Driver level)(+DB05-02)</description>
      <board name="MG32 TH217x_MG32F02U064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="DAC_Audio.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>DAC Audio</keyword>
        <keyword>Audio</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_DAC_Audio (Middleware level) ==================== -->
    <example name="DAC Audio Project (Middleware level)" folder="Examples/MG32F02A128/MG32F02U128/DAC_Audio_Project/Middleware/MG32F02U128_DAC_AudioOut_MID" doc="Abstract.txt" version="1.0">
      <description>DAC Audio with MG32F02U128 (Middleware level)(+DB05-02)</description>
      <board name="MG32 TH217x_MG32F02U064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="DAC_Audio.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>DAC Audio</keyword>
        <keyword>Audio</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_USB_Keyboard ==================== -->
    <example name="USB Keyboard Project" folder="Examples/MG32F02A128/MG32F02U128/USB_Keyboard_Project" doc="Abstract.txt" version="1.1">
      <description>USB Keyboard with MG32F02U128</description>
      <board name="MG32 MG04-05x(MG32F02U_KEYBOARD)" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>USB Keyboard</keyword>
        <keyword>Keyboard</keyword>
      </attributes>
    </example>
    <!-- ==================== for USB_Keyboard with EasyPOD Mini Project ==================== -->
    <example name="USB_Keyboard with EasyPOD Mini Project" folder="Examples/MG32F02A128/MG32F02U128/USB_Keyboard with EasyPOD Mini Project" doc="Abstract.txt" version="1.1">
      <description>USB_Keyboard with EasyPOD Mini Project (MG32F02U128)</description>
      <board name="MG32 MG04-05x(MG32F02U_KEYBOARD)" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>USB Keyboard</keyword>
        <keyword>Keyboard</keyword>
      </attributes>
    </example>
    <!-- ==================== for BLE_MG126_Project ==================== -->
    <example name="BLE MG126 Project" folder="Examples/MG32F02A128/MG32F02U128/BLE_Project/BLE_MG126_Project" doc="Abstract.txt" version="1.0">
      <description>BLE(MG126) access with MG32F02U128</description>
      <board name="MG32 TH217x_MG32F02U064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="BLE_MG126_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>BLE</keyword>
      </attributes>
    </example>
    <!-- ==================== for BLE_HC06_Project ==================== -->
    <example name="BLE HC06 Project" folder="Examples/MG32F02A128/MG32F02U128/BLE_Project/BLE_HC06_Project" doc="Abstract.txt" version="1.0">
      <description>BLE(HC06) access with MG32F02U128</description>
      <board name="MG32 TH217x_MG32F02U064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="BLE_HC06_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>BLE</keyword>
      </attributes>
    </example>
    <!-- ==================== for BLE_HC42_Project for MG32F02U128 ==================== -->
    <example name="BLE HC42 Project" folder="Examples/MG32F02A128/MG32F02U128/BLE_Project/BLE_HC42_Project" doc="Abstract.txt" version="1.0">
      <description>BLE(HC42) access with MG32F02U128</description>
      <board name="MG32 TH217x_MG32F02U064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="BLE_HC42_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>BLE</keyword>
      </attributes>
    </example>
    <!-- ==================== for uCOS-II_Project project ==================== -->
    <example name="uCOS-II_Project" folder="Examples/MG32F02A128/MG32F02U128/uCOS-II_Project" doc="Abstract.txt" version="1.0">
      <description>(uCOS-II)Fully Enable All Peripheral with LED control</description>
      <board name="MG32 TH217x_MG32F02U064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="OS.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>uCOS-II</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_ARGB ==================== -->
    <example name="ARGB Project" folder="Examples/MG32F02A128/MG32F02U128/ARGB_Project" doc="Abstract.txt" version="1.0">
      <description>ARGB(WS2818) with MG32F02A128</description>
      <board name="MG32 TH217x_MG32F02U064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z_ARGB.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>ARGB</keyword>
      </attributes>
    </example>
    <!-- ==================== for LEDBreathing_Software project ==================== -->
    <example name="LED Breathing Project" folder="Examples/MG32F02A128/MG32F02U128/LEDBreathing_Software" doc="Abstract.txt" version="1.0">
      <description>LED breathing control</description>
      <board name="MG32 TH217x_MG32F02U064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>LED Breathing</keyword>
      </attributes>
    </example>
    <!-- ==================== for USB_EasyCOM project ==================== -->
