XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM0_DFP.pdsc
    <example name="USB_EasyCOM Project" folder="Examples/MG32F02A128/MG32F02U128/USB_EasyCOM" doc="Abstract.txt" version="1.1">
      <description>MG32F02U128 USB EasyCOM</description>
      <board name="MG32 TH217x_MG32F02U064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="EasyCOM_UART.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>USB EasyCOM</keyword>
      </attributes>
    </example>
    <!-- ==================== for USB+LCD Development project ==================== -->
    <example name="USB+LCD Development project" folder="Examples/MG32F02A128/MG32F02U128/USB+LCD Development" doc="Abstract.txt" version="1.0">
      <description>MG32F02U128_DemoBoard_MG04-04A</description>
      <board name="MG32 MG04-04x(MG32F02U_LCD)" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32F02U128_DemoBoard_MG04-04A.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>USB</keyword>
        <keyword>LCD</keyword>
      </attributes>
    </example>
    <!-- ==================== for TH222A_M0ICE  Mother Board (test project)==================== -->
    <example name="TH222x_M0ICE Mother Board (test project)" folder="Examples/MG32F02A128/MG32F02U128/TH222x_Test_Project" doc="Abstract.txt" version="1.0">
      <description>MG32F02U128_MG32 TH222x_M0ICE Mother Board</description>
      <board name="MG32 TH222x_M0 ICE Mother Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="TH222x_Test_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>TH222x</keyword>
      </attributes>
    </example>
    <!-- ==================== for IEC60730 project ==================== -->
    <example name="IEC60730 Project for MG32F02U128" folder="Examples/MG32F02A128/MG32F02U128/IEC60730_Project" doc="Abstract.txt" version="1.0">
      <description>IEC60730 managent</description>
      <board name="MG32 TH217x_MG32F02U064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z_IEC60730.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>IEC60730</keyword>
      </attributes>
    </example>
    <!-- ==================== for USB_Mouse project ==================== -->
    <example name="USB_Mouse Project" folder="Examples/MG32F02A128/MG32F02U128/USB_Mouse_Project" doc="Abstract.txt" version="1.1">
      <description>MG32F02U128 USB Mouse with MG32F02U128</description>
      <board name="MG32 TH217x_MG32F02U064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="mouse.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>USB Mouse</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_SPI_FLASH (SPI FLASH) ==================== -->
    <example name="FLASH Project" folder="Examples/MG32F02A128/MG32F02U128/SPI_FLASH_Project" doc="Abstract.txt" version="1.0">
      <description>Access MX25L3206E flash by SPI </description>
      <board name="MG32 TH217x_MG32F02U064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="SPI_FLASH_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>SPI FLASH</keyword>
        <keyword>FLASH</keyword>
        <keyword>SPI</keyword>
      </attributes>
    </example>
    <!-- ==================== for RTC Show Calendar ==================== -->
    <example name="RTC Show Calendar Project" folder="Examples/MG32F02A128/MG32F02U128/RTC_ShowCalendar" doc="Abstract.txt" version="1.0">
      <description>Display calendar through RTC module</description>
      <board name="MG32 TH217x_MG32F02U064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="RTC_ShowCalendar.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>RTC</keyword>
        <keyword>Calendar</keyword>
      </attributes>
    </example>
    <!-- ==================== for SmartMedia Card Reader ==================== -->
    <example name="Smart Card Reader Project" folder="Examples/MG32F02A128/MG32F02U128/SmartCard_Reader_Project" doc="Abstract.txt" version="1.0">
      <description>Demo SMC reader of URT function</description>
      <board name="MG32 MG04-04x(MG32F02U_LCD)" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>SMC</keyword>
        <keyword>UART</keyword>
      </attributes>
    </example>
    <!-- ==================== for USB EasyCOM with EasyHID Project ==================== -->
    <example name="USB EasyCOM with EasyHID Project" folder="Examples/MG32F02A128/MG32F02U128/USB_EasyCOM with EasyHID_Project" doc="Abstract.txt" version="1.1">
      <description>MG32F02U128 USB EasyCOM with EasyHID</description>
      <board name="MG32 TH217x_MG32F02U064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="EasyCOM_UART.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>USB EasyCOM</keyword>
        <keyword>EasyHID</keyword>
      </attributes>
    </example>
    <!-- ==================== for USB Mouse with EasyHID project ==================== -->
    <example name="USB Mouse with EasyHID" folder="Examples/MG32F02A128/MG32F02U128/USB_Mouse with EasyHID_Project" doc="Abstract.txt" version="1.1">
      <description>MG32F02U128 USB Mouse with EasyHID</description>
      <board name="MG32 TH217x_MG32F02U064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="mouse.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>USB Mouse</keyword>
        <keyword>EasyHID</keyword>
      </attributes>
    </example>
    <!-- ==================== for SPI_LED_Driver_Project ==================== -->
    <example name="SPI LED Driver Project" folder="Examples/MG32F02A128/MG32F02U128/SPI_LED_Driver_Project" doc="Abstract.txt" version="1.0">
      <description>SPI LED driver sample code (TLC5948A) </description>
      <board name="MG32 MG04-05x(MG32F02U_KEYBOARD)" vendor="Megawin"/>
      <project>
        <environment name="uv" load="SPI_LED_Driver_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>SPI</keyword>
        <keyword>LED</keyword>
        <keyword>TLC5948A</keyword>
      </attributes>
    </example>
    <!-- ==================== for USB+LCD Development project ==================== -->
    <example name="SPI LCD Show Character and Graphy project" folder="Examples/MG32F02A128/MG32F02U128/SPI_LCD_Show_Character_and_Graphy" doc="Abstract.txt" version="1.1">
      <description>Drive SPI LCD on MG32F02U128_DemoBoard_MG04-04A</description>
      <board name="MG32 MG04-04x(MG32F02U_LCD)" vendor="Megawin"/>
      <project>
        <environment name="uv" load="SPI_LCD_Show_Character_and_Graphy.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>SPI LCD</keyword>
      </attributes>
    </example>
    <!-- ==================== USB_Keyboard_with_EasyCOM_EasyHID_Project ==================== -->
    <example name="USB Keyboard with EasyCOM EasyHID Project" folder="Examples/MG32F02A128/MG32F02U128/USB_Keyboard_with_EasyCOM_EasyHID_Project" doc="Abstract.txt" version="1.0">
      <description>USB Keyboard with EasyCOM, EasyHID</description>
      <board name="MG32 MG04-05x(MG32F02U_KEYBOARD)" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>USB Keyboard</keyword>
        <keyword>EasyCOM</keyword>
        <keyword>EasyHID</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_PWM_AudioOut (Driver level) ==================== -->
    <example name="PWM Audio Project (Driver level)" folder="Examples/MG32F02A128/MG32F02U128/MG32F02U128_PWM_AudioOut/MG32F02U128_PWM_AudioOut_DRV" doc="Abstract.txt" version="1.0">
      <description>MG32 TH217x_MG32F02U064_128_LQFP-80_EV_Board (Driver level)(+DB05-02)</description>
      <board name="MG32 TH217x_MG32F02U064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z_PWM_AudioOut.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>PWM Audio</keyword>
        <keyword>Audio</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_PWM_AudioOut (Middleware level) ==================== -->
    <example name="PWM Audio Project (Middleware level)" folder="Examples/MG32F02A128/MG32F02U128/MG32F02U128_PWM_AudioOut/MG32F02U128_PWM_AudioOut_MID" doc="Abstract.txt" version="1.0">
      <description>MG32 TH217x_MG32F02U064_128_LQFP-80_EV_Board (Middleware level)(+DB05-02)</description>
      <board name="MG32 TH217x_MG32F02U064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z_PWM_AudioOut.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>PWM Audio</keyword>
        <keyword>Audio</keyword>
      </attributes>
    </example>
    <!-- ==================== for SPI_ePaper_2.13inch ==================== -->
    <example name="SPI_ePaper_2.13inch" folder="Examples/MG32F02A128/MG32F02U128/SPI_ePaper_2.13inch/" doc="Abstract.txt" version="1.0">
      <description>SPI driver with TH217x_MG32F02U064_128_LQFP-80_EV_Board + 2.13inch e-Paper HAT</description>
      <board name="MG32 TH217x_MG32F02U064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="SPI_ePaper_2.13inch.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>SPI</keyword>
        <keyword>waveshare</keyword>
        <keyword>2.13</keyword>
      </attributes>
    </example>
    <!-- ==================== for ExecuteOnSRAM_URT_ShowChar ==================== -->
    <example name="ExecuteOnSRAM_URT_ShowChar" folder="Examples/MG32F02A128/MG32F02U128/ExecuteOnSRAM_URT_ShowChar/" doc="Abstract.txt" version="1.0">
      <description>Execute On SRAM (URT Show Char)</description>
      <board name="MG32 TH217x_MG32F02U064_128_LQFP-80_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="ExecuteOnSRAM_URT_ShowChar.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>SRAM</keyword>
        <keyword>Execute</keyword>
      </attributes>
    </example>
    <!-- ******************************************************************************************* -->
    <!-- examples for MG32F02V032 -->
    <!-- ******************************************************************************************* -->
    <!-- ==================== for Basic project ==================== -->
    <example name="Basic Project" folder="Examples/MG32F02V032/Basic_Project" doc="Abstract.txt" version="1.0">
      <description>Simple enable GPIO and CSC peripheral</description>
      <board name="MG32 TH229x_MG32F02V032_LQFP-32_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="Basic_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>Basic</keyword>
      </attributes>
    </example>
    <!-- ==================== for Standard project ==================== -->
    <example name="Standard Project" folder="Examples/MG32F02V032/Standard_Project" doc="Abstract.txt" version="1.0">
      <description>Fully Enable All Peripheral with LED control</description>
      <board name="MG32 TH229x_MG32F02V032_LQFP-32_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="Standard_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>Standard</keyword>
      </attributes>
    </example>
    <!-- ==================== for BLE_MG126_Project ==================== -->
    <example name="BLE MG126 Project" folder="Examples/MG32F02V032/BLE_Project/BLE_MG126_Project" doc="Abstract.txt" version="1.0">
      <description>BLE(MG126) access with MG32F02V032</description>
      <board name="MG32 TH229x_MG32F02V032_LQFP-32_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="BLE_MG126_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>BLE</keyword>
      </attributes>
    </example>
    <!-- ==================== for BLE_HC06_Project ==================== -->
    <example name="BLE HC06 Project" folder="Examples/MG32F02V032/BLE_Project/BLE_HC06_Project" doc="Abstract.txt" version="1.0">
      <description>BLE(HC06) access with MG32F02V032</description>
      <board name="MG32 TH229x_MG32F02V032_LQFP-32_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="BLE_HC06_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>BLE</keyword>
      </attributes>
    </example>
    <!-- ==================== for BLE_HC42_Project ==================== -->
    <example name="BLE HC42 Project" folder="Examples/MG32F02V032/BLE_Project/BLE_HC42_Project" doc="Abstract.txt" version="1.0">
      <description>BLE(HC42) access with MG32F02V032</description>
      <board name="MG32 TH229x_MG32F02V032_LQFP-32_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="BLE_HC42_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>BLE</keyword>
      </attributes>
    </example>
    <!-- ==================== for IEC60730 project ==================== -->
    <example name="IEC60730 Project for MG32F02V032" folder="Examples/MG32F02V032/IEC60730_Project" doc="Abstract.txt" version="1.0">
      <description>IEC60730 managent</description>
      <board name="MG32 TH229x_MG32F02V032_LQFP-32_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z_IEC60730.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>IEC60730</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32F02V032_ARGB ==================== -->
    <example name="ARGB+LCD Development" folder="Examples/MG32F02V032/ARGB+LCD Development" doc="Abstract.txt" version="1.0">
      <description>ARGB+LCD Development by MG32F02V032</description>
      <board name="MG32 MG04-06x(MG32F02V_ARGB)" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG04_06.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>ARGB</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_SPI_FLASH (SPI FLASH) ==================== -->
    <example name="FLASH Project" folder="Examples/MG32F02V032/SPI_FLASH_Project" doc="Abstract.txt" version="1.0">
      <description>Access MX25L3206E flash by SPI </description>
      <board name="MG32 TH229x_MG32F02V032_LQFP-32_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="SPI_FLASH_Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>SPI FLASH</keyword>
        <keyword>FLASH</keyword>
        <keyword>SPI</keyword>
      </attributes>
    </example>
    <!-- ==================== for RTC Show Calendar ==================== -->
    <example name="RTC Show Calendar Project" folder="Examples/MG32F02V032/RTC_ShowCalendar" doc="Abstract.txt" version="1.0">
      <description>Display calendar through RTC module</description>
      <board name="MG32 TH229x_MG32F02V032_LQFP-32_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="RTC_ShowCalendar.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>RTC</keyword>
        <keyword>Calendar</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_PWM_AudioOut (Driver level) ==================== -->
    <example name="PWM Audio Project (Driver level)" folder="Examples/MG32F02V032/MG32F02V032_PWM_AudioOut/MG32F02V032_PWM_AudioOut_DRV" doc="Abstract.txt" version="1.0">
      <description>MG32 TH229x_MG32F02V032_LQFP-32_EV_Board (Driver level)(+DB05-02)</description>
      <board name="MG32 TH229x_MG32F02V032_LQFP-32_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z_PWM_AudioOut.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>PWM Audio</keyword>
        <keyword>Audio</keyword>
      </attributes>
    </example>
    <!-- ==================== for MG32x02z_PWM_AudioOut (Middleware level) ==================== -->
    <example name="PWM Audio Project (Middleware level)" folder="Examples/MG32F02V032/MG32F02V032_PWM_AudioOut/MG32F02V032_PWM_AudioOut_MID" doc="Abstract.txt" version="1.0">
      <description>MG32 TH229x_MG32F02V032_LQFP-32_EV_Board (Middleware level)(+DB05-02)</description>
      <board name="MG32 TH229x_MG32F02V032_LQFP-32_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="MG32x02z_PWM_AudioOut.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>PWM Audio</keyword>
        <keyword>Audio</keyword>
      </attributes>
    </example>
    <!-- ==================== for SPI_ePaper_2.13inch ==================== -->
    <example name="SPI_ePaper_2.13inch" folder="Examples/MG32F02V032/SPI_ePaper_2.13inch/" doc="Abstract.txt" version="1.0">
      <description>SPI driver with TH229x_MG32F02V032_LQFP-32_EV_Board + 2.13inch e-Paper HAT</description>
      <board name="MG32 TH229x_MG32F02V032_LQFP-32_EV_Board" vendor="Megawin"/>
      <project>
        <environment name="uv" load="SPI_ePaper_2.13inch.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="Core"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <keyword>SPI</keyword>
        <keyword>waveshare</keyword>
        <keyword>2.13</keyword>
      </attributes>
    </example>
  </examples>
</package>
